{
  "8 Sigma": {
    "page": "www.8sigma.eu",
    "company_address": "Ivana Šibla 17 10000 Zagreb",
    "company_desc": "8 Sigma d.o.o. je mlada tvrtka osnovana od etabliranih stručnjaka na području naprednih softverskih rješenja za industrijska postrojenja, poznatih i kao Manufacturing Execution Systems (MES), Level 2 i Level 3. Izvozno smo orijentirana tvrtka, naš brzo rastući tim ima iskustva s projektima na 5 kontinenata, klijenti su nam vodeće industrijske tehnološke kompanije.",
    "jobs": [
      {
        "position": "Back-end developer",
        "position_desc": "Voliš razvijati softver za konkretne inženjerske procese? Voliš biti involviran u razne aspekte razvoja softvera i naučiti puno o domeni za koju programiraš? Ako je DA odgovor na bilo koje od ovih pitanja, javi nam se. Nudimo rad na naprednim softverskim rješenjima za industrijska postrojenja - Manufacturing Execution Systems (MES). Koristimo nove tehnologije i pratimo trendove u razvoju softvera. Raspon tehnologija i alata s kojima radimo su: C#, ASP.MVC, Angular 2+, Entity Framework, Sql Server, Oracle, Azure DevOps, Git.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "17.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, prema odrađenim satima preko studentskoga ugovora."
      },
      {
        "position": "Front-end developer",
        "position_desc": "Voliš razvijati softver za konkretne inženjerske procese? Voliš biti involviran u razne aspekte razvoja softvera i naučiti puno o domeni za koju programiraš? Ako je DA odgovor na bilo koje od ovih pitanja, javi nam se. Nudimo rad na naprednim softverskim rješenjima za industrijska postrojenja - Manufacturing Execution Systems (MES). Tražimo front-end developera za poslove razvoja korisničkog sučelja u modernim web tehnologijama. Koristimo nove tehnologije i pratimo trendove u razvoju softvera. Raspon tehnologija i alata s kojima radimo su: C#, ASP.MVC, Angular 2*, Entity Framework, Sql Server, Oracle, Azure DevOps, Git.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, prema odrađenim satima preko studentskoga ugovora."
      }
    ]
  },
  "Ai Data Labs": {
    "page": "www.ai-datalabs.hr",
    "company_address": "Dr. A. Starčevića 6 43000 Bjelovar www.ai-datalabs.hr",
    "company_desc": "Ai Data Labs d.o.o. za računalno programiranje je tvrtka koja se fokusira na razvoj inteligentnih rješenja kao platforme u područjima umjetne inteligencije, embedded sustava i integracije informacijsko-komunikacijskih sustava kod upravljanja gradom (inteligentni prometni sustavi, pametno gospodarenje otpadom) te komunikacijskih sučelja u autoindustriji.",
    "jobs": [
      {
        "position": "Mobile-app / Web-app developer",
        "position_desc": "Razvoj softvera za web i mobilne aplikacije, razvijanje baza podataka, pomoć pri definiranju arhitekture softverskih modula u client-server aplikacijama. Rad u virtualnim timovima u agilnom okruženju (SCRUM framework) sa profesionalnim alatima vođenja projekata (transparentno definiranje i praćenje zadataka preko Jira sustava). Studenti neka se javljaju e-mailom sa kratkim životopisom u privitku .",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "20.04.2020",
        "end": "31.08.2020",
        "compensation": "Po završenom zadatku (transparentno definiranje i praäenje zadataka preko Jira sustava povezanog sa GIT-om). Rad na daljinu (od kuće) moguć i poželjan. 25 kn/h"
      }
    ]
  },
  "ALTPRO": {
    "page": "http://www.altpro.com ",
    "company_address": "Velika cesta 41, 10020 Zagreb_Odra",
    "company_desc": "Godina je 1994., Intel predstavlja Pentium procesor, mobilni telefoni su neprihvatljivo skupi, a FLASH kartice su veličine 24MB. Potencijal tehnologije koja tek potajice dolazi prepoznaje skupina inženjera elektrotehnike. Zahvaljujući njima, te iste 1994., u Zagrebu, s radom započinje jedna od hrvatskih najinovativnijih tvrtki - ALTPRO. Osnivači tvrtke prepoznaju pravi trenutak i glavni fokus profesionalnog usmjerenja okreću prema željeznici. Altpro se bavi razvojem, istraživanjem i proizvodnjom elektroničkih signalno-sigurnosnih uređaja za željezničku infrastrukturu i vozila. Tvrtka vlastitim znanjem i specifičnim pristupom rješavanju tehnoloških izazova, razvija elektroničku opremu visoke efikasnosti i pouzdanosti. To su sustavi osiguranja željezničko-cestovnih prijelaza, sustavi detekcije vlaka bazirani na kontroli zauzetosti pojedinih odsjeka željezničke pruge, zatim razni točkasti sustavi detekcije vlaka te uređaji za sigurnost vozila poput autostopa (sustav automatske kontrole brzine vlaka). Za sve svoje proizvode ima certifikate o najvišem stupnju sigurnosti (SIL4) sukladno EN CENELEC normama. Kao u početku, tako i danas, ALTPRO je u korak s najnovijim tehnologijama te ih koristi na najinovativniji način. Da je tome tako svjedoči i to što je ALTPRO danas tvrtka od 25 godina iskustva, preko 150 zaposlenih stručnjaka na svim područjima svoje djelatnosti, nebrojenim proizvodima te s tržištem u preko 48 zemalja svijeta. Spremni smo podijeliti naše znanje s generacijama inženjera koji tek trebaju stupiti u svoje profesionalno zvanje.",
    "jobs": [
      {
        "position": "C/C++ programer",
        "position_desc": "Zadatak studenta je sudjelovati u razvoju aplikacija automatskog bilježenja podataka i drivera datotečnog sustava. Studenta se potiče na inovativni pristup u rješavanju zadatka i timski rad. Trajanje prakse 4 tjedna.",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "",
        "end": "",
        "compensation": "da"
      },
      {
        "position": "Embedded programer",
        "position_desc": "Zadatak studenta je sudjelovati u razvoju DSP i komunikacijskih softverskih modula. Student u radu koristi ARM Cortex M4 arhitekturu. Studenta se potiče na inovativni pristup u rješavanju zadatka i timski rad. Trajanje prakse 4 tjedna.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "da"
      },
      {
        "position": "FPGA programer",
        "position_desc": "Zadatak studenta je sudjelovati u razvoju DSP i komunikacijskih modula programabilne logike. Studenta se potiče na inovativni pristup u rješavanju zadatka i timski rad. Trajanje prakse 4 tjedna.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "",
        "end": "",
        "compensation": "da"
      },
      {
        "position": "Programer embedded web aplikacija",
        "position_desc": "Zadatak studenta je sudjelovati u razvoju embedded web aplikacije za konfiguraciju linux embedded komunikacijskog uređaja. Studenta se potiče na inovativni pristup u rješavanju zadatka i timski rad. Trajanje prakse 4 tjedna.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "da"
      },
      {
        "position": "Programer u MATLAB alatu",
        "position_desc": "Zadatak studenta je sudjelovati u razvoju i optimizaciji algoritama matematičkih modela te obrade akviziranih signala. Studenta se potiče na inovativni pristup u rješavanju zadatka i timski rad. Trajanje prakse 4 tjedna.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "da"
      }
    ]
  },
  "APIS IT": {
    "page": "http://www.apis-it.hr/",
    "company_address": "Paljetkova 18 10001 Zagreb",
    "company_desc": "Agencija za podršku informacijskim sustavima i informacijskim tehnologijama, APIS IT d.o.o., osnovana je krajem 2005. ugovorom između Vlade RH i Grada Zagreba, kako bi na pozitivnim iskustvima Gradskog zavoda za automatsku obradu podataka, GZAOP-a, obavljala poslove razvoja i podrške ključnim informacijskim sustavima RH i Grada Zagreba, te razvila aplikativne servise i čuvala potrebne informacijske baze, što je temelj funkcioniranja moderne elektronički podržane uprave. U stvaranju informacijskog društva uloga APIS IT je razvijanje i praćenje implementacije smjernica, normi i politike za razvoj e-uprave, davanje podrške tijelima državne uprave u razvoju vlastite strategije e-poslovanja, razvijanje i podupiranje zajedničke računalno-komunikacijske i aplikacijske infrastrukture, promoviranje primjene najboljih iskustava u upravljanju informacijskim sustavima, uključujući i zaštitu osobnih podataka, te razvijanje zajedničkih elektroničkih usluga i centralni pristup informacijskim resursima državne uprave uz odgovarajuću autorizaciju i autentikaciju. Cilj APIS IT-a je zadržati vodeću ulogu u isporuci kvalitetno osmišljenih i integriranih usluga i servisa.",
    "jobs": [
      {
        "position": "Razvojni inženjer .NET/Angular",
        "position_desc": "Zainteresirani smo za Backend developera (.NET core razvojni inženjer) i Frontend developer (Angular razvojni inženjer) koji bi, u sklopu programa Ljetne prakse, bili angažirani na razvojnim projektima unutar Odjela za .NET razvoj",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da (po završetku prakse)"
      },
      {
        "position": "Razvojni inženjer u JAVA odjelu",
        "position_desc": "U okviru prakse radi se interesantan projekt kroz koji se upoznaje s Java programskim jezikom koristeći Spring framework, Angular, Apache Kafku te ostale Big data alate. Na projektu se radi timski pod vodstvom mentora na način da svaki član tima dobije svoj zadatak koji po završetku zajedno integrira sa ostalim članovima tima. Kroz rad na projektu polaznik prakse se upoznaje s osnovnim konceptima višeslojnog razvoja web aplikacija te dizajna baze podataka kao i cijelim razvojnim procesom kroz koji su nastale aplikacija poput sustava Osobnog korisničkog pretinca, Sustava za podršku izborima, ePorezne, Oib sustava, Fiskalizacije i drugih.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "11.09.2020",
        "compensation": "Da (po završetku prakse)"
      },
      {
        "position": "Razvojni inženjer (web/mobile)",
        "position_desc": "Traže se Fullstack Node.js developer (razvojni inženjer) i/ili Frontend developer (razvojni inženjer) (Razvojni inženjer) i/ili Developer mobilnih aplikacija (Kotlin, Swift) koji bi u sklopu programa Ljetnih praksi FER-a, bili angažirani na razvojnim projektima unutar Odjela za izradu web i mobilnih aplikacija",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da (po završetku prakse)"
      },
      {
        "position": "Testni inženjer",
        "position_desc": "Testni inženjer obavlja automatizirano funkcionalno i performansno testiranje aplikacija prema korisničkim zahtjevima. Izrađuje testne scenarije, priprema testne podatke i kreira testne skripte u alatima za automatizaciju testiranje. Organizira i provodi performansna testiranja s ostalim članovima razvojnog tima.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "20.08.2020",
        "end": "15.09.2020",
        "compensation": "Da (po završetku prakse)"
      }
    ]
  },
  "Artronic": {
    "page": "www.skytrack.net;www.artronic.hr",
    "company_address": "Črnomerec 29 10000 Zagreb Hrvatska",
    "company_desc": "Artronic je vodeća tvrtka u regiji koja se bavi razvojem i proizvodnjom telemetrijskih sustava, te razvojem i implementacijom sustava optimizacije procesa u logistici i mobilnom poslovanju. Primarni proizvod tvrtke je SkyTrack, sustav optimizacije i upravljanja velikim flota vozila koji je implementiran u većini velikih kompanija u široj regiji. Hardverski proizvodi tvrkte bazirani su na ARM platformama, a korisnti se širok spektar žičnih i bezžičnih komunikacijskih protokola (BT, GNSS, GSM, 3/4G, WiFi, 1-Wire, CANbus, USB, ...). U softverskim rješenjima koriste se gemetski i evolucijski algoritmi, neuronske mreže i big data modeli.",
    "jobs": [
      {
        "position": "Embedded software developer",
        "position_desc": "Programiranje na ARM platformi, razvoj programske podrške za NRF, BT, GSM, RFID, WiFi",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da"
      }
    ]
  },
  "ATOS Convergence Creators": {
    "page": "https://atos.net/en/convergence-creators",
    "company_address": "Ulica grada Vukovara 284, 10000 Zagreb Ulaz B jug",
    "company_desc": "Atos je globalni lider na području digitalne transformacije s oko 100.000 zaposlenih u 72 zemlje svijeta, a godišnje ostvaruje oko 12 milijardi eura prihoda. Grupa je europski lider na prodručjima Big Data, Cybersecurity, High Performance Computing i Digital Workplace, isporučujemo Cloud services, Infrastructure & Data Management, Business & Platform rješenja kao i transakcijske usluge putem Worldlinea, europskog lidera na području platnih usluga. Atos Convergence Creators d.o.o. u okviru organizacije Atos Grupe pripada u poslovnu diviziju Big Data and Security (BDS), Global Business Line (GBL) Mission-Critical Systems (MCS) i globalni je ponuđač inovativnih ICT proizvoda, rješenja i servisa. U Hrvatskoj uspješno poslujemo od 1995. godine kao dio lokalne Siemensove kompanije, a od 1. siječnja 2018. dio smo Atos SE (Societas Europea) grupacije. Korištenjem najmodernijih tehnologija, digitalnom stručnošću i industrijskim znanjem podržavamo digitalnu transformaciju korisnika na različitim tržišnim područjima: obrana, financijske usluge, zdravstvo, proizvodni sektor, mediji i komunalne usluge, javni sektor, trgovina, telekomunikacije (uključujući 5G) i promet.",
    "jobs": [
      {
        "position": "Software inženjer",
        "position_desc": "Studentima i studenticama viših godina telekomunikacija i računarstva (ostali smjerovi nisu isključeni) nudimo mogućnost rada, učenja i suradnje s vrhunskim stručnjacima i mentorima na interesantnim međunarodnim projektima koji pokrivaju područja od obrane, financijskih usluga, zdravstva, proizvodnog sektora ili medija do telekomunikacija, javnog sektora, komunalnih usluga, trgovine i prometa . Rad u našoj kompaniji izvrsna je prilika za stjecanje novih primjenjivih znanja, vještina i iskustava, često u međunarodnom okruženju, koji se mogu pokazati presudnima u odabiru i početku razvoja karijere. Mjesto rada je u u našem sjedištu u Zagrebu, ali kako poslujemo i na lokacijama u Osijeku i Splitu, postoji mogućnost rada na sve tri lokacije. Mogće je praksu odraditi i od kuće.",
        "n_available": 5,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da. Način formiranja honorara odredit će se naknadno, sukladno projektnim mogućnostima i željama studenta/ice."
      }
    ]
  },
  "ATP Projektiranje": {
    "page": "www.atp.ag",
    "company_address": "Planinska ulica 13a, 10000 Zagreb",
    "company_desc": "ATP architects engineers s više od 900 djelatnika u deset europskih ureda je najveća tvrtka za integralno projektiranje u Europi. Specijalizirani smo za projektiranje objekata namijenjenih za trgovinu i zabavu, poslovne prostore, industriju i logistiku, obrazovanje i znanost, te za zdravstvene, stambene i turističke objekte. Kako bi se podržao temeljni zahtjev naših investitora za održivom gradnjom, uz poštivanje rokova i visoke kvalitete građevina, ATP razvija inovativna rješenja u svim fazama projektiranja. Temeljen na simultanoj suradnji, naš način rada ima za cilj pronaći savršenu ravnotežu između estetskih, funkcionalnih i konstruktivnih promišljanja, te pronalazak najboljeg rješenja u području zaštite okoliša, ljudskih i ekonomskih elemenata.",
    "jobs": [
      {
        "position": "Praktikant u odjelu elektroinstalacija",
        "position_desc": "• ispomoć u odjelu elektroinstalacija • projektiranje elektroinstalacija i izrada tehničke dokumentacije u zgradarstvu i industriji • izrada projekata u BIM-u • rad u timu i suradnja s projektantima drugih struka unutar ATP-a",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "01.06.2020",
        "end": "",
        "compensation": "DA; Sukladno studentskoj satnici"
      }
    ]
  },
  "AVL-AST": {
    "page": "www.avl.com",
    "company_address": "Strojarska cesta 22, Zagreb",
    "company_desc": "AVL List GmbH ( Graz, Austrija) je najveća privatna tvrtka za razvoj pogonskih sustava motora s unutarnjim izgaranjem te mjerne i istraživačke opreme za motore. AVL-AST d.o.o. Zagreb sa stotinjak zaposlenika je u vlasništvu AVL List GmbH čije djelovanje obuhvaća razvoj simulacijskog softvera za modeliranje fizikalnih procesa, razvoj softvera za upravljanje mjerenjima i mjernom opremom te projekte proračuna po narudžbi.",
    "jobs": [
      {
        "position": "Java programer za Atlassian Jira / Confluence pluginove",
        "position_desc": "Sudjelovanje u multinacionalnom distribuiranom timu zaduženom za: Razvoj Atlassian Jira i Confluence pluginova i sučelja prema drugim aplikacijama (Salesforce, Team Foundation Server,…), te testiranje istih. Izrada popratne interne dokumentacije",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "28.08.2020",
        "compensation": "Praksa će biti honorirana sukladno odrađenim satima."
      },
      {
        "position": "Junior C#/C++ developer",
        "position_desc": "AVL is the world's largest independent company for development, simulation and testing technology of powertrains (hybrid, combustion engines, transmission, electric drive, batteries and software) for passenger cars, trucks and large engines. Due to increased demand, we are looking for employees capable of blending in the development environment of large-scale distributed projects. If you enjoy technical challenges and would like to join the dynamic community of 200+ developers and engineers, don’t hesitate to apply. Your Responsibilities: Developing software solutions for advanced data-processing and visualization platform Developing reusable components and application features Working effectively in a collaborative and innovative team-oriented environment",
        "n_available": 3,
        "n_prioritized": 1,
        "start": "20.07.2020",
        "end": "31.08.2020",
        "compensation": "The internship will be remunerated according to the hours worked"
      },
      {
        "position": "Junior Web Front-end Developer (f/m)",
        "position_desc": "AVL is the world's largest independent company for development, simulation and testing technology of powertrains (hybrid, combustion engines, transmission, electric drive, batteries and software) for passenger cars, trucks and large engines. Due to increased demand, we are looking for employees capable of blending in the development environment of large-scale distributed projects. If you enjoy technical challenges and would like to join the dynamic community of 200+ developers and engineers, don’t hesitate to apply. Your Responsibilities: Design and development of reusable web controls, implemented as web components or Angular components Design and development of reusable services (authentication, localization, translation...) Development of toolkit based on mentioned controls and services, which provides common functionality, look and feel, for other teams to use and build web clients on top of Involvement in automated testing, CI/CD process Building rich and dynamic dashboards, shared visualization components, and custom visualizations for communicating data",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "28.08.2020",
        "compensation": "Praksa će biti honorirana sukladno odrađenim satima."
      }
    ]
  },
  "Comminus": {
    "page": "http://www.comminus.hr/",
    "company_address": "Avenija Većeslava Holjevca 40, 10000 Zagreb",
    "company_desc": "Comminus je tvrtka specijalizirana za upravljanje podacima, analitiku podataka te aplikativni razvoj. Portfelj tvrtke obuhvaća slijedeće usluge i rješenja: Usluge izrada skladišta podataka (baze podataka) obrada i analiza podataka izrada izvještaja (npr. regulatorno izvještavanje, kontroling i izvještavanje po odjelu) sistemska administracija i usluge podrške i održavanja Rješenja Business Intelligence Portal Project Management Portal Intranet Portal Customer Relationship Management (CRM) Sales Intelligence Analitika poslovnih procesa Aplikativna rješenja Customer Loyalty Total Audit Management System Regulatory Reporting Online Sports Betting Cash Flow, itd. Comminus je Mircrosoft Gold Partner sa slijedećim kompetencijama: Data Platform Data Anylitics Business Intelligence Application Development",
    "jobs": [
      {
        "position": "Data Analyst",
        "position_desc": "razvijanje i implementacija sustava za prikupljanje podataka prikup podataka iz primarnih i sekundarnih izvora te održavanje baza podataka identificiranje, analiziranje i interpretiranje trendova ili obrazaca u setovima podataka filtriranje, čišćenje i provjera podataka te identificiranje indikatora performansi kompiliranje statističkih podataka te prezentiranje istih svakodnevno sudjelovanje u DevOps procesu kao član projektnog tima",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "Data Management",
        "position_desc": "sudjelovanje u dizajnu projekata, razvoju i implementaciji rješenja za baze podataka koristeći alate Microsoft SQL Server sustava (MSSQL, SSIS, SSAS, SSRS) podrška na tekućim projektima rad na cloud arhitekturama koristeći Azure SQL baze podataka kao što su Azure SQL Database, Azure SQL Data Warehouse, Azure Data Factory, Azure Analysis Services sudjelovanje u DevOps procesu kao član development tima",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "Front-end Developer",
        "position_desc": "rad s najnovijim tehnologijama na zanimljivim projektima iz različitih industrija rad na specifikacijama UI dizajna (mocks) raznih web i nativnih aplikacija rad na UX projektima integracija s raznim back-end sustavima podrška na tekućim projektima te svakodnevno sudjelovanje u DevOps procesu",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "Full Stack Developer",
        "position_desc": "rad na zanimljivim projektima iz različitih industrija sudjelovanje u pripremi i razvitku novih projekata podrška na tekućim projektima svakodnevno sudjelovanje u DevOps procesu kao član development tima",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "Project Management",
        "position_desc": "svakodnevno sudjelovanje u DevOps procesu učenje o vođenju projekata, razvoju rješenja i usluga te suradnja s poslovnim korisnicima i internim development timom analiza poslovnih procesa te korisničkih zahtjeva kontrola kvalitete i funkcionalno testiranje razvoj funkcionalnih specifikacija",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "Quality Assurance",
        "position_desc": "kontrola kvalitete i funkcionalno testiranje automatizacija testnih procesa Unit, Functional i Load testiranja za projekte iz različitih industrija komunikacija s poslovnim korisnicima te sa samim timom o kreiranju i održavanju testnih slučajeva svakodnevno sudjelovanje u DevOps procesu",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      },
      {
        "position": "System Administrator",
        "position_desc": "informatička podrška kolegama instaliranje i održavanje softver i hardver opreme održavanje interne te klijentove ICT infrastrukture komunikacija s klijentima te rješavanje problema suradnja s development timom na raznim projektima te svakodnevno sudjelovanje u DevOps procesu",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o iskustvu studenta. Honoriranje se vrši prema odrađenim satima putem studentskog ugovora."
      }
    ]
  },
  "CROZ": {
    "page": "http://www.croz.net",
    "company_address": "Lastovska 23, Zagreb",
    "company_desc": "CROZ je hrvatska IT firma specijalizirana za razvoj custom softvera za naše klijente iz cijelog svijeta, a u 15 godina rada imamo više od 900 uspješno provedenih projekata u Hrvatskoj i inozemstvu. Kontinuirano gradimo agilne interdisciplinarne timove vješte u korištenju modernih alata i tehnologija. Ludi smo za naprednim integracijama, Data Managementom, arhitekturama koje se vrte u cloudu, Java tehnologijama, ali i svim onim front-end tehnologijama zbog kojih korisnici radije koriste naše aplikacije nego surfaju po društvenim mrežama. Radna atmosfera u CROZ-u jednostavno je neponovljiva, a nadaleko smo poznati i po vrhunskim tulumima, dinamičnim eventima i nezaboravnim teambuildinzima.",
    "jobs": [
      {
        "position": "Data Engineer",
        "position_desc": "Zanima te rad s podacima? Želiš vidjeti kojim tehnologijama i metodologijama pretvaramo sirove podatke u korisne informacije? Što znače sve \"fensi\" riječi vezane uz svijet podataka, kao što su BigData, Data Engineering, DataStage, Toad, DBeaver, Hadoop, Cognos, DataQuality, Spark, Hive, i još mnogo toga.... Na praksi ćete se susresti s radom na projektu koji kreće od analize poslovnog zahtjeva preko transformacije podataka do isporuke finalnog rješenja za naprednu analitiku u kontekstu vizualizacije podataka. Ovdje možeš saznati sve o Data engineeringu u CROZ-u: https://croz.net/data-engineering/ , a apsolutno sve o Data i ostalim CROZ ljetnim praksama doznaj na https://jobfair.croz.net/ gdje možeš vidjeti i snimku našeg virtualnog Job Faira (Priča o CROZ-u). * Ako nam korona ne dopusti da održimo prakse u CROZ-ovim uredima, organizirat ćemo ih u remote varijanti. Spremni smo na sve. :o)",
        "n_available": 5,
        "n_prioritized": 1,
        "start": "13.07.2020",
        "end": "25.09.2020",
        "compensation": "Da, prema odrađenim satima."
      },
      {
        "position": "Inženjer za integracije",
        "position_desc": "Ako želiš postati inženjer za integracije, glavna faca u gala IT svijetu punom \"otoka\" koje treba povezati na pravi način, osoba koja kontrolira cijeli proces između razvoja i završnog proizvoda koristeći raznorazne tehnologije: automatizacija (deploya, taskova, procesa, skripti...), startanje koječega na razne načine pod Linuxom, Windowsima, AIX-om i inima, konfiguriranje statičkih postavki za mrežno spajanje, konfiguriranje firewalla, konfiguracija proxyja, skriptiranje: Bash, Python, JavaScript, monitoring: Prometheus, Grafana, ELK stack, kontejnerizacija (Docker, Kubernetes i sl.), ili ostale zanimljive stvari poput: SNMP, LDAP, SSO, Postfix i slično, a također želiš vidjeti kako je to raditi u modernoj tvrtci s besplatnom kavom i doručkom, fleksibilnim radnim vremenom i mjestom i, najvažnije od svega, vrhunskim kolegama koji su uvijek tu da ti pomognu i oraspolože te svojim deluxe forama, onda je ovo praksa za tebe. Apsolutno sve o CROZ ljetnim praksama doznaj na https://jobfair.croz.net/ gdje možeš vidjeti i snimku našeg virtualnog Job Faira (Priča o CROZ-u). * Ako nam korona ne dopusti da održimo prakse u CROZ-ovim uredima, organizirat ćemo ih u remote varijanti. Spremni smo na sve. :o)",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "13.07.2020",
        "end": "25.09.2020",
        "compensation": "Da, prema odrađenim satima."
      },
      {
        "position": "Inženjer za razvoj softvera - Java",
        "position_desc": "razvoj svih aplikacijskih slojeva (od backenda u Javi do frontenda u nekom od danas popularnih JavaScript frameworka) upoznavanje s metodologijama i praksama razvoja softvera te design patternima razvoja softverskih komponenti testiranje i dokumentiranje razvijenog sustava Apsolutno sve o CROZ ljetnim praksama doznaj na https://jobfair.croz.net/ gdje možeš vidjeti i snimku našeg virtualnog Job Faira (Priča o CROZ-u). * Ako nam korona ne dopusti da održimo prakse u CROZ-ovim uredima, organizirat ćemo ih u remote varijanti. Spremni smo na sve. :o)",
        "n_available": 15,
        "n_prioritized": 0,
        "start": "13.07.2020",
        "end": "25.09.2020",
        "compensation": "Da, prema odrađenim satima."
      },
      {
        "position": "Poslovni analitičar/Tester",
        "position_desc": "Dobar si duh svakog tima. Puno tražiš, puno daješ. Kako bi dobro razumio korisnika, spreman si ući u njegove... sandale. Gradiš stabilne veze između korisnika i razvojnog tima. Znaš što i zašto se gradi, a znaš i kad i zašto to (ni)je dovoljno dobro. A sad za ozbač, radit ćeš sljedeće: prikupljanje i analiza zahtjeva naručitelja, odnosno korisnika IT sustava; specificiranje zahtjeva u formi User story-ja , uključujući uvjete prihvaćanja ( Acceptance criteria ); sudjelovanje u prioritizaciji zahtjeva; podrška razvojnom timu u dijelu tumačenja specifikacije zahtjeva i rješavanja otvorenih pitanja; priprema testova i testiranje; kontinuirana briga o kvaliteti isporuka. Apsolutno sve o CROZ ljetnim praksama doznaj na https://jobfair.croz.net/ gdje možeš vidjeti i snimku našeg virtualnog Job Faira (Priča o CROZ-u). * Ako nam korona ne dopusti da održimo prakse u CROZ-ovim uredima, organizirat ćemo ih u remote varijanti. Spremni smo na sve. :o)",
        "n_available": 5,
        "n_prioritized": 0,
        "start": "13.07.2020",
        "end": "25.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima."
      },
      {
        "position": "UX/UI designer/Front-end developer",
        "position_desc": "Zadaci UX/UI designera/front-end developera su dizajn i razvoj intuitivnih i interaktivnih korisničkih sučelja za web aplikacije/stranice i mobilne aplikacije. Na putu od ideje do realizacije takvog sučelja, UX/UI designer/Front-end developer, u suradnji s korisnikom i ostalim članovima tima, osmislit će sučelje, prototipirati ga korištenjem dizajn i razvojnih alata, provesti testiranje te konačno raditi na implementaciji sučelja koristeći popularne front-end frameworke i CMS sustave. Apsolutno sve o CROZ ljetnim praksama doznaj na https://jobfair.croz.net/ gdje možeš vidjeti i snimku našeg virtualnog Job Faira (Priča o CROZ-u). * Ako nam korona ne dopusti da održimo prakse u CROZ-ovim uredima, organizirat ćemo ih u remote varijanti. Spremni smo na sve. :o)",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "13.07.2020",
        "end": "25.09.2020",
        "compensation": "Da, prema odrađenim satima."
      }
    ]
  },
  "Cuspis": {
    "page": "www.cuspis.com",
    "company_address": "Trg Dražena Petrovića 3 (Cibonin toranj), 10. kat, Zagreb.",
    "company_desc": "Cuspis Group osnovana je 10. svibnja 2005. godine osnivanjem prve tvrtke Cuspis: London Cuspis sa sjedištem u Londonu . Četiri godine kasnije, 2009 . osnovane su tvrtke Cuspis Hrvatska i Cuspis Makedonija , zatim Cuspis Bosna i Hercegovina 2011. te Cuspis Srbija 2015. godine. Danas su tvrtke Cuspis grupe IT tvrtke usredotočene na isporuku softverskih rješenja s više od 15 godina iskustva u razvijanju softvera i savjetovanja u IT industriji. Afirminirani smo po našoj tehničkoj izvrsnosti, troškovno učinkovitim proizvodima te uporabi najnovijih tehnologija. U naše klijente ubraja se niz tvrtki, državnih tijela i internacionalnih organizacija. Imamo iskustva u radu na tržištu Velike Britanije i drugih EU zemalja, kao i sa zemljama jugoistočne Europe koje nisu članice EU.",
    "jobs": [
      {
        "position": "Crypto maniacs - druga generacija (Bitcoin full node, Bitcoin Lightning node, Lightning cafe, CUS Crypto Coin, CUS Crypto Coin mobile Wallet, Loyalty CUS Crypto Coin, CUS Crypto Coin cafe)",
        "position_desc": "Prošle godine uzeli smo troje FER-ovaca na stručnu praksu kao 1. generacija Crypto maniacs-a. Svo troje je ostalo i nakon prakse s nama i evo već je prošla skoro godina dana od njihovog dolaska. Počeli smo od nule. Voditelj prakse je imao teorijska znanja i nešto prakse u Crypto worldu te tada najmodernije minere za Bitcoin Antiminer S17Pro (od www.bitmain.com) za Litecoin Antminer L3++ te za Ether Antminer E3 kojima su studenti prve generacije prakse imali pristup. U ovih godinu dana naučili smo jako puno o crypto worldu i u široj regiji nema nikoga tko nam je blizu: podigli smo vlastiti Bitcoin full node, dakle cjelokupnu kopiju bitocin blockchaina i postali jedni od onih koji podržavaju Bitcoin mrežu i potvrđuju transakcije. dignuli smo vlastiti Bitcoin Lightining node - te smo sada jedan od 5.253 node-a u svijetu te routiramo Bitcoin transakcije preko Lightning mreže (vidi: https://explorer.acinq.co/n/03ddc2ca04c535acfa0c07c09270343ff295bad138b829c5ede10b8c84b9f099e1 i https://1ml.com/node/03ddc2ca04c535acfa0c07c09270343ff295bad138b829c5ede10b8c84b9f099e1 ) napravili smo aplikaciju: Bitcoin Lighting Web Cafe koju smo testirali na našim crypto partyima podignuli smo testni Ethereum blockchain i na njemu proučili sve tajne Ethereuma izgradili smo vlastite web servise koji direktno šalju upite na Ethereum blockchain kreirali smo vlastitu crypto valutu: Cus Cypto Coin (vidi: https://etherscan.io/token/0xbf5932b941c413800b69791d5eb35ac91c48718b ) kreirali smo vlastitu mobilnu aplikaciju za Android (u beta fazi) i sada završavamo za iOS koja je wallet za Ether i Cus Crypto Coin, te ima funkcije plaćanja i primanja sredstava kreirali smo web aplikaciju Loyalty CUS kreirali smo aplikaciju CUS Crypto Coin Cafe koju smo testirali na naši crypto partyima pred startom je cuscoin.io web site - One stop shop for all things crypto U ovih godinu dana napravili smo puno i tražimo drugu generaciju Crypto maniacs koja će se pridružiti prvoj generaciji u stvaranju crypto revolucije. Druga generacija ima puno bolju startnu poziciju budući da smo u ovih godinu dana akumulirali znatno znanje i imat će od koga učiti. Želimo u ovom periodu koji je pred nama lansirati niz crypto proizvoda te Vas pozivamo da postanete Crypto maniac!",
        "n_available": 6,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da."
      }
    ]
  },
  "Databox": {
    "page": "https://databox.hr/",
    "company_address": "Savica I. 133, 10 000 Zagreb",
    "company_desc": "Tvrtka DataBox jedan je od vodećih pružatelja cloud i data centar rješenja u regiji. Kroz specifična znanja naših IT stručnjaka pružamo usluge zakupa virtualne i dedicirane infrastrukture, disaster recovery rješenja, rješenja sigurnosne pohrane podataka kao i rješenja nadzora ICT sustava te projektiranja, implementacije i održavanja podatkovnih centara na lokaciji korisnika. Svojim korisnicima nudimo vrhunske usluge i tehnologije kroz partnerstva s vodećim svjetskim tvrtkama, kontinuirano pratimo najnovije trendove na IT tržištu te ih implementiramo u svoje poslovanje što dokazuje i činjenica da su naša IT rješenja sigurna, pouzdana i posebno krojena prema zahtjevima korisnika, a ne zahtijevaju dodatna kapitalna ulaganja.",
    "jobs": [
      {
        "position": "Facility tehničar",
        "position_desc": "Facility tehničar imat će priliku raditi s našim stručnjacima koji će im omogućiti bolje upoznavanje rada na elektrostrojarskoj infrastrukturi podatkovnog centra i i instalacije opreme.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": ""
      }
    ]
  },
  "divIT / Delta Reality": {
    "page": "http://deltareality.com/ ",
    "company_address": "Vranovina 30, 10000 Zagreb",
    "company_desc": "Tvrtka divIT/Delta Reality se bavi izradom softvera u Unity 3d engineu te izradom igara i iskustava u virtualnoj, proširenoj i miješanoj stvarnosti. Globalno smo prepoznati kao eksperti na području navedenih tehnologija, te naše usluge koriste klijenti iz EU i SAD-a. Jako puno ulažemo u nove tehnologije i razvoj tako da se na našim policama može pronaći hardware poput Oculus Rifta, HTC Vivea, Kinect kamere, Leap Motiona, Microsoft Hololens, Magic Leap.... Neke od projekata tvrtke možete vidjeti na Delta Reality. S ljetnim praksama krenuli smo \"davne\" 2013. godine i još uvijek s nama rade kolege koji su počeli kao praktikanti, tako da postoji mogućnost trajnog zaposlenja po završetku prakse. Veselimo se vašoj prijavi.",
    "jobs": [
      {
        "position": "C# Unity developer - VR/AR",
        "position_desc": "Ako vas interesiraju nove tehnologije, mladi tim i opuštena atmosfera onda je ovo mjesto za vas. Cilj prakse je da samostalno isporučite 3 funkcionalne aplikacije na području proširene i virtualne stvarnosti. Tijekom trajanja prakse proći ćete kroz 4 cjeline. 1. Napredno korištenje Unity 3D enginea 2. Izrada VR aplikacije 3. Izrada AR aplikacije 4. Izrada mobilne aplikacije za Android i iOS platformu. Za vrijeme trajanja prakse dodijeljen vam je senior developer s kojim direktno komunicirate po pitanju programskih naputaka, izvršenja zadataka, problema koje morate riješiti itd. Praksa traje 4 tjedna odnosno 20 radnih dana Uz prijavu priložite linkove na relevantne projekte i radove na kojima ste radili.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "28.08.2020",
        "compensation": "Praksa je honorirana po završetku iste."
      }
    ]
  },
  "DOK-ING": {
    "page": "http://www.dok-ing.hr",
    "company_address": "Slavonska avenija 22 G 10000 Zagreb",
    "company_desc": "DOK-ING is a 100% privately owned Croatian company, established in the late 1991 and registered for the production of robotized and special purposes systems and equipment. The headquarters, production facilities and service are located at 15.000 square meters area in Zagreb, Croatia. The secondary production facilities are in Slunj, some 50 km south of Zagreb. Along with the branch office in USA, there is a company in South Africa, DOK-ING Africa, which supports the program for south African mines. Today DOK-ING has 220 employees, almost 170 being in Zagreb, another 30 in Slunj and up to 20 in South Africa. During first period DOK-ING was actively engaged in demining activities and has gathered vast experience in different types of landmine clearance, on all types of terrain in the Republic of Croatia, as well as in the surrounding countries. This experience was the basis for designing and manufacturing the first remotely controlled demining systems, constructed exclusively for humanitarian demining. As those were upgraded, improved and enlarged, the company has been doing R&D projects with various international and domestic organizations, including Croatian Ministry of Science, Education and Sport and State Maritime Institute (Brodarski institut), Faculty of Electrical Engineering and Computing of the University of Zagreb, and Geneva International Centre for Humanitarian Demining (GICHD). The demining systems were at the same time sold to more than 20 countries worldwide, a number of government agencies and humanitarian organizations, as well as to commercial companies. Altogether, more than 250 light and medium size demining systems were produced so far. Following the company's motto „Don't send a man to do a machine's job“, the mining program has been started with an extra low profile equipment. After first products were tested, a new development phase has been going on and should deliver a completely new set of ultra low equipment very soon. Trying to protect and secure people working in an extremely dangerous domain of firefighting, DOK-ING designed a multifunctional robotic system which would help them do the job and be safe at the same time. Following the instinct, the new development is reaching issues of hybrid drive and nuclear sector application. And then, last but not least important, DOK-ING designed and manufactured the first Croatian urban electric car with excellent automotive performances. Today DOK-ING, in a few words, by integrating its own innovations and new technologies, develops and manufactures special purpose systems to protect human lives in most dangerous environments, primarily in demining, mining and fire-fighting. And moreover, investing in business excellence everyone at DOK-ING is trying to create good basis for enlargement of the innovative product range, ensuring the recognition of the company on the world market.",
    "jobs": [
      {
        "position": "Razvojni inženjer elektronike – Dorada postojećeg uređaja",
        "position_desc": "Za postojeći uređaj za testiranje CAN komunikacije osmisliti i izraditi kučište i tiskanu pločicu tako da se osigura robusnost i siguran rad uređaja uz intuitivan način korištenja.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "22.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Razvojni inženjer elektronike – Upravljanje robotskom rukom",
        "position_desc": "Na modelu robotske ruke ostvariti upravljanje pomoću mikroupravljača porodice STM32 te komunikaciju s daljinskim upravljačem vlastite proizvodnje te implementirati i testirati različite algoritme upravljanja.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "22.07.2020",
        "compensation": "Ne"
      }
    ]
  },
  "doXray B.V.": {
    "page": "https://doxray.com/",
    "company_address": "Borculoseweg 0041 NL-7161GR Neede",
    "company_desc": "COMPLEX DOCUMENT ANALYSIS IN SECONDS",
    "jobs": [
      {
        "position": "Natural Language Processing Graduate Researcher",
        "position_desc": "Description: Project-oriented summer internship in applied Deep Learning Continuous mentorship and progress tracking secured via: Weekly consultations with doXray AI core team Dedicated Slack channel for any kind of inquiry We are offering: Professional guidance Remote work Flextime schedule Paid internship Employment opportunity",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Praksa je plaćena. Ovisno o dogovoru može biti prema projektu ili prema odrađenim satima. Raspon 30-40 kuna po satu ovisno o kompetencijama."
      }
    ]
  },
  "Ekobit": {
    "page": "https://www.ekobit.com",
    "company_address": "Koturaška 69, Zagreb",
    "company_desc": "Ekobit je vrhunska, prvenstveno izvozna tvrtka za proizvodnju softvera i DevOps. Poznati smo i po organizaciji DevArene, NAJtehnološke developerske konferencije te inovativnim proizvodima za globalno tržište poput www.BizDataX.com. Nudimo iznimne mogućnosti stalnog usavršavanja znanja i vještina.",
    "jobs": [
      {
        "position": "C++/.NET developer",
        "position_desc": "Razvoj legacy Windows desktop aplikacije. Uključuje rad na svim slojevima: UI/Business Logic/Database. Postoji opcija remote rada.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima."
      }
    ]
  },
  "Elpos": {
    "page": "www.elpos.hr",
    "company_address": "Radnovac 1G 34308 Jakšić (Požega)",
    "company_desc": "Tvrtka Elpos d.o.o. osnovana je 1990 godine u Požegi i po klasifikaciji spada u mala poduzeća. Kao i mnoga druga privatna poduzeća i ELPOS d.o.o. je krenuo „iz garaže“, da bi 2005. godine uselio u vlastiti proizvodni pogon s halom i pratećim objektom. Od osnutka tvrtke broj radnika je postepeno, ali stalno rastao. Trenutno tvrtka zapošljava 9 radnika, od čega je 6 sa visokom stručnom spremom. Sjedište tvrtke je u Požegi dok se proizvodni pogon nalazi u mjestu Radnovac pokraj Požege. Od ostalih zanimljivosti valja napomenuti da je 2012. godine na krovu svog proizvodnog objekta tvrtka izgradila solarnu elektranu snage 30 kW te je iste godine tvrtka nagrađena sa županijskom Zlatnom kunom. Osnovna djelatnost poduzeća je: a) izrada podnih električnih grijanja b) izrada električnih grijanja cjevovoda - sa svrhom zaštite od smrzavanja ili održavanja tehnoloških temperatura c) izrada električnih grijanja oluka i odvoda oborinske vode d) izrada električnih grijanja vanjskih površina ( stepeništa, staze, garažne rampe … ) e) izrada električnih grijanja tla ispod komora u hladnjačama f) specijalna grijanja ( brane hidroelektrana, brodovi, žaluzine klima komora … ) U sklopu daljnjeg razvoja tvrtka planira pokrenuti proizvodnju industrijskih elektroničkih uređaja kao što su termostati, releji i specijalizirani elektronički regulatori. U tu svrhu zainteresirani smo za organiziranje stručne prakse za studente u segmentu razvoja elektroničkih sklopova i programske podrške. Kroz stručnu praksu studenti bi surađivali u razvoju pojedinih dijelova novih industrijskih proizvoda (npr. izrada napajanja, upravljanja, komunikacije). Ovisno o vrsti posla i interesa studenata rad na razvoju bi podrazumjevao jednu ili više sljedećih radnji : izrada električnih shema, izrada shema tiskanih vodova, uhodavanje sklopovlja, izrada programske podrške za mikrokontrolere i/ili stolna računala.",
    "jobs": [
      {
        "position": "C/C++ razvoj grafičkog sučelja (GUI) u za uređaj sa ARM mikrokontrolerom",
        "position_desc": "Studenti će sudjelovati u izradi grafičkog korisničkog sučelja (GUI) za uređaj koji posjeduje 1.8\" TFT LCD ekran. Uređaj pogoni ARM Cortex M0 mikrokontroler. Kod će biti pisan u C/C++-u. Ukoliko studenti nemaju iskustva u C++-u razvojni inženjeri tvrtke će objasniti osnovne koncepte i pomoći studentima u savladavanju programskog jezika C++. Po početku prakse studenti će biti upoznati sa načinom funkcioniranja uređaja te sa GUI bibliotekom koja se koristi za upravljanje LCD-om. Cilj prakse je dodati nove GUI elemente (npr. dodati tipku, tekst i/ili sliku na ekran) i time povećati funkcionalnost uređaja. Kroz praksu će studenti biti upoznati sa načinom programiranja i pisanja koda za ugrađeni računalni sustav. Objasniti će im se koji se sve razvojni alati koriste i koja je uloga pojedinog alata. Također će biti objašnjeno na koji način radi GUI biblioteka koja se već koristi te će dobiti uvid u to kako se upravlja LCD ekranom. Studenti će imati priliku raditi sa FreeRTOS ugrađenim operativnim sustavom te GNU razvojnim alatima. Praksa je idelna za studente koji se u budućnosti žele baviti, ili se trenutno interesiraju, za pisanje software-a za embedded sustave. NAPOMENA: Točan termin praske može se promijeniti prema dogovoru.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "21.08.2020",
        "compensation": "Da, po dovršetku prakse."
      },
      {
        "position": "Razvoj bežičnog senzora u Altium Designer-u",
        "position_desc": "Studenti će uz pomoć razvojnog tima tvrtke raditi na razvoju industrijskog bežičnog LoRa senzora. Namjena senzora je mjerenje temperature i vlage iz ambijenta te slanje podataka pomoću LoRa modula integriranog u senzor. Uređaj će se projektirati u Altium Designer-u. Studenti biti najprije biti upoznati sa svrhom i načinu korištenja senzora te svim komponentama koje će biti ugrađene u senzor. Razvojni inženjeri tvrtke će objasniti na koji način je potrebno povezati i postaviti komponente. Također će objasniti na što je potrebno pripaziti pri crtanju sheme tiskanih vodova. Tokom rada na praksi studenti će imati priliku proći kroz postupak razvoja prototipa elektroničkog proizvoda te će se upoznati sa problemima koje je potrebno riješiti (npr. odabir komponenata, ekonomski parametri, mehanički aspekti, sigurnost proizvoda, itd.). Ukoliko studenti iskažu želju mogu i raditi na poslovima izrade prototipa (narudžba/izrada tiskanih pločica, lemljenje i uhodavanje). Praksa je idealna za studente koji se u profesionalnom životu žele baviti razvojem elektroničkih proizvoda/uređaja. NAPOMENA: Točan termin praske može se promijeniti prema dogovoru.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "21.08.2020",
        "compensation": "Da, po završetku prakse."
      }
    ]
  },
  "Energetski institut Hrvoje Požar": {
    "page": "http://www.eihp.hr/",
    "company_address": "Savska cesta 163, 10001 Zagreb, Hrvatska; PP 141",
    "company_desc": "",
    "jobs": [
      {
        "position": "Suradnik/ica na projektu Centra kompetencija za pametne gradove",
        "position_desc": "U okviru uspostave baze podataka i izrade modula Energy Efficiency, specificirat će se svi podatci o energetskoj potrošnji, veličine koje utječu na energetsku potrošnju kao i indikatori koji će se na temelju navedenog izračunavati. Od studenta/ice se očekuje suradnja na utvrđivanju izvora traženih podataka (HEP ODS, gradska plinara, gradska toplana, gradski uredi, Državni hidrometeorološki zavod, Državni zavod za statistiku, itd) i ocjeni dostupnosti podatka.",
        "n_available": 1,
        "n_prioritized": 2,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "30kn satnica + 1topli obrok dnevno +1kava dnevno u restoranu instituta"
      }
    ]
  },
  "Erste Group Card Processor": {
    "page": "https://www.egcp.com/en/home",
    "company_address": "Radnička cesta 45, 10 000 Zagreb",
    "company_desc": "Erste Group Card Processor d.o.o. is an IT company present locally and internationally for the last 25 years, providing modern card processing services and continuously working on innovative payments. We have developed the first digitalized cards, fraud prevention systems using AI and the first key management system based on blockchain. EGCP is a member of Erste Group and has international presence in total 25 banks and financial institutions. We use Java, Angular, Openshift, Kubernetes… interest for new technologies, willingness to learn and a proactive approach when facing challenges are of utmost importance to us! Within the student practice program we offer opportunities to learn from the experienced team of mentors, practical experience on interesting tasks that provide valuable professional experience and insight into broader context of real working environment. For more information you can visit our website or contact us via HR@egcp.com .",
    "jobs": [
      {
        "position": "Praktikant (m/ž) u Sektoru operacija – Direkciji Back Office sustava",
        "position_desc": "Rad na automatizaciji testiranja - realizacija testnih scenarija za automatsko testiranje različitih sustavskih koponenti. Grupiranje testnih scenarija, implementacija u sustav za testiranje, orkestracija putem robot frameworka",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da"
      },
      {
        "position": "Praktikant (m/ž) u Sektoru operacija – Direkciji Front Office sustava",
        "position_desc": "Pomoć u razvojnim poslovima oko kreiranja parsera raznih aplikacijskih logova po određenim zadanim kriterijima. Pomoć u razvoju skripti za monitoring autorizacijskog sustava Pomoć u razvoju automatizacije popratnih procesa autorizacijskog sustava",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da"
      },
      {
        "position": "Praktikant (m/ž) u Sektoru operacija – Direkciji Front Office sustava",
        "position_desc": "Pomoć u razvojnim poslovima oko izmjena postojećih mikroservisa ili kreiranja novih na OpenShift kontejnerskoj platformi",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da"
      },
      {
        "position": "Praktikant (m/ž) u Sektoru operacija – Direkciji Front Office sustava",
        "position_desc": "Pomoć pri automatizaciji generiranja određenih grafičkih izvještaja na osnovu predefiniranih upita iz baze podataka. Pomoć u kreiranju novih i optimizaciji postojećih upita nad bazama podataka za razne namjene.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da"
      },
      {
        "position": "Praktikant (m/ž) u Sektoru operacija – Direkciji Front Office sustava",
        "position_desc": "Pomoć u razvojnim poslovima oko izmjena na postojećim grafičkim web sučeljima ili kreiranja novih Pomoć u razvojnim poslovima oko izmjena postojećih sistemskih skripti za nadzor ili upravljanje pojedinim sustavima",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da"
      }
    ]
  },
  "GDi": {
    "page": "www.gdi.net",
    "company_address": "Baštijanova 52a, 10000, Zagreb",
    "company_desc": "GDi ( www.gdi.net ) je inovativna srednjoeuropska tvrtka iz područja primijenjenih tehnoloških rješenja. Iza nas je više od 30 godina uspješnog rasta, uredi u 15 zemalja i preko 1.000 klijenata diljem četiri kontinenta. Fokusirani smo se na razvoj tehnoloških rješenja za upravljanje resursima, imovinom i poslovanjem u mnogobrojnim područjima ljudskog djelovanja, kao što su telekomunikacije, energetika, prirodni resursi, okoliš, zaštita i sigurnost te komercijalne industrije. Naš kontinuirani uspjeh rezultat je zajedničkog truda GDi tima s preko 250 stručnjaka raznih tehničkih, prirodnih i društvenih usmjerenja, motiviranih profesionalnom znatiželjom i entuzijazmom te željom za stvaranjem naprednih i opće korisnih tehnoloških rješenja. Kontinuirano ulažemo resurse u edukaciju mladih budućih stručnjaka sa željom da im omogućimo stjecanje praktičnih znanja i iskustava te im pomognemo u prepoznavanju i razvijanju profesionalnih interesa i potencijala. Mnogi stručnjaci iz našeg tima započeli su svoju karijeru kao studenti, praktikanti ili pripravnici, a danas su u različitim stadijima svog profesionalnog puta – od juniorskih pozicija do seniora i vrhunskih eksperata.",
    "jobs": [
      {
        "position": "Junior AI developer",
        "position_desc": "Želiš li učiti od iskusnih developera, biti dio vrhunskog tima i raditi na rješenjima koja se aktivno koriste diljem Europe? U GDi-u se bavimo razvojem primijenjenih tehnoloških rješenja za industriju , a uz to trenutno intenzivno radimo na razvoju i održavanju platformi koje pomažu kriznom upravljanju tijekom pandemije koronavirusa. Naši dashboardovi pomažu u detaljnom praćenju broja i lokacije slučajeva COVID-19 te ih svakodnevno upotrebljavaju stotine tisuća korisnika. Ponosni smo i na lokalizaciju i inventarizaciju objekata oštećenih u potresu u Zagrebu koju stručnjaci obavljaju uz podršku GDi platforme. Naši jednostavni i pregledni prikazi pomažu informirati javnost, a njihova sofisticirana tehnološka pozadina ih čini neizostavnim alatom stručnjacima koji donose odluke i mjere u kriznim situacijama. Neke od tehnologija koje koristimo su Microsoft .NET i Azure, Esri ArcGIS i JavaScript (Angular). Tijekom prakse u GDi-u bit ćeš dio našeg razvojnog tima te ćeš imati priliku dizajnirati i implementirati aplikaciju koja će korištenjem tehnologija umjetne inteligencije (computer vision, pattern recognition, digital image analysis) doprinijeti efikasnijem detektiranju objekata na površini zemlje na osnovu ulaznih ortofoto snimaka. Rješenje na čijem ćeš razvoju raditi pomoći će razlikovanju elemenata na snimci kao što su cesta, šuma, stambeni objekti i staze te time ubrzati donošenje odluka temeljem detektiranih podataka. Ne brini se ako nešto od ovih pojmova ne razumiješ. Na praksi ćeš imati prilku upoznati se s njima, a iskustvo u navedenom je vrlo relevantno i vjerujemo da će ti dobro doći u budućoj karijeri. Koje su prednosti prakse u GDi-u za tebe? Opuštena timska atmosfera usmjerena na suradnju i razmjenu znanja Podrška iskusnog mentora koji je dostupan za sva tvoja pitanja Fleksibilno radno vrijeme održavanja prakse, uz opciju rada od kuće Mogućnost nastavka suradnje i nakon završetka prakse Kompenzacija jer cijenimo tvoj trud Ako ti praksa u GDi-u zvuči zanimljivo, prijavi se, a ako imaš dodatna pitanja, slobodno nas kontaktiraj za više informacija! :)",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "DA"
      },
      {
        "position": "Junior C# developer",
        "position_desc": "Želiš li učiti od iskusnih developera, biti dio vrhunskog tima i raditi na rješenjima koja se aktivno koriste diljem Europe? U GDi-u se bavimo razvojem primijenjenih tehnoloških rješenja za industriju , a uz to trenutno intenzivno radimo na razvoju i održavanju platformi koje pomažu kriznom upravljanju tijekom pandemije koronavirusa. Naši dashboardovi pomažu u detaljnom praćenju broja i lokacije slučajeva COVID-19 te ih svakodnevno upotrebljavaju stotine tisuća korisnika. Ponosni smo i na lokalizaciju i inventarizaciju objekata oštećenih u potresu u Zagrebu koju stručnjaci obavljaju uz podršku GDi platforme. Naši jednostavni i pregledni prikazi pomažu informirati javnost, a njihova sofisticirana tehnološka pozadina ih čini neizostavnim alatom stručnjacima koji donose odluke i mjere u kriznim situacijama. Neke od tehnologija koje koristimo su Microsoft .NET i Azure, Esri ArcGIS i JavaScript (Angular). Tijekom prakse u GDi-u bit ćeš dio našeg razvojnog tima te ćeš imati priliku implementirati dobro poznati algoritam za optimizaciju obilaska lokacija za isporuku tereta pomoću flote teretnih vozila (Vehicle routing problem algorithm). Cilj će biti minimizacija troška puta i radnog vremena vozača te rasterećenje polaznog skladišta, a prilikom rada trebat ćeš voditi računa o poštivanju parametara kao što su kapacitet vozila, specijalne karakteristike vozila i vještine vozača. Ne brini se ako do sada nisi radio/la na ovakvim zadacima. Na praksi ćeš imati prilku upoznati se s njima, a iskustvo koje možeš steći je vrlo relevantno i vjerujemo da će ti dobro doći u budućoj karijeri. Koje su prednosti prakse u GDi-u za tebe? Opuštena timska atmosfera usmjerena na suradnju i razmjenu znanja Podrška iskusnog mentora koji je dostupan za sva tvoja pitanja Fleksibilno radno vrijeme održavanja prakse, uz opciju rada od kuće Mogućnost nastavka suradnje i nakon završetka prakse Kompenzacija jer cijenimo tvoj trud Ako ti praksa u GDi-u zvuči zanimljivo, prijavi se, a ako imaš dodatna pitanja, slobodno nas kontaktiraj za više informacija! :)",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "DA"
      }
    ]
  },
  "GLOBALLOGIC": {
    "page": "https://www.globallogic.com/hr/",
    "company_address": "Ulica grada Vukovara 284, 10000 Zagreb",
    "company_desc": "GlobalLogic je kompanija za inženjering digitalnih proizvoda. Integriramo iskustveni dizajn i složeni inženjering kako bismo pomogli našim klijentima zamisliti mogućnosti i ubrzati svoj prijelaz prema digitalnom poslovanju. Korištenjem dizajnerskih praksi usredotočenih na ljude, inženjerskih vještina i agilne isporuke - pomažemo korisnicima promišljati svoje poslovanje i interakcije s proizvodima, razviti inovativne proizvode i usluge te ubrzati lansiranje na tržište.",
    "jobs": [
      {
        "position": "Junior Software Engineer",
        "position_desc": "Grafana framework i GL SmartHome Potrebno je razviti koncept prikaza stanja (Alarmi, temperature, vlažnost itd.) postojećeg rješenja za interni projekt SmartHome koristeći open source Grafana framework.",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, prema odrađenim satima"
      },
      {
        "position": "Junior Software Engineer",
        "position_desc": "Razvoj Radio & Mp3 Player App za Android Automotive platformu Potrebno je razviti aplikaciju koja se spaja na internet i dohvaća lokalne i svjetske radio stanice i reproducira ih na Andorid Automotive platformi. Uz to, aplikacija mora biti u mogućnosti i reproducirati MP3 datoteke sa lokalnog, ali i sa nekog Cloud storage servisa.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, prema odrađenim satima"
      }
    ]
  },
  "HELB": {
    "page": "www.helb.hr",
    "company_address": "Industrijska ulica 1, 10370 Dugo Selo",
    "company_desc": "HELB projektira, gradi i upravlja energetskom infrastrukturom. Nudimo kompletnu uslugu u svim fazama razvoja Vašeg objekta: od izgradnje postrojenja, upravljanja i održavanja, ispitivanja i puštanja u pogon, inženjeringa do energetske učinkovitosti.",
    "jobs": [
      {
        "position": "Ispitivač elektronenergetskih postojenja",
        "position_desc": "Upoznavanje s poslovima ispitivanja, puštanja u rad, osiguranja kvalitete proizvoda i usluga u elektorenergetskim postrojenjima te popratnom dokumentacijom.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse prema dogovoru."
      }
    ]
  },
  "HEP-Operator distribucijskog sustava": {
    "page": "www.hep.hr ",
    "company_address": "Elektra Slavonski Brod, Petra Krešimira IV br. 11, Slavonski Brod",
    "company_desc": "HEP-Operator distribucijskog sustava d.o.o . odgovoran je za kvalitetu isporučene električne energije svim krajnjim kupcima i jamac je sigurne opskrbe električnom energijom. U nadležnosti HEP ODS-a su vođenje, održavanje, izgradnja i razvoj distribucijske mreže te osiguravanje dugoročne sposobnosti mreže da zadovolji buduće zahtjeve za pristupom mreži.",
    "jobs": [
      {
        "position": "Elektra Slavonski Brod - Služba za realizaciju investicijskih projekata i pristup mreži",
        "position_desc": "Rad na zahtjevima za priključenje koji obuhvaćaju izradu tehničkih rješenja, troškovnika i proračunsku analizu mogućnosti priključenja.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Slavonski Brod - Služba za realizaciju investicijskih projekata i pristup mreži",
        "position_desc": "Rad u GIS-u na unosu podataka o distribucijskoj mreži.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Varaždin - Služba za realizaciju investicijskih projekata i pristup mreži",
        "position_desc": "Razvoj elektroenergetskog sustava. Pristup mreži - novi potrošači",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.08.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Vinkovci - Odjel za realizaciju investicijskih projekata",
        "position_desc": "Pristup mreži. Rad na zahtjevima za priključenje koji obuhvaćaju izradu tehničkih rješenja, proračuna i troškovnika priključka",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Vinkovci - Služba za realizaciju investicijskih projekata i pristup mreži",
        "position_desc": "Relejna zaštita. Podešavanje i ispitivanje numeričkih uređaja relejne zaštite, analiza pogonskih događaja.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Zabok - Služba za vođenje pogona",
        "position_desc": "Rad u Neplanu. Crtanje i ažuriranje SN mreže te izvođenje proračuna za potrebe vođenja pogona te podešenja relejne zaštite.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektra Zabok - Služba za vođenje pogona",
        "position_desc": "Rad u aplikaciji DISPO (Distribucijska pouzdanost). Ažuriranje podataka u aplikaciji DISPO (distribucijska pouzdanost) te rad s aplikacijom, unošenje zastoja, analize, izvješća i sl.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektrojug Dubrovnik - Odjel za pristup mreži",
        "position_desc": "Priključenje kupaca na elektroenergetski sustava. Mogućnost obavljanja prakse na daljinu.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Elektrojug Dubrovnik - Služba za realizaciju investicijskih projekata i pristup mreži",
        "position_desc": "Upoznavanje i rad sa geografsko informatičkim sustavom (GIS ODS-a). Mogućnost obavljanja prakse na daljinu.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "NE"
      },
      {
        "position": "Elektrojug Dubrovnik - Služba za vođenje pogona",
        "position_desc": "Vođenje pogona elektroenergetskog sustava. Mogućnost obavljanja prakse na daljinu.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne"
      }
    ]
  },
  "Hrvatska akademska i istraživačka mreža - CARNET": {
    "page": "https://www.carnet.hr/",
    "company_address": "Ulica Josipa Marohnića 5, 10000 Zagreb ili Jurišićeva ulica 3, 10000 Zagreb",
    "company_desc": "Hrvatska akademska i istraživačka mreža - CARNet je ustanova osnovana s ciljem osiguravanja najnaprednije informacijsko-komunikacijske infrastrukture sustavu obrazovanja i znanosti u Republici Hrvatskoj. Riječ CARNet skraćenica je engleskog naziva ustanove – Croatian Academic and Research Network. CARNet danas ima skoro 150 zaposlenika te urede u šest gradova u Republici Hrvatskoj. CARNetove aktivnosti mogu se podijeliti u tri osnovna područja: pružanje internetskih usluga, poticanje razvoja informacijskog društva i obrazovanje za novo doba.",
    "jobs": [
      {
        "position": "Analiza alata za sigurnosno testiranje softverskih kontejnera – četiri tjedna",
        "position_desc": "Sudjelovanje u analizi i odabiru alata za sigurnosno testiranje softverskih kontejnera prema specifičnim zahtjevima. Priprema plana testiranja te izvođenje analize ranjivosti sistemskih paketa i konfiguracijskih nedostataka.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira.. Postoji mogućnost nastavka angažmana kroz studentski ugovor nakon obavljene prakse za studente koji pokažu vrsne rezultate kroz praksu."
      },
      {
        "position": "Analiza i primjena metodologija sigurnog programiranja",
        "position_desc": "Upoznavanje sa trenutnom metodologijom razvoja softvera u NCERT-u, proučavanje postojećih internih programskih rješenja koji koriste sigurnosne aspekte programiranja, proučavanje OWASP sigurnosnog standarda ( https://owasp.org/www-project-application-security-verification-standard/ ) te na osnovu gornjih proučavanja osmišljavanje i izrada NCERT secure fameworka koji će ujediniti sigurnosne aspekte u programiranje koje se koriste u gore spomenutim internim rješenjima.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Postoji mogućnost nastavka angažmana kroz studentski ugovor nakon obavljene prakse za studente koji pokažu vrsne rezultate kroz praksu."
      },
      {
        "position": "Nadzor i upravljanje CARNET mrežom - Day2Day business of national IT network",
        "position_desc": "CARNET mreža privatna je mreža akademske, znanstvene i istraživačke zajednice Republike Hrvatske, kao i institucija u sklopu osnovnoga i srednjoškolskoga obrazovnog sustava. Dio mrežne infrastrukture posjeduje CARNET ustanova, a vodove većinom unajmljuje od niza davatelja telekomunikacijskih usluga. CARNET mreža povezuje više od 4000 lokacija ustanova iz sustava pet ministarstava u RH, a putem iste je omogućen korisnicima pristup do različitih CARNET-ovih usluga u oblaku. Kroz studentsku praksu polaznik će upoznati osnove upravljanja mrežnim prometom u sklopu CARNET Mrežnog Operativnog Centra – NOC. Polaznik će biti angažiran na poslovima vezanim uz: Nadzor i održavanje CARNET mreže Analizu mrežnog prometa Analizu i rješavanje mrežnih incidenata Korištenje nadzorno upravljačkih alata Izvještavanje o trendovima korištenja mrežnih resursa Provjeru konfiguracijskih parametara u pristupnom dijelu mreže Implementacija aktivne mrežne opreme i mrežnih servisa u pristupnom dijelu CARNET mreže",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Mogućnost besplatnog pohađanja CCNA akademije i nastavka angažmana kroz studentski ugovor nakon obavljene prakse."
      },
      {
        "position": "Očvrščivanje (Hardening) operativnog sustava Linux Debian – četiri tjedna",
        "position_desc": "Posao obuhvaća izradu popisne liste (check list) za očvrščivanje (hardening) operativnog sustava prema najboljim praksama struke te izrada Ansible „playbook-a“ prema prethodno izrađenoj listi s ciljem automatiziranog upravljanja poslužiteljem. Sigurnosno očvršćivanje po kojem se ravnamo je CIS baseline.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Postoji mogućnost nastavka angažmana kroz studentski ugovor nakon obavljene prakse za studente koji pokažu vrsne rezultate kroz praksu."
      },
      {
        "position": "Razvoj alata za nadzor i upravljanje CARNET mrežom",
        "position_desc": "CARNET mreža privatna je mreža akademske, znanstvene i istraživačke zajednice Republike Hrvatske, kao i institucija u sklopu osnovnoga i srednjoškolskoga obrazovnog sustava. Dio mrežne infrastrukture posjeduje CARNET ustanova, a vodove većinom unajmljuje od niza davatelja telekomunikacijskih usluga. CARNET mreža povezuje više od 4000 lokacija ustanova iz sustava pet ministarstava u RH, a putem iste je omogućen korisnicima pristup do različitih CARNET-ovih usluga u oblaku. Kroz studentsku praksu polaznik će sudjelovati u razvoju/nadogradnji alata baziranih na tehnologijama otvorenog koda, a za potrebe nadzorno upravljačkog sustava CARNET mreže. Polaznik će biti angažiran na poslovima vezanim uz: Osmišljavanje, razvoj i nadogradnju funkcionalnosti nadzorno upravljačkog sustava Povezivanje (integriranost) alata u jedinstveni sustav Testiranje funkcionalnosti nadzorno upravljačkog sustava Automatizaciju manualnih zadataka Dokumentaciju novih funkcionalnosti",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Mogućnost besplatnog pohađanja CCNA akademije i nastavka angažmana kroz studentski ugovor nakon obavljene prakse."
      },
      {
        "position": "Razvoj WEB Defacement alata i automatizacija obrade podataka",
        "position_desc": "Polaznik će biti angažiran u službi za obradu sigurnosnih incidenata na poslovima vezanim uz: Osmišljavanje, razvoj i nadogradnju funkcionalnosti WEB Defacement alata Izrada novog ili prilagodba postojećeg modula/alata koji bi korištenjem tražilica dohvaćao sve web stranice na hrvatskom jeziku (bez .hr domena). Povezivanje dobivenih rezultata kao izvor nadopune za postojeći web defacement alat prilikom pretraživanja defacement web stranica. Automatizacija obrade podataka: preuzimanje i pohranjivanje popisa URL-ova početnih stranica web sjedišta dodatno filtriranje povućenih domena po IP-u i dopuna potrebnih podataka dodavanje dobivenih podataka o domenama u web defacement alat Dokumentacija novih funkcionalnosti",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Postoji mogućnost nastavka angažmana kroz studentski ugovor nakon obavljene prakse za studente koji pokažu vrsne rezultate kroz praksu."
      },
      {
        "position": "Testiranje alata za nadzor školske mreže",
        "position_desc": "CARNET mreža privatna je mreža akademske, znanstvene i istraživačke zajednice Republike Hrvatske, kao i institucija u sklopu osnovnoga i srednjoškolskoga obrazovnog sustava. Dio mrežne infrastrukture posjeduje CARNET ustanova, a vodove većinom unajmljuje od niza davatelja telekomunikacijskih usluga. CARNET mreža povezuje više od 4000 lokacija ustanova iz sustava pet ministarstava u RH, a putem iste je omogućen korisnicima pristup do različitih CARNET-ovih usluga u oblaku. Kroz studentsku praksu polaznik će sudjelovati u razradi testnih scenarija za nadzorni sustav lokalnih mreža škola, te testirati aplikacije za nadzor školske mreže. Polaznik će biti angažiran na poslovima vezanim uz: Detaljan opis testnih scenarija za nadzorni sustav školskog LAN-a Izvođenje funkcionalnih testova za nadzorni sustav školskog LAN-a Analizu mrežnog prometa školskog LAN-a Analizu incidenata pomoću aplikacije za nadzor mreže u školama Izvještavanje o načinu korištenja mrežnih resursa u školama",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Mogućnost besplatnog pohađanja CCNA akademije i nastavka angažmana kroz studentski ugovor nakon obavljene prakse."
      },
      {
        "position": "Testiranje SDN komponente SDDC (Software-defined data center)",
        "position_desc": "CARNET mreža privatna je mreža akademske, znanstvene i istraživačke zajednice Republike Hrvatske, kao i institucija u sklopu osnovnoga i srednjoškolskoga obrazovnog sustava. Dio mrežne infrastrukture posjeduje CARNET ustanova, a vodove većinom unajmljuje od niza davatelja telekomunikacijskih usluga. CARNET mreža povezuje više od 4000 lokacija ustanova iz sustava pet ministarstava u RH, a putem iste je omogućen korisnicima pristup do različitih CARNET-ovih usluga u oblaku. Kroz studentsku praksu polaznik će sudjelovati u testiranju SDN komponente CARNET-SDDC sustava (OpenStack). Polaznik će biti angažiran na poslovima vezanim uz: Razvoj novih funkcionalnosti SDN komponente SDDC sustava Testiranje novih funkcionalnosti SDN komponente SDDC sustava Uspostava nadzora za SDN komponentu SDDC sustava Povezivanje (integriranost) alata u jedinstveni sustav Dokumentaciju novih funkcionalnosti",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Studentska praksa se ne honorira. Mogućnost besplatnog pohađanja CCNA akademije i nastavka angažmana kroz studentski ugovor nakon obavljene prakse."
      }
    ]
  },
  "Hrvatska radiotelevizija (HRT)": {
    "page": "www.hrt.hr",
    "company_address": "Prisavlje 3, Zagreb",
    "company_desc": "Hrvatska radiotelevizija (u daljnjem tekstu: HRT) pravna je osoba koja ima status javne ustanove, a čija su djelatnost, funkcija i sadržaj javnih usluga, financiranje, upravljanje, nadzor i način rada uređeni Zakonom o Hrvatskoj radioteleviziji i propisima donesenim na temelju njega. Djelatnost HRT-a je proizvodnja radijskog, audiovizualnog i multimedijskog programa, glazbena proizvodnja, pružanje audio i audiovizualnih medijskih usluga, multimedijskih usluga i usluga elektroničkih publikacija kao javnih usluga.",
    "jobs": [
      {
        "position": "Administrator DNR sustava (Digital Newsroom..)",
        "position_desc": "kontinuirano praćenje ispravnosti svih sustava uključenih u proizvodnju programa IMS-a, konfiguriranje segmenata sustava, upoznavanje funkcionalnosti svih elemenata i korisničkih aplikacija",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "10.07.2020",
        "end": "31.08.2020",
        "compensation": "nije moguce honoriranje prakse nije moguce odvijanje prakse od kuce pocetak ovisi o preporukama nacionalnog stozera i situaciji u RH, odluka do kraja lipnja dva termina prakse 20.07. i 10.08."
      },
      {
        "position": "Inženjer u SO Odrzavanje proizvodne opreme",
        "position_desc": "Montaža, podešavanje i održavanje HD video uređaja i tonskih uređaja koji se koriste u proizvodnji radijskog i televizijskog programa.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "23.06.2020",
        "end": "28.08.2020",
        "compensation": "nije moguce honoriranje prakse nije moguce odvijanje prakse od kuce pocetak ovisi o preporukama nacionalnog stozera i situaciji u RH, odluka do kraja lipnja"
      },
      {
        "position": "Web developer (PHP, XML, XSL, Oracle, MySQL)",
        "position_desc": "Razvoj i održavanje Web aplikacija s tehnologijama navedenim u nazivu pozicije. Koristi se vlastiti framework u kojem se pomoću XSLT-a izgrađuje prezentacijski sloj dok je središnji PHP dio zadužen za poslovnu logiku. Tijekom prakse bi se radilo na poboljšanju administratorskih alata (održavanje matičnih podataka) vlastitog ERP sustava za planiranje programa i proizvodnje.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "22.07.2020",
        "compensation": "nije moguce honoriranje prakse nije moguce odvijanje prakse od kuce pocetak ovisi o preporukama nacionalnog stozera i situaciji u RH, odluka do kraja lipnja"
      }
    ]
  },
  "Hrvatski operator prijenosnog sustava": {
    "page": "http://www.hops.hr",
    "company_address": "Kupska 4, 10000 Zagreb",
    "company_desc": "HOPS d.o.o. (Hrvatski operator prijenosnog sustava) je jedini operator elektroenergetskog prijenosnog sustava u RH i vlasnik cjelokupne hrvatske prijenosne mreže (naponskih razina 400kV, 220kV i 110kV), te posjeduje dozvolu za obavljanje energetske djelatnosti prijenosa električne energije kao regulirane javne usluge. Misija HOPS-a je vođenje elektroenergetskog sustava Republike Hrvatske, prijenos električne energije te održavanje, razvoj i izgradnja prijenosne mreže poradi pouzdane opskrbe korisnika uz minimalne troškove i brigu o očuvanju okoliša.",
    "jobs": [
      {
        "position": "INŽENJER U ODJELU ZA MJERENJA",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u PRIJENOSNOM PODRUČJU ZAGREB, SLUŽBI ZA SEKUNDARNE SUSTAVE, ODJELU ZA MJERENJA Tijekom prakse studenti će biti upoznati sa sustavom za prikupljanje obračunskih mjerenja i sustavom za praćenje kvalitete električne energije.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira"
      },
      {
        "position": "INŽENJER U SLUŽBI ZA INVESTICIJE I UPRAVLJANJE IMOVINOM",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA RAZVOJ, PRIKLJUČENJA, IZGRADNJU I UPRAVLJANJE IMOVINOM, SLUŽBI ZA INVESTICIJE I UPRAVLJANJE IMOVINOM U Službi za investicije i upravljanje imovinom obavljaju se slijedeći poslovi: vođenje investicija i investicijskih projekata Društva praćenje dinamike realizacije planova investicija Društva sudjelovanje u pripremi dokumentacije o nabavi i postupcima nabave izrade podloga, kriterija i elaborata u svrhu pripreme investicijskih projekata sudjelovanje u izradi razvojnih planova standardizacije procesa upravljanja projektima usklađivanja projekata sa strategijom poslovanja Društva izvješćivanja o provedbi i rizicima projekata pripreme godišnjih izvješća i publikacija koordinacije realizacije investicijskih programa upravljanje imovinom u skladu s poslovnom politikom Društva analize postojećeg stanja imovine analize stanja i pogona mreže utvrđivanja smjernica i kriterija za ulaganje po kategorijama imovine izrade metodologije i kriterija za planiranje razvoja mreže uspostave, razvoja, implementacije, vođenja i održavanja geografsko-informacijskog i prostorno-integracijskog sustava Društva praćenja, analize i upravljanja štetama na elektroenergetskim objektima izrade metodologije i kriterija za planiranje razvoja mreže izrade CBA analiza (analiza koristi i troškova) investicija planiranja i analize strateških investicija izrade tehno-ekonomskih analiza operativno planiranje godišnjeg portfelja projekata investicija i održavanja analize i kontrole aktivnosti planiranja definiranja investicijskih programa.",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira."
      },
      {
        "position": "INŽENJER U SLUŽBI ZA PODRŠKU VOĐENJU EES-a",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA POSLOVNU INTEGRACIJU, SLUŽBI ZA PODRŠKU VOĐENJU EES-A Služba za podršku vođenju EES-a osigurava kontinuitet i pouzdanost rada sustava za vođenje EES-a u stvarnom vremenu, proširenom stvarnom vremenu te sustava za analizu rada EES-a i kratkoročno planiranje. Služba je nadležna za standardizaciju, razvoj i izgradnju procesnog sustava u centrima upravljanja i EE postrojenjima uključenima u sustav daljinskog vođenja, upravljanje zajedničkim modelom podataka iz područja vođenja sustava, te elektronsku razmjenu podataka i modela podataka EES-a s drugim operatorima prijenosnog sustava, udruženjima operatora prijenosnog sustava, operatorima distribucijskog sustava, koordinacijskim centrima i ostalim nadležnim tijelima, putem zajedničkih podatkovnih platformi.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira"
      },
      {
        "position": "INŽENJER U SLUŽBI ZA RAZVOJ, ODJELU ZA PRIPREMU PODATAKA I MODELA",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA RAZVOJ, PRIKLJUČENJA, IZGRADNJU I UPRAVLJANJE IMOVINOM, SLUŽBI ZA RAZVOJ, ODJELU ZA PRIPREMU PODATAKA I MODELA Tijekom prakse student će se upoznati s nekim od sljedećih aktivnosti koje se obavljaju u Službi: koordiniranje izrade desetogodišnjih planova razvoja prijenosne mreže (10 G) priprema podataka, izrade i ažuriranja modela hrvatske prijenosne mreže aktivnosti vezane uz pripremu i dostavu potrebnih podloga za izradu regionalnih i paneuropskih planova razvoja prijenosne mreže (TYNDP) izrada izvještaja vezanih za razvojne planove, energetsku učinkovitost, održivi razvoj prema nadležnih tijelima u RH i EU izrada studijskih zadataka za EOTRP-ove i koordiniranje izrade EOTRP-ova kontinuirano praćenje aktualnih trendova iz područja djelatnosti operatora prijenosnih sustava te s tim u svezi s pripremanje razvojnih projekata i koordiniranje njihove provedbe praćenje tehnološkog razvoja koji utječe na korištenje postojeće opreme, modernizaciju i zamjenu te opreme praćenje zakonskih i podzakonskih propisa iz područja zaštite okoliša i energetske učinkovitosti te koordiniranje aktivnosti na primjeni i usklađivanju sa zahtjevima iz normi ISO 14001, ISO 50001 i slično prikupljanje podloga i koordiniranje izrade planova dostatnosti hrvatskog prijenosnog sustava prema međunarodnim tijelima (ENTSO-E i Med-TSO i slično) koordiniranje izrade procjena troškova i koristi (CBA) i poslovnih planova za razvojne projekte aktivnosti vezane uz pripremu i dostavu modela i podataka za potrebe izrade tržišnih analiza koordiniranje aktivnosti vezanih uz usklađenje Mrežnih pravila prijenosnog sustava s EU Uredbama (Network Codes).",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira"
      },
      {
        "position": "INŽENJER U SLUŽBI ZA UPRAVLJANJE TRŽIŠNIM AKTIVNOSTIMA",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA TRŽIŠTE, SLUŽBI ZA UPRAVLJANJE TRŽIŠNIM AKTIVNOSTIMA U Službi za upravljanje tržišnim aktivnostima se obavljaju poslovi praćenja i implementacije zakonske i podzakonske regulative RH i EU vezane uz upravljanje zagušenjima, kupoprodaja električne energije za pokriće gubitaka i uravnoteženje sustava te razvoj i implementacija novih mehanizama s ciljem povezivanja i razvoja europskih tržišta električne energije.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira"
      },
      {
        "position": "INŽENJER U SLUŽBI ZA URAVNOTEŽENJE SUSTAVA I OBRAČUN",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA TRŽIŠTE, SLUŽBI ZA URAVNOTEŽENJE SUSTAVA I OBRAČUN U Službi za uravnoteženje sustava i obračun se obavljaju poslovi praćenja i implementacije zakonske i podzakonske regulative RH i EU vezane uz razvoj mehanizama uravnoteženja sustava i nabave pomoćnih usluga, aktivnosti vezane uz obračun korištenja prijenosne mreže, usluga iz djelokruga rada Službe te obračun ostalih energetskih veličina.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira."
      },
      {
        "position": "INŽENJER U SLUŽBI ZA USLUGE SUSTAVA I UPRAVLJANJE PODACIMA",
        "position_desc": "Studenti se tijekom obavljanja ljetne prakse imaju priliku upoznati s poslovima Inženjera u SEKTORU ZA VOĐENJE EES-a, SLUŽBI ZA USLUGE SUSTAVA I UPRAVLJANJE PODACIMA U Službi za usluge sustava i upravljanje podacima obavljaju se poslovi: dimenzioniranje regulacijskih rezervi praćenje rada primarne, sekundarne i tercijarne regulacije te usuglašavanje ostvarenih vrijednosti praćenje provedbe mjera za otklanjanje internih i prekograničnih zagušenja praćenje rada regulacije napona i jalove snage praćenje rada prekograničnih procesa netiranja odstupanja dnevni i mjesečni obračun pomoćnih usluga određivanje K faktora HR EES-a izrada plana podfrekventnog rasterećenja izrada plana hitnog rasterećenja sudjelovanje u provjerama i ispitivanjima postrojenja korisnika mreže određivanje tehničkih zahtjeva na pružatelje pomoćnih usluga provjera tehničkih sposobnosti pružatelja pomoćnih usluga priprema i provođenje ispitivanja pomoćnih usluga crnog starta i otočnog rada vođenje statistike pogonskih događaja izrada polugodišnjih i mjesečnih izvješća o dostatnosti HR EES izrada godišnjeg izvješća o sigurnosti opskrbe priprema podataka za godišnji plan HOPS-a priprema podataka za HERA godišnje izvješće priprema podataka za bilancu EES-a priprema podataka za izvještavanje unutar bloka SHB, CORE, RG CE i ENTSO/E priprema podataka za objavu na HOPS-ovom webu i Transparency platformi sustavno upravljanje podacima i bazama podataka (DWH) izrada ostalih izvješća za potrebe SzV/HOPS-a sudjelovanje u ENTSO-E i Core radnim grupama sudjelovanje u recenzijama razvojnih studija, pravilnika, mrežnih pravila suradnja s regulatornim tijelima suradnja sa subjektom odgovornim za organiziranje tržišta električne energije sudjelovanje u razvoju i implementaciji mehanizama za uravnoteženje u smislu njihova dimenzioniranja i strategije provedbe sudjelovanje u razvoju internih IT sustava uključujući izradu specifikacija za razvoj novih procesa, programskih alata i aplikacija.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.09.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se ne honorira"
      }
    ]
  },
  "HUAWEI TECHNOLOGIES": {
    "page": "www.huawei.com",
    "company_address": "Zagreb, Ivana Lučića 2a",
    "company_desc": "Huawei is a leading global provider of information and communications technology (ICT) infrastructure and smart devices. With integrated solutions across four key domains – telecom networks, IT, smart devices, and cloud services – we are committed to bringing digital to every person, home and organization for a fully connected, intelligent world. Huawei's end-to-end portfolio of products, solutions and services are both competitive and secure. Through open collaboration with ecosystem partners, we create lasting value for our customers, working to empower people, enrich home life, and inspire innovation in organizations of all shapes and sizes. At Huawei, innovation focuses on customer needs. We invest heavily in basic research, concentrating on technological breakthroughs that drive the world forward. We have more than 180,000 employees, and we operate in more than 170 countries and regions. Founded in 1987, Huawei is a private company fully owned by its employees.",
    "jobs": [
      {
        "position": "Fixed Network Solution Manager",
        "position_desc": "Market insight, planning and management； Manage and support opportunities and sales projects, including leads management. Fixed network Solution promotion and support. Support Bidding activities in fixed network solution, including FTTX, Router and transmission. Capable to independently complete the solution design, including BOQ, SOC, and technical proposal. Capable to communicate with customer and understand customers' real requirements and accurately convey solutions value to Customer.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Honoriranje prakse se vrši prema odrađenim satima"
      },
      {
        "position": "Wireless Engineer",
        "position_desc": "You will be responsible for Product/Solutions and the After-sales Technical Support in the field of wireless networking. You will support our customers in all technical aspects and improve the relationship to our main Service Provider accounts. You will be responsible for all the post-sale support of wireless products in Croatia market. Support wireless roll out project from technical part, including Network Design, Software Commissioning, System integration, Test, cutover and acceptance etc. for equipment of GSM/UMTS/LTE/5G. Provide technical support for wireless network equipment to customer, including dealing with technical problem and fault, rectification，maintenance operation daily and system upgrading Support controller and site commissioning, integration and acceptance (GSM/UMTS/LTE/5G). Operation and maintenance of GSM/ UMTS/ LTE/5G customer networks. Wireless products software upgrade and KPI monitoring. Handling critical incident happens in customer live network. Handling live network issues, using ticket system according to Service Level Agreements when needed. Provide proactive service for the customer, e.g. network health check, evaluation and etc. Supporting technical pre-sales PoC from engineering perspective",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Honoriranje prakse se vrši prema odrađenim satima"
      }
    ]
  },
  "Human Resources Cloud": {
    "page": "https://www.hrcloud.com",
    "company_address": "Poljička cesta 43, 21000 Split Strojarska cesta 20, Zagreb",
    "company_desc": "HR Cloud is California based SaaS (Software-As-a-Service) company with over 1,300+ customers and over 150 employees. We have been recognised by Inc. 500|5000 and Deloitte Technology Fast 500 five years in a row. Our offices in Croatia are located in Split and Zagreb. What we do? We build SaaS products for better HR! HR Cloud is the modern HR software and engagement platform intended to foster team work, maximize productivity and employee appraisal process.",
    "jobs": [
      {
        "position": "Junior Dev Engineer",
        "position_desc": "Tražimo studente sa svježim idejama i entuzijastičkim pristupom u izgradnji softvera u uredima Split i Zagreb. Očekujemo da ćemo naći studente sa snažnom voljom da ih naučimo najnovije koncepte u razvoju weba i da doprinesu našem timu te da uče od profesionalnih programera kao mentora. Ova pozicija je ulazna točka za stalno ili djelomično radno mjesto unutar jednog od naših projektnih timova kao razvojnog inženjera.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.08.2020",
        "compensation": "Praksu ne honoriramo, ali je osiguran ručak."
      },
      {
        "position": "Junior QA Engineer",
        "position_desc": "Bi li rekli da imate oko za detalje? Da li ste ikada okarakterizirani da ste perfekcionist? Očekujemo da ćemo naći studenta sa snažnom voljom da nauči i doprinese našem timu na lokacijama Split i Zagreb. Nudimo učenje od strane profesionalnih programera i QA inženjera kao mentora.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.08.2020",
        "end": "30.09.2020",
        "compensation": "Praksu ne honoriramo, ali je osiguran ručak."
      }
    ]
  },
  "HŽ Infrastruktura": {
    "page": "http://www.hzinfra.hr/",
    "company_address": "Krešimirova 1, Rijeka",
    "company_desc": "HŽ Infrastruktura je tvrtka od strateškog značaja koja upravlja željezničkom infrastrukturom u Republici Hrvatskoj. Ona se bavi organiziranjem i reguliranjem željezničkog prometa, osiguravanjem pristupa i korištenja željezničke infrastrukture svim željezničkim prijevoznicima koji ispunjavaju uvjete propisane Zakonom o željeznici, organizacijom javnog prijevoza i prijevoza za vlastite potrebe, održavanjem i osuvremenjivanjem željezničke infrastrukture, njezinom zaštitom te poslovima investiranja u gradnju željezničke infrastrukture.",
    "jobs": [
      {
        "position": "Glavni inženjer za elektrovučne podstanice (EVP) i postrojenja za sekcioniranje (PS)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja EVP i PS, praćenje i analiza rada EVP i PS, organiziranje, analiza i kontrola održavanja EVP i PS, kontrola tehničke ispravnosti EVP i PS, nadzor radova na otklanjanju kvarova na EVP i PS. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav. Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "06.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za postrojenja jake struje (PJS)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja PJS i energetike, organiziranje, analiza te kontrola kvalitete i kvantitete održavanja PJS , kontrola tehničke ispravnosti PJS, poduzimanja mjera za pouzdani rad PJS. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav. Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "04.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za postrojenja jake struje (PJS)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja PJS i energetike, organiziranje, analiza te kontrola kvalitete i kvantitete održavanja PJS , kontrola tehničke ispravnosti PJS, poduzimanja mjera za pouzdani rad PJS. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav. Za studente ljetne prakse u razdoblju 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "04.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Mogućnost obavljanja prakse s udaljenog mjesta ukoliko će to uvjeti ( koronavirus..) tražiti. Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "03.08.2020",
        "end": "21.08.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Stručna prakse se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje. Za studente ljetne prakse u razdoblju 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Mogućnost obavljanja prakse s udaljenog mjesta ukoliko će to uvjeti ( koronavirus..) tražiti Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje. Za studente ljetne prakse u razdoblju od 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje. Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "21.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Glavni inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje. Za studente ljetne prakse u razdoblju od 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "21.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Inženjer za kontaktnu mrežu (KM)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja KM, organiziranje, analiza i kontrola održavanja KM, kontrola tehničke ispravnosti i pogona postrojenja KM, nadzor radova na otklanjanju kvarova na KM. Mogućnost obavljanja prakse s udaljenog mjesta ukoliko će to uvjeti ( koronavirus..) tražiti. Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "24.07.2020",
        "compensation": "Ne"
      },
      {
        "position": "Inženjer za kontaktnu mrežu (KM)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja KM, organiziranje, analiza i kontrola održavanja KM, kontrola tehničke ispravnosti i pogona postrojenja KM, nadzor radova na otklanjanju kvarova na KM. Stručna praksa se neće moći obavljati s udaljenog mjesta . Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav. Za studente ljetne prakse u razdoblju od 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "03.08.2020",
        "end": "25.08.2020",
        "compensation": "Ne"
      },
      {
        "position": "Inženjer za kontaktnu mrežu (KM)",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja postrojenja KM, organiziranje, analiza i kontrola održavanja KM, kontrola tehničke ispravnosti i pogona postrojenja KM, nadzor radova na otklanjanju kvarova na KM. Mogućnost obavljanja prakse s udaljenog mjesta ukoliko će to uvjeti ( koronavirus..) tražiti. Očekivanja: zainteresiranost za željeznički elektroenergetski infrastrukturni podsustav. Za studente ljetne praksse u razdoblju od 01.07.-15.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Ne"
      },
      {
        "position": "Inženjer za SS",
        "position_desc": "Opis pozicije: planiranje održavanja, mjerenja i ispitivanja SS-uređaja, praćenje i analiza rada SS- uređaja i postrojenja, organiziranje, analiza i kontrola održavanja SS-uređaja, otklanjanje neispravnosti u radu SS-uređaja. Stručna praksa se neće moći obavljati s udaljenog mjesta. Očekivanja: zainteresiranost za željezničko signalno-sigurnosne uređaje. Za studente ljetne prakse u razdoblju od 01.07.-30.09.2020.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "25.07.2020",
        "compensation": "Ne"
      }
    ]
  },
  "IN2": {
    "page": "http://www.in2.hr",
    "company_address": "Marohnićeva 1/1 Zagreb",
    "company_desc": "Tko smo Već 26 godina razvijamo softver za niz industrijskih vertikala. Iskustvo razvoja i implementacije rješenja stekli smo u gotovo svim poslovnim granama. Više od 500 zaposlenih pozicioniranih u 6 država regije, čini IN2 grupu jednim od lidera softverske industrije u regiji. No, unatoč veličini, zadržali smo neformalnu atmosferu, stvarajući iznimno ugodno radno okruženje. IN2 grupa je od 2018. dio CSI grupe (Constellation Software Inc.). CSI je osnovan 1995. godine, djeluje u preko 100 država diljem svijeta, ima 125 000 klijenata i posluje u više od 100 različitih vertikala u javnom i privatnom sektoru. Što radimo Specijalizirani smo za razvoj softverskih rješenja po narudžbi, razvoj i primjenu velikih i složenih IT sustava. Svojim visokokvalitetnim i inovativnim softverskim rješenjima pomažemo klijentima u ostvarivanju njihovih poslovnih ciljeva, pružajući im dugoročno i pouzdano partnerstvo. Naš uspjeh mjerljiv je uspjehom naših klijenata. Kako radimo IN2 samostalno projektira, razvija, implementira te održava velike i složene informacijske sustave upotrebom Oracle, Java i Microsoft tehnologije. Tvrtka je ovladala i uspješno primjenjuje moderna rješenja i tehnologiju kao što su skladišta podataka, web-bazirani aplikacijski sustavi i drugo. Bez obzira na našu usredotočenost na usvajanje i primjenu novih tehnologija, vjerujemo da su naša najveća i najtrajnija vrijednost ljudi. Sukladno tom vjerovanju pridajemo velik značaj odabiru visokoobrazovanih i kreativnih stručnjaka te daljnjem razvoju njihovih znanja i vještina. Nastojimo im osigurati ugodno i motivirajuće radno okruženje jer smatramo da samo zadovoljni i motivirani zaposlenici mogu doprinijeti dugoročnom uspjehu kompanije. Naš cilj S klijentima ostvarujemo dugoročno, strateško partnerstvo, s ciljem potpore svim fazama razvoja i uvođenja informacijskog sustava. Na hrvatskom smo tržištu ostvarili ugled tvrtke koja posao obavlja \"do kraja\". Posebnu pozornost posvećujemo kvaliteti naših proizvoda i usluga. Ispunjavanje potreba korisnika za dosezanjem poslovnih ciljeva u centru je našeg poimanja pojma kvalitete informatičkog proizvoda i usluge. Suradnja s fakultetima i studentskim udrugama Niz godina uspješno surađujemo s najboljim fakultetima u RH te studentskim udrugama. Dovoljno je istaknuti da je nekoliko desetaka studenata napravilo diplomski rad u našoj suradnji s fakultetima - najvećim dijelom se radi o studentima s FER-a i FOI-a. S mnogim fakultetima imamo uspješnu suradnju i u području stručnih praksi i jako nas veseli takva suradnja i sa studentima s FER-a.",
    "jobs": [
      {
        "position": "Digitalizacija notnih zapisa skladbi-JAVA",
        "position_desc": "Izrada aplikacije za vođenje podatka o notnim zapisima pojedinih skladbi, samoj skladbi, te digitalizacija pojedinih notnih zapisa pojedine skladbe Praksa uključuje: Izradu modela u bazi podataka Definiranje java projekta korištenjem spring boot tehnologije Implementaciju poslovno logike, izvještaja i korisničkog sučelja Tehnologije koje bi se koristile su: Java, Spring boot, JPA, Vaadin, Jasper Reports Očekivani rezultat nakon provede prakse: Student može samostalno kreirati zadani model podataka te implementirati poslovnu logiku prema unaprijed definiranim pravilima te izraditi definirano korisničko sučelje korištenjem naučenih tehnologija",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": ""
      },
      {
        "position": "Izrada aplikacije za vođenje osnovnih podataka o pojedinoj udruzi-JAVA",
        "position_desc": "Udruga - članstvo udruga Izrada aplikacije za vođenje osnovnih podataka o pojedinoj udruzi, članstvu udruge i pojedinim aktivnostima udruge koje moraju voditi udruge sukladno Zakonu o udrugama (NN 74/2014) Praksa uključuje: Izradu modela u bazi podataka Definiranje java projekta korištenjem spring boot tehnologije Implementaciju poslovno logike, izvještaja i korisničkog sučelja Tehnologije koje bi se koristile su: Java, Spring boot, JPA, Vaadin, Jasper Reports Očekivani rezultat nakon provede prakse: Student može samostalno kreirati zadani model podataka te implementirati poslovnu logiku prema unaprijed definiranim pravilima te izraditi definirano korisničko sučelje korištenjem naučenih tehnologija Digitalizacija notnih zapisa skladbi Izrada aplikacije za vođenje podatka o notnim zapisima pojedinih skladbi, samoj skladbi, te digitalizacija pojedinih notnih zapisa pojedine skladbe Praksa uključuje: Izradu modela u bazi podataka Definiranje java projekta korištenjem spring boot tehnologije Implementaciju poslovno logike, izvještaja i korisničkog sučelja Tehnologije koje bi se koristile su: Java, Spring boot, JPA, Vaadin, Jasper Reports Očekivani rezultat nakon provede prakse: Student može samostalno kreirati zadani model podataka te implementirati poslovnu logiku prema unaprijed definiranim pravilima te izraditi definirano korisničko sučelje korištenjem naučenih tehnologija",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": ""
      },
      {
        "position": "Izrada baze životopisa i projekata-JAVA",
        "position_desc": "Baza životopisa i projekata: Izrada aplikacije za bilježenje rada pojedine osobe na pojedinom projektu u zadanoj ulozi, u nekom periodu. Generiranje životopisa po zadanom predlošku za pojedinu osobu, te spremanje pojedinih životopisa predanih po ponudi Praksa uključuje: Izradu modela u bazi podataka Definiranje java projekta korištenjem spring boot tehnologije Implementaciju poslovno logike, izvještaja i korisničkog sučelja Tehnologije koje bi se koristile su: Java, Spring boot, JPA, Vaadin, Jasper Reports Očekivani rezultat nakon provede prakse: Student može samostalno kreirati zadani model podataka te implementirati poslovnu logiku prema unaprijed definiranim pravilima te izraditi definirano korisničko sučelje korištenjem naučenih tehnologija",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": ""
      }
    ]
  },
  "Inceptum": {
    "page": "https://inceptum.hr/",
    "company_address": "Ulica grada Vukovara 271",
    "company_desc": "We are a team of 50 creative, enthusiastic and innovative people: developers, networkers, BSS, OSS enthusiasts, ITIL & eTom experts, SCRUM masters, and Kanban gurus. We provide services, solutions and products for running telco operations smoothly. Based on our strong expertise in telco, we support our customers’ needs by designing right solutions compliant with industry standards and best practices. We have successfully implemented complex IT projects in telco, as well as in other industries. The Inceptum team has proven to be very efficient and solution-oriented in: Custom solutions fitting specific customer requirements Projects related to OSS/NMS in telco and enterprise environments Business process management IT Service management Application development Integration of existing and new systems We believe that our key factors for success are service excellence and expertise of our employees, and finally that we are your perfect partner for transforming and improving complex operations in everyday business.",
    "jobs": [
      {
        "position": "Razvojni inženjer za razvoj softvera",
        "position_desc": "Rješenja za upravljanje podacima o resursima unutar podatkovnih centara spremaju sve potrebne podatke kako bi se omogućilo praćenje životnog ciklusa svake komponente. Često podaci spremljeni unutar takvih rješenja ne odgovaraju stvarnom stanju unutar podatkovnih centara te ih je na nekih način potrebno uskladiti. Unutar ove prijave planirana je izrada pregleda podatkovnog centra koristeći proširenu stvarnost (augumented reality) i Microsoft Hololens. Time bi se omogućila interaktivnost između spremljenih podataka te samih komponenti koje su smještene unutar podatkovnog centra.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Razvojni inženjer za razvoj softvera",
        "position_desc": "Poslovni procesu unutar telekom operatera sastoje se od ručnih i automatiziranih operativnih zadataka koji se izvršavaju unutar različitih sustava za operativnu i poslovnu podršku. Prilikom analize tih procesa potrebna je značajna količina vremena kako bi se svi procesi opisali i definirale sve integracijske točke sa postojećim sustavima. Značajan dio operativnih procesa izvršava se u centru za nadzor mreže i usluga (NOC, SOC) gdje se prati stanje samih mrežnih uređaja i korisničkih usluga. Zaposlenici koji rade u nadzornom centru koriste različite alate kako bi ispravili detektirane ili prijavljene greške. Kroz ovu prijavu planirano je izrada sustava za praćenje rada NOC / SOC zaposlenika temeljenog na machine learning sustavima. Napraviti će se komponenta koja će snimati radnu površinu računala (screen scraping), prepoznati i spremati akcije u definiranu bazu podataka. Spremljeni podaci će biti korelirani sa podacima iz ostalih sustava (analiza logova, prometa i slično) kroz ML komponentu kako bi se dobio opis poslovnog procesa za svakodnevne operativne aktivnosti.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "DA"
      }
    ]
  },
  "INETEC - Institut za nuklearnu tehnologiju": {
    "page": "www.inetec.hr ",
    "company_address": "DOLENICA 28, LUČKO-ZAGREB, 10250",
    "company_desc": "For more than twenty years, INETEC has been a name synonymous with technological and service excellence in nuclear industry. We have gained international acclaim for developing technologies for nuclear power plant examination and repair, inspection and repair services, as well as various engineering studies that we conduct as our regular scope of activities. In doing so, we are active in permanent programs of research, development, design, construction and fabrication of equipment, tools, plugs and probes, including software and instruments for non-destructive examination. We offer a range of products and services meeting the highest standards such as ISO 9001, ISO 14001, OHSAS 18001, ISO/IEC 17025 etc.",
    "jobs": [
      {
        "position": "Optimalno gibanje robota",
        "position_desc": "Izračun optimalne putanje robota za ispitivanje cijevne stijene uz zadane restrikcije i pravila kretanja. Problem je sličan trgovačkom putniku, uz dodatne uvjete. Primjeri dodatnih uvjeta: izračun idućeg koraka mora biti u stvarnom vremenu moguć je veći broj putnika od 1 velik broj gradova promjenjiv broj gradova i poveznica između njih.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Programiranje proširene i virtualne stvarnosti za potrebe razvoja industrijskih uređaja",
        "position_desc": "Importiranje objekata i manipuliranje objektima u virtualnoj stvarnosti. Programiranje industrijskog okruženja. Programiranje izbornika. Programiranje kretanja unutar zadanog prostora u virtualnoj stvarnosti. Prikaz dodatnih slojeva za AR i VR.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Robotski vid",
        "position_desc": "Unapređenje algoritma za detekciju cijevi i izračun pozicije stroja iz slike pomoću fish eye kamere. Potrebno je optimizirati brzinu i potrebne resurse za izvođenje algoritma, kao i stabilnost i robusnost detekcije (uvjeti osvjetljenja, brzina gibanja kamere, promjena vertikalne udaljenosti kamere od površine).",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "01.07.2020",
        "compensation": "Da"
      },
      {
        "position": "Testiranje i debuggiranje web aplikacije",
        "position_desc": "Testiranje novih revizija web aplikacije za planiranje i management inspekcija nuklearnih elektrana, dokumentiranje pronađenih problema i rješavanje istih.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Da"
      }
    ]
  },
  "INFIGO IS": {
    "page": "www.infigo.hr",
    "company_address": "Karlovačka 24a, 10020 Zagreb",
    "company_desc": "Tvrtka INFIGO IS d.o.o. je osnovana 2005. godine, a specijalizirana za isporuku rješenja i pružanje profesionalnih usluga u području informacijske sigurnosti i analize podataka. Zaposlenici INFIGO IS svojim znanjem, iskustvom i referencama među vodećim su stručnjacima na području informacijske sigurnosti u Republici Hrvatskoj i regiji.",
    "jobs": [
      {
        "position": "Data scientist/Python developer",
        "position_desc": "Rad na razvoju komponenti INFIGO Big Data sustava.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "28.08.2020",
        "compensation": "Honoriranje ovisno o rezulatima i zalagnju studenta."
      },
      {
        "position": "Junior penetration tester",
        "position_desc": "Rad na projektima penetracijskih testova na svim razinama (mrežni testovi, testovi web i mobilnih aplikacija i dr.) te na projektima istraživanja sigurnosnih ranjivosti.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "14.08.2020",
        "compensation": "Ovisno o zalagnju i rezultatima."
      }
    ]
  },
  "Infoart": {
    "page": "http://www.infoart.hr",
    "company_address": "Lastovska 23, 10 000 Zagreb",
    "company_desc": "Vodeći smo ponuđač IT rješenja za mobilno plaćanje iz područja javnih usluga: parkinga, e-punionica, prijevoza i ticketinga. Naše inovativno i jednostavno rješenje za mobilno plaćanje jedno je od najdugovječnijih i najuspješnijih rješenja za plaćanje parkiranja u svijetu. Primjenom pouzdanih razvojnih platformi i najnovijih tehnologija vodećih svjetskih proizvođača osiguravamo visoku raspoloživost, dugotrajnost, skalabilnost i fleksibilnost naših rješenja u primjeni kod domaćih i stranih klijenata.",
    "jobs": [
      {
        "position": "Java programer",
        "position_desc": "U sklopu ljetne prakse studentima će uvodno ukratko biti prezentirana arhitektura čitavog ERP sustava koji se sastoji od niza aplikacija vezanih uz prodaju, financije, ljudske potencijale i obračun plaća. Vlastiti ERP sustav Infoart razvija već dugi niz godina te će studenti dobiti priliku iz prve ruke vidjeti s kakvim izazovima se članovi tima suočavaju u održavanju i razvoju jednog tako kompleksnog sustava; na koji način se postiže kompromis između zakonskih regulativa, želja korisnika naših aplikacija i vremenskih okvira u kojima se projekti moraju isporučiti; te koja se rješenja koriste za integraciju i komunikaciju sa vanjskim sustavima. U drugom djelu prakse studentu će biti dodijeljen konkretan zadatak u sklopu kojeg će student dobiti dojam kako funkcionira razvoj 'enterprise' aplikacija, tj. koja je razlika između pisanja koda'za labose' i pisanja koda za produkcijske sustave koje koriste pravi korisnici.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, prema odrađenim satima"
      }
    ]
  },
  "InSky Solutions": {
    "page": "www.inskysolutions.com",
    "company_address": "Siget 14e, Zagreb",
    "company_desc": "Core business tvrtke InSky Solutions upravljanje je odnosa s korisnicima i korisničko iskustvo odnosno CRM. Korisnički orijentirane kompanije i CRM kao filozofija je nešto što mi zajedno sa svojim korisnicima, kao i s korisnicima svojih korisnika i živimo. InSky stvara i prati trendove kojih se drže i oni najveći: Mobile-First, Cloud-First te njeguje viziju globalnog tržišta bez granica. Umjesto kompliciranih i skupih softvera, nudimo jednostavna poslovna rješenja razvijena na poznatim te priznatim Microsoftovim alatima: Microsoft Dynamics 365, Skype for Business, Exchange, SharePoint i Office 365. Na bezbolan način se umjesto organizacijskog i sveobuhvatnog rješenja u tom slučaju može uvesti poslovno rješenje na razini pojedinog odjela koji osim svog lakšeg uvođenja puno prije donosi i vidljive rezultate. Takav pristup kasnije može biti primjer za uvođenje globalnog sustava na razini cijele organizacije i pomoć pri izbjegavanju prepreka na koje se već naišlo. Poslovnim savjetovanjem zapravo pripremamo tvrtku ne samo na usklađivanje i promjenu procesa, nego i same organizacije. Tehnologija kao takva dolazi na kraju. Industrijsko znanje koje smo na putu stekli, u vertikalama kao što su turizam, farmacija, financije, proizvodnja, javni sektor, ICT itd. pomaže nam da prepoznamo stvarne potrebe korisnika i lakše mu približimo stvarne prednosti korisnički orijentiranih procesa. U turističkom sektoru smo trenutno lideri u Hrvatskoj te s velikim hotelskim lancima poput Valamara, Maistre i Liburnie, ili malo manjih, ali digitalno jako progresivnih poput Aminessa, Medore, Hotela Njivice, Hotela Cavtat, Hotela Metropol, koji su naravno pioniri i predvodnici prihvaćanja CRM rješenja, krećemo u nove projekte te smo sve značajnije prisutni i u regiji te šire. Naš portfelj rješenja TourismInSky nastao je inicijalno na horizontalnom rješenju kontaktnog centra - ContactInSky te se vrlo brzo proširio na kompletan portfelj koji uključuje osim direktne prodaje, i grupe i alotmane i marketinšku automatizaciju i program vjernosti i kongresni turizam i sučelje za operacije, geomarketing, mobilnu aplikaciju, upravljanje objektima i aktivnostima, pametne sobe, Internet of things, predikciju... Kroz provedbu projekta Internacionalizacija poslovanja i sudjelovanjem na vodećim svjetskim sajmovima tvrtka InSky Solutions planira plasirati svoje proizvode na tržišta šire regije, Centralne Europe, te Azije. Potencijalni kupci InSky proizvoda su poduzeća (mala, srednja i velika) u područjima turizma, farmacije, IT industrije, proizvodnih kompanija, financijskih institucija, maloprodaje i veleprodaje i dr. pri čemu je konkurentska prednost tvrtke InSky Solutions inovativnost rješenja. Posebno su ističu poslovna rješenja za turizam (TourismInSky), kontaktni centar (ContactInSky), program vjernosti (LoyaltyInSky) i upravljanje nekretninama (RealestateInSky). Korisnici poslovnih rješenja su najčešće dugogodišnji klijenti s izraženom potrebom frekventne komunikacije, a usluge koje traže uključuju: edukacije, zahtjeve za promjenom, analize, snimke stanja, pripremu i implementaciju, korektivna i adaptivna održavanja sustava i dr.",
    "jobs": [
      {
        "position": "Razvojna inženjerka/Razvojni inženjer",
        "position_desc": "InSky Solutions, mladi kao tvrtka, vrlo iskusni kao pojedinci, jako uigrani kao tim, i već sada globalno nagrađivani kao ideja. Osnovani smo krajem 2016. godine s misijom digitalne transformacije tvrtki u klijent–centrične lidere. Core business tvrtke InSky Solutions upravljanje je odnosa s korisnicima i korisničko iskustvo odnosno CRM. Korisnički orijentirane kompanije i CRM kao filozofija je nešto što mi zajedno sa svojim korisnicima, kao i s korisnicima svojih korisnika i živimo. Naša misija je digitalna preobrazba tvrtki u lidere usmjerene na klijente. Trenutno smo lideri u turističkom sektoru u Hrvatskoj i regiji, prepoznati smo i priznati u financijskom sektoru, farmaciji, proizvodnom sektoru, sektoru za upravljanje imovinom, javnom sektoru te ICT-u. Najviše korisnika trenutno brojimo u turističkom sektoru gdje imamo značajnu ulogu budući da više od 10% svih rezervacija u Republici Hrvatskoj dolazi kroz naše ContactInSky odnosno TourismInSky rješenje. Uz novi ured u Nizozemskoj, planiramo otvaranje niza inozemnih podružnica. Svaki novi zaposlenik uvodi se u posao uz stručnu podršku svog mentora. U InSky-u jako cijenimo proaktivnost, želju za napredovanjem i timskim radom te svakom zaposleniku omogućavamo uključivanje u program internih edukacija gdje senior razvojni inženjeri i konzultanti prenose znanja ostalim zaposlenicima. Također, u suradnji s fakultetima i neformalnim obrazovnim institucijama osiguravamo daljnje usavršavanje u konkretnim i specijaliziranim programima. Tražimo osobe koje su, kao i mi, motivirane novim izazovima i radom na međunarodnim projektima gdje vide priliku za osobni rast i razvoj. Nudimo: Mogućnost rada od doma, Dobru okolinu za razvoj i napredovanje, Rad na super zanimljivim projektima i najnovijim tehnologijama, Česta druženja, mjesečna, kvartalna, Team Buildinge Fleksibilno radno vrijeme Stol za ping-pong 😊",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": ""
      }
    ]
  },
  "Intea d.d.": {
    "page": "www.intea.hr",
    "company_address": "Avenija Većeslava Holjevca 27, 10020 Zagreb",
    "company_desc": "",
    "jobs": [
      {
        "position": "DCS/PLC programer",
        "position_desc": "Rad na sustavu automatskog upravljanja (HMI & PLC) čeličane.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.07.2020",
        "compensation": ""
      }
    ]
  },
  "INTIS ENGINEERING DOO": {
    "page": "https://intis-engineering.com/",
    "company_address": "Bani 73a",
    "company_desc": "NTIS ENGINEERING je tvrtka osnovana davne 1989. godine pod imenom EXOR i od tada se bavi inženjeringom i automatizacijom najzahtjevnijih tehnoloških procesa. Nakon 30 godina uspješnog rada širom svijeta i osnivanja 4 podružnice, te reorganizacije poslovanja, tvrtka INTIS ENGINEERING sačuvala je status vodeće firme u regiji za inženjering i automatizaciju industrijskih procesa širom svijeta. Sa svojim podružnicama u raznim zemljama INTIS ENGINEERING svojim je djelovanjem trajno prisutan na različitim kontinentima. Predan upotrebi modernijih tehnologija razvojem vlastitih proizvoda INTIS ENGINEERING prati sve najnovije trendove u svijetu elektrotehnike i računarstva. Brojne reference širom svijeta na području automatizacije industrijskih integralnih projekata i kapitalnih investicija u metalnoj industriji, rudnicima, autoindustriji, farmaceutskoj industriji te industriji nafte i plina rezultat su našeg dugogodišnjeg uspješnog rada. Spajanjem s firmom OMIKO koja više od 25 godina djeluje u procesnoj industriji, u 2018. godini INTIS ENGINEERING se također pozicionirao kao vodeća tvrtka za procesnu instrumentaciju u Hrvatskoj. Svojim širokim spektrom opreme i usluga INTIS ENGINEERING može odgovoriti na sve izazove koje moderna industrija danas postavlja. Mladim i perspektivnim kadrovima, koji se educiraju od strane najboljih inženjera u svojim područjima ekspertize, osiguravamo kontinuirano poboljšanje usluge koju pružamo korisnicima. Korištenjem najmodernijih rješenja i standardizacijom procesa rada, podižemo kvalitetu usluge i zadržavamo konkurentnost na tržištu. INTIS ENGINEERING nudi svojim kupcima mjernu opremu, projektiranje, izradu aplikacijskih rješenja, puštanje u rad isporučene mjerne opreme, proizvodnju elektro ormara, obuku korisnika, servis i rezervne dijelove. Kontinuirana korisnička podrška i izvan jamstvenog roka, kvaliteta opreme, te postojanost, to je temelj na kojem održavamo povjerenje naših partnera. Niz elektroničkih proizvoda i softverskih alata rezultat su vlastita razvoja koji u stopu slijedi najnovije tehnološke promjene. Predanost kvaliteti i potrebama kupca, te briga o vlastitim zaposlenicima glavne su odrednice koje su nam omogućile dug i uspješan rad na zahtjevnom svjetskom tržištu.",
    "jobs": [
      {
        "position": "JUNIOR AUTOMATION ENGINEER",
        "position_desc": "Izrada PLC softvera i razvoj HMI-ja je nešto što želite raditi? TAP (Trans Adriatic Pipeline) je projekt u kojem želite sudjelovati? Želite raditi s najnovijim tehnologijama u automobilskoj, naftnoj, metalnoj i ostalim industrijama? Stalo Vam je do opuštene i proaktivne radne atmosfere? INTIS ENGINEERING je mjesto visoko kvalificiranih stručnjaka koji cijene raznolikost, izvrsnost i prijateljsku atmosferu gdje Vam nudimo: · Putovanja i rad u zemljama poput Njemačke, Italije, SAD-a i brojnih drugih · Dobra i stabilna primanja · Rad s opremom različitih renomiranih brandova u području automatizacije – Siemens, ABB, Schnieder, Allen-Bradley i Beckhoff · Rad na projektima „Ključ u ruke“ i sudjelovanje u cjelokupnom procesu od projektiranja, izrade električnih ormara i softvera te puštanje u pogon Kao što nam je stalo do najnovijih tehnologija, tako nam je stalo i do naših zaposlenika. Ako se odlučite postati dio našeg tima, nudimo vam i dodatno usavršavanje te učenje kroz tečajeve po svijetu, ali i unutar kompanije. Također, stalo nam je i do fizičkog zdravlja naših zaposlenika i pružamo vam masažu i tjelovježbu kod naše kineziologinje kada god Vam treba. Kako ne bi brinuli što jesti, pružamo Vam i besplatan topli obrok. Opis posla: · Programiranje i puštanje u pogon sustava automatizacije · Razvoj programa PLC-a · Razvoj SCADA / HMI sustava · Testiranje opreme · Sudjelovanje u timskim zadacima Uvjeti: · Preferirano iskustvo 2 ili više godina u automatizaciji kao PLC programer · Poznavanje programiranja na STEP7 / TIA portalu, PCS7 ili drugoj PLC platformi · Spremnost za učenje i usavršavanje · Spremnost za terenski rad u stranim zemljama. · Vozačka dozvola B kategorije · Jezici: Engleski (B1), Njemački (prednost),Talijanski (prednost) Tko smo mi? INTIS ENGINEERING je kompanija s misijom kreiranja proizvoda i rješenja, izrađenih po mjeri kupca. Cilj nam je graditi nove tehnologije, ali i uživati i zabavljati se na putu ostvarenja naših ciljeva. Imamo reference u raznim industrijama, a tijekom svog postojanja od 1991. godine (tada pod imenom EXOR). Uspješno smo automatizirali stotine tvornica širom svijeta. Naši zaposlenici posjeduju znanje i iskustvo stečeno tijekom provođenja projekata na inozemnom i domaćem tržištu u automobilskoj, metalnoj, prehrambenoj, papirnoj i naftnoj industriji, brodogradnji i energetici. Našim kupcima nudimo različite usluge u rasponu od razvoja, dizajna, izrade elektro ormara, izrade softvera do puštanja u rad, optimizacije i održavanja. Sjedište tvrtke nalaze se u Zagrebu, a prisutni smo i u susjednim zemljama (Italija, Njemačka, Srbija i Ukrajina).",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "13.05.2020",
        "end": "13.05.2020",
        "compensation": "da/25kn po satu"
      }
    ]
  },
  "IPC": {
    "page": "www.ipc.hr",
    "company_address": "Mihovljanska 72, 40000 ČAKOVEC",
    "company_desc": "IPC d.o.o. je kćerinska tvrtka Međimurje IPC d.d. -a. IPC je kroz Međimurje IPC dio informatičke tradicije duže od 40 godina a danas se bavi IT sustavima u području naplate i kontrole parkiranja te daljinskim očitanjem brojila za vodu i plin. IPC nudi korisnicima kompletna rješenja za digitalizaciju poslovanja u vidu usluge u oblaku. Osim vlastitih programskih rješenja iPC zastupa i renomirane proizvođače opreme te ih kao sistem integrator integrira u vlastita rješenja. Djelatnici IPC-a čine kompaktni tim posvećen razvoju aplikacija i servisa za web, pametne telefone i standarnde windows aplikacije. U IPC-u djeluje i servis parkirnih aparata Hectronic.",
    "jobs": [
      {
        "position": "Razvojni programer Android aplikacija",
        "position_desc": "Razvoj novih aplikacija za android smart uređaje: Analiza i uvid u terenske android aplikacije koje su u pravilu izdvojeni dio centralnog sustava upravljanja. Na praksi će student moći započeti svoju aplikaciju prema novim specifikacijama ili preoblikovati postojeće aplikacije na bazi vlastitog odabira dizajna ili bitnog utjecaja na dizajn istog. Razvojni zadatak uključuju integraciju slijedećih tehnologija u telefonu: komunikacija, kamera, GPS, osvjetljenje, vibracija.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "(prema dogovoru)"
      },
      {
        "position": "Web Frontend developer",
        "position_desc": "Izrada web modula za Webpark i Portunus web stranicama ( platforme IPC-a), rad na novim funkcionalnostima UI sučelja, modernizacija UI sučelja.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "moguć dogovor"
      }
    ]
  },
  "Kod Biro": {
    "page": "www.kodbiro.com",
    "company_address": "XIV Podbrezje 15 10000 Zagreb",
    "company_desc": "Kod Biro d.o.o. tvrtka koja se bavi izradom softvera sa naglaskom na razvoj i primjenu tehnologija proširene stvarnosti (AR). Razvijamo vlastitu platformu koja omogućuje izradu efekata proširene stvarnosti u vlastitim aplikacijama na bilo kojoj web, desktop i mobilnoj platformi. Tehnologija se uspješno primjenjuje u preko 50 aplikacija diljem svijeta, a jedna od njih je i Darmar - Maske domaćih faca. Tražimo kandidate koji žele raditi na razvoju uzbudljivih novih tehnologija i koji žele stalno gurati granice svojih znanja bilo da se radi o mobilnim tehnologijama, c++ game engine developmentu ili web razvoju.",
    "jobs": [
      {
        "position": "C++ 3D engine developer",
        "position_desc": "Pozicija uključuje rad na razvoju 3D enginea za iscrtavanje AR efekata u sceni. Sustav je pisan u C++-u i radi na MacOS, Android, iOS i HTML platformi. Rad uključuje implementiranje novih funkcionalnosti kao i poboljšanje performansi postojećih kao što su: - 3D fizika - rad sa 3D animacijama - rad sa multimedijom - video, slika i zvuk - pisanje shadera - razvoj platform-specific kommpoenti - optimiziacija performansi Idealna pozicija za sve kandidate koji žele steći nova i produbiti postojeća znanja iz područja 3D grafike. Fleksibilni smo po pitanju početka i kraja prakse, navedeni datumi su samo prijedlog.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "15.07.2020",
        "end": "15.08.2020",
        "compensation": "40 kuna sat"
      },
      {
        "position": "Mobilni developer",
        "position_desc": "Tražimo osobu koja bi radila na developmentu iOS i Android mobilnih aplikacija. Radi se o aplikacijama proširene stvarnosti koje na lice korisnika u postavljaju razne AR filtre i efekte. Aplikacije implementiraju vlastitu in-house razvijenu AR platformu. Kandidat će imati priliku raditi na novim te postojećim aplikacijama sa stotinama tisuća aktivnih korisnika. Opis posla: - Razvoj novih funkcionalnosti na iOS i Android platformi - Optimizacija performansi i sučelja - Optmizacija kornisničke baze - A/B testing, praćenje i analiza ponašanja korištenja u svrhu optimizacije prihoda od pretplate isl Fleksibilni smo oko datuma početka i završetka prakse. Slobodno javite i ukoliko vam predloženi ne odgovaraju.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "15.07.2020",
        "end": "15.08.2020",
        "compensation": "40 kuna sat"
      },
      {
        "position": "Web Developer",
        "position_desc": "Tražimo kandidata koji će raditi na razvoju developer portala za vlastitu AR SDK tehnologiju. Portal se koristi kao sustav za prijavu korisnika, provizioniranje licenci, upravljanje bazom znjanja, online naplatom pretplata i praćenje statistike korištenja instanci SDK-a. Kandidat će raditi na razvoju novih funkcionalnosti te optimiziranju postojećih. Mogućnost rada na frontend i/ili backend dijelu. Korištene tehnologije: React, AWS, Stripe. Idealno pozicija za kandidate koji žele usavršiti svoje web sposobnosti na projektu koji je koriste stotine drugih developera - korisnika naše AR tehnologije. Fleksibilni smo što se tiče datuma početka prakse, navedeni datumi su okvirni prijedlog.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "15.07.2020",
        "end": "15.08.2020",
        "compensation": "40 kuna sat"
      }
    ]
  },
  "KONČAR - INŽENJERING ZA ENERGETIKU I TRANSPORT D.D.": {
    "page": "http://koncar-ket.hr/",
    "company_address": "KONČAR - INŽENJERING ZA ENERGETIKU I TRANSPORT D.D. FALLEROVO ŠETALIŠTE 22 10000 ZAGREB",
    "company_desc": "KONČAR - Inženjering za energetiku i transport d.d. vodeće je nastupno poduzeće i nositelj inženjering djelatnosti u grupi KONČAR – Elektroindustrija d.d. Osnovna djelatnost poduzeća je izgradnja složenih objekata i postrojenja u energetici, transportu, vodoprivredi i industriji po načelu «ključ u ruke», s naglaskom na inženjering elektroenergetske opreme iz proizvodnog programa KONČAR-a.",
    "jobs": [
      {
        "position": "Projektant elektroenergetskih objekata",
        "position_desc": "- projektiranje u elektroenergetskim objektima - izrada jednopolnih i blok shema, dijagrama toka, strujnih shema, prikljčnih planova, lista kabela i planova polaganja kabela - proučavanje projektnog zadatka, šire slike projekta, tendera i tehničkih zahtjeva projekta",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "24.07.2020",
        "compensation": "Praksa se honorira po dovršetku posla."
      },
      {
        "position": "Projektant elektroenergetskih objekata, trafostanice",
        "position_desc": "- projektiranje u elektroenergetskim objektima - izrada jednopolnih i blok shema, dijagrama toka, strujnih shema, prikljčnih planova, lista kabela i planova polaganja kabela - proučavanje projektnog zadatka, šire slike projekta, tendera i tehničkih zahtjeva projekta",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "03.08.2020",
        "end": "02.10.2020",
        "compensation": "Praksa se honorira jednom mjesečno po dovršetku posla."
      },
      {
        "position": "Sistemski inženjer - Relejna zaštita i upravljanje u postrojenjima EES-a",
        "position_desc": "- konfiguriranje tipskih polja i komunikacijskih fileova - priprema podloga za ispitne protokole i provedba primarnih ispitivanja te FAT i SAT ispitivanja funkcionalnosti sustava - kontrola ispravnosti strujnih shema, usklađenosti releja s projektnim zahtjevima i ispravnosti proračuna u elaboratu zaštite - revidiranje strujne sheme prema stvarnom stanju u postrojenju",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "03.08.2020",
        "end": "02.10.2020",
        "compensation": "Praksa se honorira jednom mjesečno po dovršetku posla"
      },
      {
        "position": "Sistemski inženjer za SCADA sustave",
        "position_desc": "- radovi na konfiguriranja SCADA sustava - uspostavljanje komunikacije s numeričkim uređajima - formiranje baze procesnih signala - izrada ekranskih prikaza s adresiranjem informacija",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Praksa se honorira po završetku posla."
      },
      {
        "position": "Softverski inženjer",
        "position_desc": "Razvoj aplikacija za automatizaciju raznih procesa.",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "06.07.2020",
        "end": "24.07.2020",
        "compensation": "Praksa se honorira po dovršetku cijelog posla."
      }
    ]
  },
  "Končar-MES d.d.": {
    "page": "http://www.koncar-mes.hr/",
    "company_address": "Fallerovo šetalište 22, HR-10000 Zagreb",
    "company_desc": "MES d.d. je hrvatska tvrtka koja se bavi proizvodnjom elektromotora (trofazni, jednofazni, elektromotori s kočnicom, protueksplozijski zaštićeni elektromotori i servo motori), ventilatora i pogona. Končar-MES d.d. je članica grupe Končar Elektroindustrija d.d. u čijem je sto-postotnom vlasništvu, a zapošljava dvjestotinjak kvalificiranih radnika koji su u svakom trenutku spremni prilagoditi se različitim zahtjevima kupaca i tržišta. Naš proizvodni program baziran na 60-godišnjem iskustvu podržan je vlastitim razvojem, konstantnim unapređenjem tehnologije i proizvodnih procesa te kvalitetnim servisom što čini dobru osnovu naših dugoročnih ciljeva. Naš kapacitet je 150.000 komada elektromotora godišnje, a jedan od naših najvrijednijih potencijala čini kompetentno i školovano tehničko osoblje, posebno inženjeri koji koriste svoja znanja i sposobnosti u primjeni novih ideja u našim proizvodima. Našom poslovnom strategijom nastojimo biti stalno prisutni u krugu uspješnih proizvođača pogonske tehnike na svjetskom tržištu. Težimo stalnom rastu naše proizvodnje ispunjavanjem zahtjeva tržišta i želja kupaca diljem svijeta što dokazuje naše mjesto u samom vrh proizvođača elektromotora i pogona u regiji i činjenica da više od 60% svojih proizvoda izvozimo na tržišta Europske Unije.",
    "jobs": [
      {
        "position": "Praktikant na poslovima u namotaonici, montaži, ispitnoj stanici i tehničkom uredu",
        "position_desc": "Praktikant će se upoznati sa fizičkom izradom namotanog staora u namotaonici, montiranjem motora u montaži, ispitivanjem motora u ispitnoj stanici i projektiranjem motora u tehničkom uredu.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.11.2020",
        "compensation": "Dogovor"
      }
    ]
  },
  "Končar Mjerni transformatori d.d.": {
    "page": "http://www.koncar-mjt.hr/",
    "company_address": "Josipa Mokrovića 10, 10090 Zagreb",
    "company_desc": "KONČAR-Mjerni transformatori d.d . proizvode mjerne transformatore preko 65 godina i tako su prikupili respektabilno iskustvo ne samo u području proizvodnje, već i istraživanja i inovacija. Društvo trenutno zapošljava 260 djelatnika, od kojih 27% ima veleučilišnu ili sveučilišnu diplomu. Prosječna dob zaposlenika je 41 godina, a prosječni radni staž 20 godina, što predstavlja optimalni omjer mladosti i iskustva. Tvornica se prostire na preko 26.530 m², što uključuje 9.870 m² natkrivenog prostora za proizvodnju. Godišnji proizvodni kapaciteti su: Visokonaponski uljem i plinom izolirani mjerni transformatori – 4.000 kom Srednje- i niskonaponski mjerni transformatori odliveni u epoksidnoj smoli – 10.000 kom Proizvodni program naše tvornice može se podijeliti u nekoliko osnovnih kategorija: Visokonaponski uljem izolirani mjerni transformatori Visokonaponski mjerni transformatori izolirani plinom SF6 Srednjenaponski mjerni transformatori Specijalni mjerni transformatori Ostali proizvodi LJUDSKI POTENCIJALI Naši zaposlenici su srž svih dodanih vrijednosti koje pružamo. Naravno, oni su naš najznačajniji resurs. Stoga ulažemo značajna sredstva u njihov profesionalni i osobni razvoj. Kvalifikacijska struktura osoblja i sustav stalnog osposobljavanja osigurava da naši djelatnici imaju potrebna znanja i vještine za učinkovito izvršavanje zadataka. Pravovremeno prepoznavanje potreba za određenim znanjima od presudnog je značaja!",
    "jobs": [
      {
        "position": "Analitički i numerički proračuni i modeli mjernih transformatora",
        "position_desc": "Analitički i numerički proračuni i modeli mjernih transformatora",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima. Početak i završetak prakse po dogovoru."
      },
      {
        "position": "Elektrčni dizajn srednjenaponskih epoksidnih mjernih transformatora",
        "position_desc": "Električni proračuni klase točnosti i izolacije.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima. Početak i završetak prakse po dogovoru."
      },
      {
        "position": "Električni dizajn mjernih transformatora",
        "position_desc": "Električni proračun klase točnosti i izolacije.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima. Početak i završetak prakse po dogovoru."
      },
      {
        "position": "Inženjer u ispitnoj stanici",
        "position_desc": "Priprema ispitivanja i analiza rezultata.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima. Početak i završetak prakse po dogovoru."
      }
    ]
  },
  "KRAKEN": {
    "page": "https://krakensystems.co/",
    "company_address": "Zagrebačka avenija 104d 10000 Zagreb",
    "company_desc": "Kraken se bavi razvojem i održavanjem sustava na području obrade podataka i machine learninga, automatizacije procesa, industrije, medicine i IoT te surađuje sa širokim spektrom klijenata i partnera iz cijelog svijeta. Ujedno usko surađuje s partnerskom tvrtkom Ascalia, koja se bavi \"industrijom 4.0\" i \"smart city\" rješenjima.",
    "jobs": [
      {
        "position": "Backend Engineer",
        "position_desc": "This position offers tasks that would ask of you to tackling exciting challenges in areas like big data, distributed computing, marketing automation, and IoT. What would you work on? Work with us on projects like: Smart City and Industry 4.0 management platform Cloud knowledge base developed with developers in mind Software licensing management platform adding a personalization layer to some of Fortune 500 companies like Nestle, Forbes, Unilever, Ferrero, etc. building web apps that utilize machine learning technologies for all sorts of analysis The work would include: development of Python/Go-based services and tools Django framework web development",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, 30 kn/h"
      },
      {
        "position": "Frontend Engineer",
        "position_desc": "This position offers tasks that would ask of you to tackling exciting challenges in areas like big data, distributed computing, marketing automation, and IoT. What would you work on? Work with us on projects like: Smart City and Industry 4.0 management platform Cloud knowledge base developed with developers in mind Software licensing management platform Smart store kiosk building web apps that utilize machine learning technologies for all sorts of analysis Some of the challenges on the way: using vanilla JS to modify a website which is being accessed by 1M users monthly and make sure that elements are rendered as expected on a wide range of devices/browsers deciding which type of graph to use to render 5-20.000 interconnected circles with the speed of rendering as a factor",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, 30 kn/h"
      },
      {
        "position": "Machine Learning Expert",
        "position_desc": "This position offers tasks that would ask of you to tackling exciting challenges in areas like big data, distributed computing, marketing automation, and IoT. What would you work on? What will you help us tackle: making sense of the data collected from different sources (Twitter, Reddit, Instagram, Facebook, Linkedin, forums, websites, etc.) determining what is relevant and what to ignore deriving meaningful relationships between seemingly unconnected variables using machine learning to learn, automatize and conclude",
        "n_available": 1,
        "n_prioritized": 2,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, 30 kn/h"
      },
      {
        "position": "Site Reliability Engineer (SRE)",
        "position_desc": "Site Reliability Engineering (SRE) is a discipline that incorporates aspects of software engineering and applies them to infrastructure and operations problems. What would you work on? With us, you would be working on tasks related to: distributed systems handling various web apps, services, and IoT an in-house service we developed from scratch for the last 5 years - a distributed high-load system spreading over 4 continents optimizing and rebuilding high traffic infrastructures for our clients developing backend APIs, real-time tracking services, etc. The work would include: management, deployments, monitoring, backups, performance tuning, troubleshooting, etc. Kubernetes, containers (Docker, rkt), automation tools (Ansible, SaltStack), cloud providers Go, C/C++, Python",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "24.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, 30 kn/h"
      }
    ]
  },
  "Leapbit": {
    "page": "https://www.leapbit.com",
    "company_address": "Savska opatovina 36, 1. kat, 10090 Zagreb",
    "company_desc": "Leapbit je brzo rastuća tvrtka koju su osnovali ljudi s bogatim iskustvom u razvoju i podršci brojnih softver rješenja u iGaming industriji. Razvijamo rješenja i sustave za retail i online sportsko klađenje, web i mobilne aplikacije, virtualne igre i drugo.",
    "jobs": [
      {
        "position": "Razvojni inženjer (Go)",
        "position_desc": "Rad u timu koji se bavi izradom i održavanjem servisa: kodiranje, testiranje i održavanje servisa u Go programskom jeziku; isporuka servisa koristeći CI/CD principe; pisanje tehničke dokumentacije.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "25.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o predznanju i dogovoru sa studentom."
      },
      {
        "position": "Razvojni inženjer (Node.js+Vue.js/NativeScript)",
        "position_desc": "Rad u timu koji se bavi izradom i održavanjem web, mobile i backoffice korisničkih aplikacija i servisa: kodiranje, testiranje i održavanje Node.js servisa; kodiranje, testiranje i održavanje Vue.js web aplikacija ili NativeScript mobilnih aplikacija; isporuka servisa koristeći CI/CD principe; pisanje tehničke dokumentacije.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "25.09.2020",
        "compensation": "Postoji mogućnost honoriranja prakse, ovisno o predznanju i dogovoru sa studentom."
      }
    ]
  },
  "Maxtena": {
    "page": "https://www.maxtena.com/",
    "company_address": "Trg žrtava fašizma 2, 10 000 Zagreb",
    "company_desc": "Maxtena was founded in 2007, fueled by the desire to create the first commercially viable digitally steerable antenna. Several years of conducting research has culminated in the creation of Dynamic Aperture Technology (DAT™) . Maxtena designs and manufactures advanced antenna solutions based on our patented Dynamic Aperture Technology TM (DAT). Our antennas empower our customers to develop unparalleled solutions for Global Navigation Satellite Systems (GNSS), Terrestrial and Satellite Machine-to-Machine (M2M), and Mobile Satellite Services (MSS) applications. We use DAT to design extremely lightweight and high-performance helical, patch and LTE antenna solutions for wireless communications. With our industry leading antenna engineering staff, we can provide expert assistance in any antenna integration, and are uniquely positioned to enable OEMs with a custom antenna solution.",
    "jobs": [
      {
        "position": "Antenna Engineer Summer Internship",
        "position_desc": "Antenna Engineer summer internship at Maxtena is an exciting opportunity to work for a top company in the telecommunication segment. The purpose of the internship is to provide meaningful, professional hands-on experience to students with proven academic performance and leadership potential. Interns will have the opportunity for meaningful contribution to Engineering department’s business objectives while experiencing personal professional development. This internship will be based in Zagreb, Croatia. The Intern will focus on the Antenna Engineering projects.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Hourly"
      },
      {
        "position": "Embedded Systems Engineer Summer Internship",
        "position_desc": "Embedded Systems Engineer summer internship at Maxtena is an exciting opportunity to work for a top company in the telecommunication segment. The purpose of the internship is to provide meaningful, professional hands-on experience to students with proven academic performance and leadership potential. Interns will have the opportunity for meaningful contribution to Engineering department’s business objectives while experiencing personal professional development. This internship will be based in Zagreb, Croatia. The Intern will focus on the Embedded Systems Engineering projects.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Hourly"
      },
      {
        "position": "PCB Layout Engineer Summer Internship",
        "position_desc": "PCB Layout Engineer summer internship at Maxtena is an exciting opportunity to work for a top company in the telecommunication segment. The purpose of the internship is to provide meaningful, professional hands-on experience to students with proven academic performance and leadership potential. Interns will have the opportunity for meaningful contribution to Engineering department’s business objectives while experiencing personal professional development. This internship will be based in Zagreb, Croatia. The Intern will focus on the PCB Layout Engineering projects.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Hourly"
      },
      {
        "position": "RF Engineer Summer Internship",
        "position_desc": "RF Engineer summer internship at Maxtena is an exciting opportunity to work for a top company in the telecommunication segment. The purpose of the internship is to provide meaningful, professional hands-on experience to students with proven academic performance and leadership potential. Interns will have the opportunity for meaningful contribution to Engineering department’s business objectives while experiencing personal professional development. This internship will be based in Zagreb, Croatia. The Intern will focus on the RF Engineering projects.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Hourly rate"
      }
    ]
  },
  "MEĐIMURJE INFORMACIJSKO PROJEKTANTSKI CENTAR D.D.": {
    "page": "WWW.IPC.HR",
    "company_address": "MIHOVLJANSKA 72 , 40000 ČAKOVEC",
    "company_desc": "Najstarija i najveća IT tvrtka u Međimurju, jedna od začetnika IT-a u Hrvatskoj, preko 60 profesionalaca te više od 400 zadovoljnih klijenata, poduzeće IPC Međimurje već 45 godina razvija softverska rješenja ne bi li zadovoljila i najzahtjevnije potrebe svojih kupaca. Osnovna djelatnost je informatički inženjering u izgradnji složenijih poslovnih sustava za naftnu industriju, građevinarstvo, trgovinu, metaloprerađivačku industriju i sektor proizvodnje općenito, komunalne djelatnosti: Poslovni informacijski sustavi (ERP, CRM, BI, DMS)- oko 70 korisnika našeg ERP sustava Maris u prerađivačkoj industriji, građevini i komunalnim djelatnostima (neki od klijenata: Kamgrad d.o.o., GKP Komunalac d.o.o. , Muraplast d.o.o., Novi Feromont d.o.o., EVN Croatia Plin itd. ) Informatizacija benzinskih postaja (vlastita rješenja na oko 600 lokacija, najveći klijent: INA d.d. ) Parkirni sustavi - prisutni smo u više od 80 gradova u regiji Sistemsko i mrežno inženjerstvo/Data centar",
    "jobs": [
      {
        "position": "Maris5 Oracle Apex Portal",
        "position_desc": "Oracle Application Express (APEX) is a low-code development platform that enables you to build stunning, scalable, secure apps with world-class features that can be deployed anywhere. Maris5 je ERP koji je u cijelosti razvijen u našoj tvrtki. Koristi ga oko 70 hrvatskih tvrtki. Planira se obuka kandidata za rad s alatom i potom izrada pilot aplikacije za pregled i ažuriranje određene grupe baznih podataka (npr. Ljudski resursi ili neka druga aplikacija prema prijedlogu kandidata)",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da, prema dogovoru i nakon dovršetka posla"
      },
      {
        "position": "programer Delphi ili .NET ili Android ili drugo, napredne procedure u SQL-u",
        "position_desc": "razvoj informatičkih sustava za upravljanje benzinskim postajama (javnim, internim, sa i bez posade) komercijalno ime sustava je Hektor",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "Da ali samo prema prethodnom dogovoru i nakon dovršetka posla"
      }
    ]
  },
  "MEGATREND POSLOVNA RJEŠENJA": {
    "page": "http://www.megatrend.hr/",
    "company_address": "Bani 75, 10010 Zagreb - Buzin",
    "company_desc": "Megatrend poslovna rješenja informatička je i konzultantska tvrtka koja se bavi razvojem cjelovitih i sveobuhvatnih IT rješenja i usluga. Pouzdan smo savjetnik i partner vodećih hrvatskih tvrtki, ustanova javnog sektora i brojnih malih poduzetnika. Glavna djelatnost tvrtke je implementacija složenih sistemskih, infrastrukturnih i poslovno-informacijskih sustava. Usto, integriramo standardna hardverska i softverska rješenja svih važnijih svjetskih proizvođača. Opseg i razmjer naših poslovnih i informatičkih znanja omogućavaju nam rješavanje problema koje rijetki mogu riješiti. Imamo sva potrebna funkcionalna znanja i vještine i možemo brzo doći u bilo koje mjesto u Hrvatskoj. Naši ljudi vrhunski su stručnjaci, izvanredni poznavatelji industrija u kojima primjenjuju naša rješenja i usluge. To su osobe s liderskim potencijalima, kreativne, potpuno posvećene svojim zadaćama i mogu raditi s ljudima na bilo kojoj razini organizacije. Od svog osnutka, 2004. godine, tvrtka Megatrend poslovna rješenja d.o.o. nalazi se u samom vrhu informatike u Hrvatskoj i jedan je od vodećih sistem integratora. Posebne kompetencije razvili smo u području poslovne inteligencije i IT usluga. Imamo vlastiti podatkovni centar . Usmjereni smo prema specifičnim zahtjevima brojnih korisnika i spremni smo odgovoriti i na najveće izazove današnjeg e-poslovanja. MPR razne izazove s kojima se suočavaju korisnici uspješno rješava VDC uslugom u kojoj se, za razliku od standardnih, uniformnih cloud rješenja, problem rješava posebnom, svakom pojedinom korisniku prilagođenom primjenom infrastrukture kao virtualizirane usluge (ITaaS). U procesu upravljanja i poslovanja primjenjujemo norme ISO9001 i ISO27001. Sjedište tvrtke je u Zagrebu, a poslovna jedinica servisa u Splitu brine za korisnike u priobalnom i dalmatinskom području.",
    "jobs": [
      {
        "position": "Softverski inženjer",
        "position_desc": "Projektni zadaci se odrađuju kroz razvoj web aplikacija za administraciju softverskih servisa i baza podataka te sustava upravljanja u maloprodajnom poslovanju. Korištene tehnologije uključuju JavaScript i TypeScript programske jezike uz korištenje programskih okvira kao što su Node.js i Angular.js te MS SQL i PostgreSQL baze podataka. Opseg projekta obuhvaća izradu aplikativnog rješenja koje uključuje izradu korisničkog sučelja i funkcionalnosti povezanih s radom s bazama podataka te vanjskim web servisima. Projekt je osmišljen kao timski projekt do 3 osobe unutar web development tima i njegovog voditelja. Svu hardversku i softversku infrastrukturu osigurava MPR. Student potpisuje Ugovor o tajnosti podataka kojim se štiti poslovna tajna MPR-a. Moguće je dio prakse odraditi i remotly.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "14.08.2020",
        "compensation": "Putem studentskog servisa. Satnica 25kn."
      }
    ]
  },
  "Memgraph": {
    "page": "http://memgraph.com",
    "company_address": "Memgraph",
    "company_desc": "Memgraph is a fast-growing startup in the rapidly emerging graph database industry. Our cloud-native graph database platform helps companies around the world turn complex data into optimal decisions by solving a class of problems using graph theory. Our commitment to innovation, technological advancement, and developer experience make Memgraph the #1 graph analytic platform that delivers the fastest and easiest solution for solving complex graph data problems in production environments, in a time frame previously unimaginable.",
    "jobs": [
      {
        "position": "Student Engineers for Multiple Projects",
        "position_desc": "PROJECT PLAYGROUND Want to work on COVID-19 spread or find out how food additives are connected to various meals? Find a cool data set, in Memgraph, connect it as a graph with nodes and relationships, and create interesting graph analysis. PROJECT LAB Working with Memgraph through terminal has its own charm, but seeing graphs visually is a whole new level. Lab is our UI Memgraph application where we need your help to improve the views and how graphs are drawn and shown to the user. PROJECT TELCO Build a demo application that shows the true power of Memgraph, graph theory, and graph algorithms for telecommunication process optimizations. PROJECT LIBRARY Developers want to use and connect to Memgraph. To do so, they need a library for their programming language. Build a connection library in various programming languages to help other developers to enter the world of graph databases. PROJECT OVERLORD A lot of different things are happening within Memgraph. Help us build the Overlord, a web admin interface, with a purpose to view and manage internal resources. PROJECT ALFRED Alfred is well known as Bruce Wayne's loyal and tireless butler, housekeeper, and legal guardian. Alfred in Memgraph has a similar purpose. Help us build an internal system that keeps people, systems, and processes in sync. PROJECT WISDOM Imagine a system that gives you a knowledge base from many different sources, contents, topics, and relevant information shared across the company. It is a graph of content, and we need your help to build it. With Memgraph database help Memgraph company. PROJECT ROBIN Memgraph loves developers. Work closely with our CEO and CTO to engage the developer community, share experience and expertise, and interact with other developers. PROJECT TOLKIEN Got an eye for details and understand the importance of explaining things in a simple way? Work on improving our technical documentation and help Memgraph users to learn and solve their problems faster.",
        "n_available": 10,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "What we offer: REMOTE POSITION Due to COVID-19, we have gone fully remote and are expecting to stay remote during the entire course of summer 2020. PAID INTERNSHIP Our interns contribute to the team and put forth their best efforts, it's only fair they're fairly compensated for their work. ABSURDLY FANTASTIC MENTORSHIP Each of our interns is matched with 1 experienced engineer who will closely oversee their work and help you grow as an engineer. WORK THAT SEES THE LIGHT OF DAY Our interns push code, build exciting applications, products, and internal tools."
      }
    ]
  },
  "MICRO-LINK": {
    "page": "http://www.microlink.hr",
    "company_address": "Jaruščica 9a, 10 000 Zagreb",
    "company_desc": "MICRO-LINK d.o.o. je usko specijalizirana tvrtka koja se bavi sistem integracijom u području komunikacija, s užim fokusom na bežične komunikacije, iza nas je 28 godina uspješnog poslovanja te smo dobitnici nagrade Najbolji poslodavac 2019. (3. mjesto u kategoriji malih tvrtki). Orijentacija tvrtke je implementiranje najnovijih i naprednih tehnoloških rješenja iz područja komunikacija, kontinuirano inoviranje, kao i stalno usvajanje novih znanja kako bismo osigurali najvišu razinu stručnog potencijala i time osigurali najveću kvalitetu usluga za naše korisnike. Djelatnost zasnivamo na konceptu pružanja cjelovitih rješenja, objedinjujući široku paletu tehnološki naprednih proizvoda i komunikacijskih rješenja te svih profesionalnih usluga potrebnih za implementaciju. Rješenja koja nudimo su privatne pokretne mreže (TETRA, DMR), javne pokretne mreže, mikrovalni radio sustavi (licencirani mikrovalni sustavi, nelicencirani mikrovalni sustavi, Eband/Vband), UHF/VHF radio modemi, Wi-Fi rješenja, IoT rješenja, mrežna rješenja i sigurnosna rješenja. U MICRO-LINK-u imamo dugogodišnje iskustvo u području telekomunikacija i radijskih komunikacija i ovlašteni smo od Hrvatske regulatorne agencije za mrežne djelatnosti (HAKOM) za obavljanje radijskih mjerenja u elektroničkoj komunikacijskoj mreži, izračun i mjerenja veličina elektromagnetskih polja, mjerenje, ispitivanje i utvrđivanje smetnji u mikrovalnim vezama i za tehnički pregled radijskih postaja, u skladu sa Zakonom o elektroničkim komunikacijama. Pružamo sve profesionalne usluge potrebne za realizaciju kompleksnih komunikacijskih sustava: projektiranje, konzalting, instalaciju i puštanje u rad sustava, mjerenja i optimizacija sustava, održavanje sustava, daljinski nadzor mreža, upravljanje usluge, najam oprema i mreža, upravljanje projektima te edukacija korisnika. Svojim korisnicima osiguravamo optimalno rješenje prilagođeno njihovim potrebama, kompletnu tehničku podršku, dodatnu vrijednost poslovanju te vrhunsku pouzdanost i kvalitetu.",
    "jobs": [
      {
        "position": "Wireless systems engineer",
        "position_desc": "Željeli bismo da student/ica tijekom studentske prakse u MICRO-LINK-u stekne znanje o funkcioniranju radnih procesa unutar organizacije, znanje o provedbi projekata za klijente te znanje o više tehnoloških područja kojima se tvrtka MICRO-LINK, kao sistem integrator komunikacijskih sustava, bavi. Tijekom studentske prakse, student/ica će imati priliku testirati i raditi s opremom vodećih svjetskih proizvođača wireless&telekom opreme, naučiti osnove rada s programom za radio planiranje (ICS telecom, Ekahau Site survey & Planner, RadWin RW Planner), upoznati se s poslovnim procesima i projektnom organizacijom u MICRO-LINK-u, sudjelovati u izradi tehničkog rješenja, sudjelovati u radu na terenu te sudjelovati u konfiguraciji i puštanju sustava u rad. Navedeni period, kao i trajanje studentske prakse u periodu od 6 tjedana je prijedlog, a praksa, sukladno dogovoru, može trajati i kraće.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "25.09.2020",
        "compensation": "Tijekom prakse će se raditi izvještaj s vremenom rada na konkretnim projektima te će se za to vrijeme praksa honorirati."
      }
    ]
  },
  "Mireo d.d.": {
    "page": "http://www.mireo.hr",
    "company_address": "Buzinski prilaz 32 10010 Zagreb",
    "company_desc": "Mireo je hrvatska softverska tvrtka osnovana 2001. Netipični smo u onome što proizvodimo. Ubrajamo se u 5% svjetskih tvrtki koje imaju luksuz razvijanja vlastitih proizvoda i jedni smo od lidera na svjetskom tržištu GPS navigacijskih, telematičkih i geoinformacijskih tehnologija.",
    "jobs": [
      {
        "position": "DevOps engineer",
        "position_desc": "Dizajn i implementacija Continuous Integration sustava Student na ovoj poziciji bi bio zadužen za dizajn i implementaciju Continuous Integration sustava u sklopu naše automotive navigacije. Svrha tog zadatka je automatizacija buildanja (i testiranja) naše platforme za razne operacijske sustave (Android, iOS, Windows). Cilj je napraviti arhivu nightly buildova te detektirati razne greške što je prije moguće u razvojnom procesu. Poželjni skillovi uključuju poznavanja sustava za verzioniranje koda, iskustvo sa skriptiranjem (bash/batch ili Python). Dodatna prednost je poznavanje nekog konkretnog Continuous Integration sustava; u protivnom će se vjerojatno raditi s Jenkinsom. Student će dobiti svu moguću podršku u radu te će u cijelosti biti integrirati u tim programera koji razvija automotive navigaciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Početak prakse - ovisno o studentu, honorirano - da"
      },
      {
        "position": "Software developer",
        "position_desc": "Nadogradnja SpaceTime sustava geometrijskim funkcijama i algoritmima Mireo d.d. je razvio najbržu geometrijsko-prostornu bazu podataka na svijetu, te ju konstantno unaprijeđuje. Jedan od ciljeva je podržati što veći skup standardiziranih geometrijskih funkcija i OpenGIS funkcionalnosti. Cilj ovog zadatka je sustav dodatno unaprijediti implementacijom nekog naprednijeg geometrijskog algoritma prema JTS standardu - konkretno koristeći GEOS Library. U zadatak spadaju implementacija algoritma te testiranje istog, kao i svih srodnih funkcija koje u tom trenu budu implementirane.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "da Praksa može trajati 4-6 tjedana, ovisno o studentu"
      },
      {
        "position": "Software engineer",
        "position_desc": "Izrada poligona dosega elektricnog vozila \"Range anxiety\" je jedan od najvecih problema korisniika elektricnih vozila. Mireo u sklopu svoje automotive navigacije nudii izracun dosega elektricnog vozile temeljem stanja baterije, kartografske podloge, podataka o vremenu i modela ponasanja treniranog za svako vozilo. Vizualizacija dosega ostvarena je prikazom poligona na karti a u sklopu prakse potrebno je razviti algoritam koji ce u stvarnom vremenu kreirati vizualno atraktivan poligon temeljem rijetke mreze tocaka u kojima je dostupna informacija o preostalom dosegu vozila. Algoritam je potrebno implementirati u c++, no prije je potrebno prouciti teoretsku podlogu problema kroz niz clanaka. Studentima cemo pruziti svu mogucu podrsku u radu te cemo ih u cijelosti integrirati u tim programera koji razvija automotive navigaciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "početak prakse - ovisno o studentu honorirano - da"
      }
    ]
  },
  "MOBILISIS": {
    "page": "http://www.mobilisis.hr",
    "company_address": "Varaždinska ulica br. 7, II. odvojak, 42000 Varaždin - Jalkovec",
    "company_desc": "Tvrtka Mobilisis na tržištu je 15 godina te bilježi neprekidan rast prometa i broja zaposlenih. Od samih početaka, sa samo pet zaposlenih i smještajem u Tehnološkom parku Varaždin, narasli smo na 70 zaposlenika, a ujedno se i mnogo toga promijenilo. Mobilisis je tvrtka s jedinstvenom platformom koja ujedinjuje različite tehnologije te razvija segment specijalizirane elektroničke opreme sa značajnim udjelom inovacija, projektiranja i razvoja, namijenjene prvenstveno M2M (Machine-to-Machine) i IoT (Internet of Things) tržištu. Mobilisis se u internetu stvari prepoznao još na samom početku i na neki način je začetnik IoT-a na ovim prostorima, ali i prvi hrvatski startup. U svojoj dugoročnoj strategiji snažno se naslanja na Smart City inicijative, a posebice na inteligentne transportne sisteme. Osnovna djelatnost Mobilisisa je i dalje Fleet management, ali se tehnologije pametnih gradova odlično uklapaju u ukupni cilj razvoja IoT infrastrukture u tvrtki. U Fleet Management dijelu Mobilisis pokriva najveće prijevozničke tvrtke u Hrvatskoj, ali i druge tvrtke s manjim flotama vozila. U dijelu Smart parkinga većina partnera i kupci je iz Europe. Od 2017. godine. tvrtka Sick je strateški partner Mobilisis-a za razvoj i prodaju IIoT rješenja diljem svijeta. Sick je u samom vrhu razvojne industrije te vodeći svjetski proizvođač industrijskih senzora i rješenja. Krajem 2017. godine Mobilisis se preselio u novu poslovnu zgradu koja je dizajnirana i opremljena prema najnovijim trendovima tehnoloških kompanija, open space prostorijama, konferencijskim sobama, modernom kantinom, teretanom i sobama za opuštanje. Poslovni prostor je prilagođen ljudima koji vole opuštenu i ugodnu radnu atmosferu u kojoj rade uspješni, inovativni, kreativni i zadovoljni zaposlenici.",
    "jobs": [
      {
        "position": "Razvoj elektroničkih sklopova- razvojni inženjer (M/Ž)",
        "position_desc": "projektira, razvija i programira embedded sustave i elektroničke sklopove na bazi mikrokontrolera radi na razvoju i programiranju sklopovlja baziranih na GSM (NBIoT) i GPS tehnologijama dokumentira i izrađuje sheme i popratnu projektnu dokumentaciju",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, prema dogovoru."
      }
    ]
  },
  "MONTELEKTRO": {
    "page": "http://www.montelektro.hr",
    "company_address": "Kudeji 53, 51215 Kastav",
    "company_desc": "Montelektro pruža rješenja na polju elektro inženjeringa i automatizacije diljem svijeta i u mnogim industrijskim područjima. Zapošljavamo kvalificirane i iskusne, uglavnom akademski obrazovane inženjere, kako bi pružili brzu i učinkovitu uslugu kupcima diljem svijeta. Cilj tvrtke Montelektro je unaprijediti industrijski proces klijenta, ne samo vezano uz aktualni projekt nego i uz sveukupnu proizvodnju. U Hrvatskoj, Montelektro je prisutan u svim industrijskim područjima te predstavlja pouzdanog i stalnog parnera vodećim kompanijama u proizvodnji hrane, cementa, lijekova, duhana i energije. U inozemstvu, surađujemo s renomiranim dobavljačima procesne opreme u pivovarama, željezarama, industrijama duhana i cementa te farmaceutskoj industriji - na području PLC i HMI programiranja softvera kao i projektima po principu \"ključ u ruke\".",
    "jobs": [
      {
        "position": "Programer sustava za automatizaciju",
        "position_desc": "Tijekom prakse student će, uz pomoć mentora, izraditi PCS (process control system) program za automatizaciju dijela pivovare. Taj projekt je dio treninga koji u Montelektru pohađaju novozaposleni inženjeri za automatizaciju i baziran je na Siemens S7 PLC-ovima i WinCC SCADA sustavu. Predviđeno trajanje prakse je 3 tjedna. Termin je u ljetnim mjesecima, preferabilno druga polovica kolovoza i rujan, ali moguć je dogovor i za ranije. Prilikom odabira studenata za praksu obavljamo psihologijsko testiranje kandidata u prostorijama Montelektra, Marka Marulića 5 - Sveta Nedelja, uz pridržavanje važećih epidemioloških preporuka.",
        "n_available": 5,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "25.09.2020",
        "compensation": "Da"
      }
    ]
  },
  "mStart plus": {
    "page": "www.mstart.hr",
    "company_address": "Slavonska avenija 11a Zagreb",
    "company_desc": "mStart jedan je od vodećih pružatelja tehnoloških usluga u regiji. Partneri smo s vodećim IT vendorima poput SAP, Microsoft, Oraclea, IBM, BMC, i drugim. Naš tim čini više od 340 tehnoloških stručnjaka s znanjem u implementaciji i podršci vodećih svijetskih tehnoloških rješenja za poslovne sustave, temeljeno na suradnji s nekim od najvećih kompanija u regiji. Pružamo usluge razvoja, implementacije, integracije i podrške poslovnih informacijskih sustava i rješenja. Nudimo širok spektar rješenja, od ERP-a, poslovne analitike, poslovnog izvještavnja, infrastrukture pa do vlastitih rješenja za paltni promet te eWallet usluga.",
    "jobs": [
      {
        "position": "BI podrška",
        "position_desc": "- Podrška BI izvještavanju - Hvatanje u koštac s velikom količinom podataka - Obrada i analiza podataka",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima za protekli mjesec."
      },
      {
        "position": "DotNet programer",
        "position_desc": "Želiš li upoznati kako izgleda razvoj modernih web aplikacija i servisa koristeći ASP.NET tehnologije i baze podataka, provedi svoju ljetnu praksu u dinamičnom timu Zainteresirani će imati mogućnost sudjelovati u svakodnevnom radu službe te samostalno rješavati zadatke. Ukoliko te zanimaju ASP.NET tehnologije i baze podataka i želiš svoje znanje produbiti, ljetna praksa je pravi trenutak za to",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Praksa se honorira prema određenim satima za protekli mjesec"
      },
      {
        "position": "Java programer",
        "position_desc": "Ukoliko voliš programirati dođi i upoznaj što naši developeri rade Sudjelovati ćeš u radu razvojnog tima kojem je cilj razvoja i implementaciji postojećih rješenja te izradi novih funkcionalnosti i modula Student će imati mogućnost upoznati se i sa ostalim tehnologijama iz Oracle, ali i drugih portfelja te će imati mogućnost rada na optimizaciji postojećih aplikacija i algoritama s ciljem poboljšanja korisničkog iskustva i poslovnih procesa",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Praksa se honorira prema odrađenim satima za protekli mjesec."
      },
      {
        "position": "Postani DevOps inženjer",
        "position_desc": "- nauči o digitalnoj transformaciji, korištenju machine learninga i deep learning algoritama za prediktivnu analitiku, segmentaciju i grupiranje",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "praksa se honorira prema odrađenim satima za protekli mjesec"
      }
    ]
  },
  "Netgen": {
    "page": "www.netgen.io",
    "company_address": "Savska cesta 182, 10000 Zagreb",
    "company_desc": "NETGEN d.o.o. je poduzeće orijentirano na pružanje usluga izrade složenih web rješenja baziranih na sustavima za upravljanje sadržajima (CMS). Uobičajni profil projekata na kojima radimo su korporativne stranice, medijski i news portali, intranet sustavi, e-commerce rješenja, konferencijske stranice i sl. Tvrtka je osnovana 2002. godine i trenutačno zapošljava 22 stalnih zaposlenika. Tehnologije koje koristimo su eZ Platform CMS, Symfony, PHP, HTML, CSS, Javascript i sl.",
    "jobs": [
      {
        "position": "Backend web developer",
        "position_desc": "Ovisno o epidemiološkoj situaciji, ljetna praksa odvijat će se u potpunosti ili djelomično u našem uredu, a svaki će student imati priliku na praksi provesti minimalno dva tjedna. Nudimo praktičan rad na aktualnim projektima firme pod mentorstvom naših senior developera. Osim stjecanja novih znanja u PHP-u i Symfonyju, dobit ćeš priliku iskusiti što znači rad na projektu u agenciji – kako izgleda suradnja s članovima tima, komunikacija s klijentom, rokovi, zahtjevi i ograničenja pojedinog projekta i sl. Uz prijavu priloži kratki životopis, popis relevantnih projekata ili inicijativa, GitHub/Bitbucket profil ili sl. i (opcionalno) blog i/ili profile na društvenim mrežama. Više o Netgenu saznaj na našim web stranicama, blogu i profilima na društvenim mrežama: Facebook , Twitter , LinkedIn . U dinamičnom okruženju možeš se upoznati s nama i našim načinom rada i steći nova znanja i iskustva, a uz sve to dobiješ određenu naknadu preko student servisa i besplatan ručak svaki dan.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "14.08.2020",
        "compensation": "Tvoje sudjelovanje na ljetnoj praksi honorirat ćemo naknadom preko student-servisa i besplatnim ručkom svaki dan."
      },
      {
        "position": "Frontend web developer",
        "position_desc": "Ovisno o epidemiološkoj situaciji, ljetna praksa odvijat će se djelomično ili potpunosti u našem uredu. Svaki će student imati priliku na praksi provesti minimalno dva tjedna. Nudimo praktičan rad na aktualnim projektima firme pod mentorstvom naših senior developera. Osim stjecanja novih znanja u JavaScriptu, CSS-u i HTML-u, dobit ćeš priliku iskusiti što znači rad na projektu u agenciji – kako izgleda suradnja s članovima tima, komunikacija s klijentom, rokovi, zahtjevi i ograničenja pojedinog projekta i sl. Uz prijavu priloži kratki životopis, popis relevantnih projekata ili inicijativa, GitHub/Bitbucket profil ili sl. i (opcionalno) blog i/ili profile na društvenim mrežama. Više o Netgenu saznaj na našim web stranicama , blogu i profilima na društvenim mrežama: Facebook , Twitter , LinkedIn i Instagram . U dinamičnom okruženju možeš se upoznati s nama i našim načinom rada i steći nova znanja i iskustva, a uz sve to dobiješ određenu naknadu preko student servisa i besplatan ručak svaki dan.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "14.08.2020",
        "compensation": "Tvoje sudjelovanje na ljetnoj praksi honorirat ćemo naknadom preko student-servisa i besplatnim ručkom svaki dan."
      }
    ]
  },
  "Notus IT": {
    "page": "https://www.notus.hr/",
    "company_address": "Savica I. 127, 10 000 Zagreb",
    "company_desc": "Tvrtka Notus je hrvatska IT tvrtka koja razvija i implementira cjelokupna poslovna rješenja kojima transformiramo poslovanje svojih klijenata. Chypka, Badel, Koestlin, Labud Zagreb, Pauza.hr, Carnet, Hrvatske autoceste,... samo su neki od naših klijenata koji su prepoznali kvalitetu našeg portfelja, kojeg čine web i mobilne aplikacije te ERP sustav. Svojim klijentima nudimo vrhunske usluge prilagođene njihovim poslovnim potrebama, kontinuirano pratimo najnovije trendove na IT tržištu te ih implementiramo u svoje poslovanje kako bismo u svakom trenutku bili prvi izbor svojih klijenata. Notusov ključ uspjeha su naši zaposlenici, stoga im osiguravamo ostvarenje punog profesionalnog potencijala kroz stalno obrazovanje i usavršavanje te mogućnost napredovanja.",
    "jobs": [
      {
        "position": "Back-end developer",
        "position_desc": "Razvoj custom poslovnih aplikativnih rješenje je Notusova specijalnost. Imat ćete priliku biti dio razvojnog teama koji slaže cijeli proces jedne aplikacije od analize, dizajna, tehničke specifikacije do faze razvoja i testiranja.. Naša custom rješenja koriste velike Hrvatske tvrtke poput Hrvatskih Autocesta, Pauza.hr, Labuda, Koestlina, Chypka-e i Carneta.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ovisno o iskustvu kandidata moguće je honoriranje rada."
      },
      {
        "position": "Front-end developer",
        "position_desc": "Notus voli lijepa, intuitivna i funkcionalna web rješenja i zato su nam front-end developeri jako bitni. Radimo custom design i custom development od web stranica, web trgovina do kompleksnih web i mobilnih aplikacija. Razvijamo rješenja za velike Hrvatske tvrtke poput Hrvatskih Autocesta, Pauza.hr, Labuda, Koestlina, Chypka-e i Carneta.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ovisno o iskustvu kandidata moguće je honoriranje rada."
      },
      {
        "position": "Python developer",
        "position_desc": "Jedno od aplikativnih rješenja koje Notus razvija je Odoo ERP. ERP je poslovno-informacijski sustav kroz koji tvrtka ima kontrolu nad poslovnim procesima, a Odoo je open-source platforma koju koristimo za razvoj i lokalizaciju. Neki od modula ERP-a su ljudski resursi, CRM, prodaja i računovodstvo. Za razvoj modula i customizaciju ERP-a potrebni su nam Python developeri, a u našem teamu možete naći puno stručnjaka koji će vas rado naučiti svim tajnama zanata.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ovisno o iskustvu kandidata moguće je honoriranje rada."
      }
    ]
  },
  "Perpetuum Mobile": {
    "page": "http://www.perpetuum.hr",
    "company_address": "Perpetuum Mobile d.o.o. Damira Tomljanovića Gavrana 13, Centar Bundek Zagreb",
    "company_desc": "Perpetuum Mobile bavi se razvojem softvera i implementacijom IT rješenja za korisnike iz privatnog i javnog sektora. Među svoje klijente Perpetuum ubraja neke od vodećih kompanija iz financijskog sektora, telekomunikacija, logistike, industrije i drugih, kao i državne institucije, ministarstva i Hrvatski Sabor. Djelatnost poduzeća obuhvaća: - Rješenja za elektroničko poslovanje na platformi Magento - Rješenja za portale i upravljanje web sadržajima na platformi Drupal - Poslovna rješenja - SharePoint i razvoj aplikacija po mjeri - Izgradnja osnovne i napredne informatičke infrastrukture - Upravljanje softverskom imovinom (SAM), prodaja licenčnog softvera, upravljanje projektima",
    "jobs": [
      {
        "position": "Mlađi razvojni inženjer – Drupal",
        "position_desc": "Suradnja u razvoju web content management rješenja zasnovanih na Drupal open source CMS sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja web rješenja, od osmišljavanja i definiranja načina na koji će se potrebe korisnika izraziti u web rješenju, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Moguće, po dogovoru"
      },
      {
        "position": "Mlađi razvojni inženjer – Magento",
        "position_desc": "Suradnja u razvoju rješenja online trgovina („web shop-a“) zasnovanih na Magento open source eCommerce sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja eCommerce rješenja, od osmišljavanja i definiranja načina na koji će se potrebe korisnika izraziti u rješenju, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Moguće, po dogovoru"
      },
      {
        "position": "Pozicija Mlađi razvojni inženjer – ulazak u Microsoft SharePoint svijet",
        "position_desc": "Suradnja u razvoju poslovnih rješenja zasnovanih na .NET platformi i Microsoft SharePoint sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja softverskog rješenja, od osmišljavanja i definiranja načina na koji će se izraziti potrebe korisnika, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Moguće, po dogovoru"
      }
    ]
  },
  "Pet minuta d.o.o. (Five)": {
    "page": "http://www.five.agency",
    "company_address": "Perpetuum Mobile d.o.o. Damira Tomljanovića Gavrana 13, Centar Bundek Zagreb",
    "company_desc": "Perpetuum Mobile bavi se razvojem softvera i implementacijom IT rješenja za korisnike iz privatnog i javnog sektora. Među svoje klijente Perpetuum ubraja neke od vodećih kompanija iz financijskog sektora, telekomunikacija, logistike, industrije i drugih, kao i državne institucije, ministarstva i Hrvatski Sabor. Djelatnost poduzeća obuhvaća: - Rješenja za elektroničko poslovanje na platformi Magento - Rješenja za portale i upravljanje web sadržajima na platformi Drupal - Poslovna rješenja - SharePoint i razvoj aplikacija po mjeri - Izgradnja osnovne i napredne informatičke infrastrukture - Upravljanje softverskom imovinom (SAM), prodaja licenčnog softvera, upravljanje projektima",
    "jobs": [
      {
        "position": "Junior Android Developer",
        "position_desc": "Suradnja u razvoju poslovnih rješenja zasnovanih na .NET platformi i Microsoft SharePoint sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja softverskog rješenja, od osmišljavanja i definiranja načina na koji će se izraziti potrebe korisnika, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Moguće, po dogovoru"
      },
      {
        "position": "Junior React Developer",
        "position_desc": "Suradnja u razvoju poslovnih rješenja zasnovanih na .NET platformi i Microsoft SharePoint sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja softverskog rješenja, od osmišljavanja i definiranja načina na koji će se izraziti potrebe korisnika, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Moguće, po dogovoru"
      }
    ]
  },
  "Pinky-S": {
    "page": "www.pinky-s.com",
    "company_address": "Perpetuum Mobile d.o.o. Damira Tomljanovića Gavrana 13, Centar Bundek Zagreb",
    "company_desc": "Perpetuum Mobile bavi se razvojem softvera i implementacijom IT rješenja za korisnike iz privatnog i javnog sektora. Među svoje klijente Perpetuum ubraja neke od vodećih kompanija iz financijskog sektora, telekomunikacija, logistike, industrije i drugih, kao i državne institucije, ministarstva i Hrvatski Sabor. Djelatnost poduzeća obuhvaća: - Rješenja za elektroničko poslovanje na platformi Magento - Rješenja za portale i upravljanje web sadržajima na platformi Drupal - Poslovna rješenja - SharePoint i razvoj aplikacija po mjeri - Izgradnja osnovne i napredne informatičke infrastrukture - Upravljanje softverskom imovinom (SAM), prodaja licenčnog softvera, upravljanje projektima",
    "jobs": [
      {
        "position": "Visual studio/ Siemens Tia portal programer",
        "position_desc": "Suradnja u razvoju poslovnih rješenja zasnovanih na .NET platformi i Microsoft SharePoint sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja softverskog rješenja, od osmišljavanja i definiranja načina na koji će se izraziti potrebe korisnika, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Moguće, po dogovoru"
      }
    ]
  },
  "Poslovna inteligencija": {
    "page": "www.inteligencija.com",
    "company_address": "Perpetuum Mobile d.o.o. Damira Tomljanovića Gavrana 13, Centar Bundek Zagreb",
    "company_desc": "Perpetuum Mobile bavi se razvojem softvera i implementacijom IT rješenja za korisnike iz privatnog i javnog sektora. Među svoje klijente Perpetuum ubraja neke od vodećih kompanija iz financijskog sektora, telekomunikacija, logistike, industrije i drugih, kao i državne institucije, ministarstva i Hrvatski Sabor. Djelatnost poduzeća obuhvaća: - Rješenja za elektroničko poslovanje na platformi Magento - Rješenja za portale i upravljanje web sadržajima na platformi Drupal - Poslovna rješenja - SharePoint i razvoj aplikacija po mjeri - Izgradnja osnovne i napredne informatičke infrastrukture - Upravljanje softverskom imovinom (SAM), prodaja licenčnog softvera, upravljanje projektima",
    "jobs": [
      {
        "position": "Associate Consultant",
        "position_desc": "Suradnja u razvoju poslovnih rješenja zasnovanih na .NET platformi i Microsoft SharePoint sustavu. Suradnik će sudjelovati u pojedinim fazama ciklusa razvoja softverskog rješenja, od osmišljavanja i definiranja načina na koji će se izraziti potrebe korisnika, do samog razvoja, implementacije i puštanja rješenja u produkciju.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "Moguće, po dogovoru"
      },
      {
        "position": "Junior Software Developer",
        "position_desc": "Nudimo i mogućnost odrađivanja prakse za studente koje više zanima razvoj aplikacija. U naša dva odjela - Data Privacy i Innovations&Development radimo na razvoju vlastitih aplikacija te će studenti imati priliku upoznati što to znači raditi na razvoju web rješenja i alata koji unapređuju i olakšavaju poslovanje brojnim korisnicima u zemlji i svijetu te kako se Machine Learning koristi u tom području. Jedan primjer naših aplikacija je Data Privacy Manager o kojem možete više pročitati na linku: https://dataprivacymanager.net/ Praksa se će, ako to bude potrebno, moći odrađivati i online.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "17.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, nakon završetka praske studenti dobiju honorar"
      }
    ]
  },
  "Privredna banka Zagreb d.d.": {
    "page": "https://www.pbz.hr/",
    "company_address": "Radnička cesta 44, Zagreb",
    "company_desc": "Privredna banka Zagreb d.d. predstavlja jednu od najuspješnijih financijskih institucija u Republici Hrvatskoj. U svome poslovanju smo naslonjeni na inovacije i korištenje konkurentnih tehnologija kako bismo svojim klijentima pružili kvalitetne, sigurne i suvremene usluge. Svojim djelatnicima nudimo priliku za profesionalno usavršavanje i napredovanje kroz rad u dinamičnom okruženju i na izazovnim projektima, a prepoznajemo vrijednosti suradnje sa studentskom populacijom kako bismo studentima pomogli u usvajanju praktičnih stručnih znanja i iskustava. Informacijska i komunikacijska tehnologija Privredne banke Zagreb osigurava tehnološku inovativnost u digitalnom bankarstvu svih članica PBZ grupe i članica međunarodne bankarske grupacije Intesa Sanpaolo. Korporativne vrijednosti koje ugrađujemo u svakodnevno poslovanje u sebi uključuju ne samo poslovni uspjeh, nego i brigu za ljude, okoliš i ukupno poboljšanje kvalitete života zajednice u kojoj djelujemo.",
    "jobs": [
      {
        "position": "Pripravnik/ sistem inženjer za Microsoft tehnologije",
        "position_desc": "održavanje i administracija sustava na Microsoft tehnologiji (serveri, radne stanice, Active Directory, DNS, DHCP, ADFS, Exchange, Sharepoint, OneDrive, Office 365, …), proaktivno praćenje tehnologija i proizvoda, predlaganje novih rješenja i optimizacija postojećih rješenja, sudjelovanje na projektima",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne • termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse • mogućnost udaljenog obavljanja prakse Ostali podaci po ponuđenoj praksi: o vrlo izazovno okruženje: dva data centra, centralno upravljanje s 1000 Win servera i 5000 korisničkih radnih stanica, mail gateway, ATP (Advanced Threat protection), Hybrid povezanost s Office365 i Azure cloudom o razni alati za nadzor (SCOM) o tehnologije: Vmware, Microsoft, Office 365, ATA (Advanced Threat Analytics), AIP (Azure Information Protection) DLP, upravljanje mobilnim uređajima (MDM), AV, mail gateway, SIEM o projekt migracije dokumenata u Office 365, o projekt migracija sa Skype for Business on-prem na Teams online"
      },
      {
        "position": "Pripravnik/ sistem inženjer za sigurnost na Microsoft platformi",
        "position_desc": "Detekcija i analiza malicioznog sadržaja (e- mail i web promet te radne stanice i serveri) s ciljem povećanja sigurnosti informatičkog sustava PBZ grupe – sveobuhvatni pregled sustava za analizu malicioznog koda te eventualno omogućavanje dodatne automatizacija procesa. Administracija se obavlja na mrežnim uređajima i drugim sustavima (mali i web gateway, ATP, AV). Implementacija i kontrola GDPR-a (General Data Protection Regulation) u PBZ-u – analiza postavljenih GDPR zahtjeva te provjera i testiranje implementiranih rješenja s naglaskom na kontrolu curenja podataka (DLP). Administracija se obavlja na mrežnim uređajima i drugim sustavima (mali i web gateway, O365).",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne Termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse Mogućnost udaljenog obavljanja prakse Ostali podaci po ponuđenoj praksi o vrlo izazovno okruženje: dva data centra, mail gateway, ATP (Advanced Threat protection), povezanost s Office365 i Azure cloudom o razni alati za nadzor (SCOM) o tehnologije: Vmware, Microsoft, Office 365, ATA (Advanced Threat Analytics), AIP (Azure Information Protection) DLP, upravljanje mobilnim uređajima (MDM), AV, mail gateway, SIEM o projekt uspostavljanja regionalnog SOC-a (Security Operation Centra)"
      },
      {
        "position": "Pripravnik/ sistem inženjer za virtualizacijske tehnologije i mikroservise",
        "position_desc": "održavanje i administracija sustava za virtualizacijske tehnologije i mikroservise (VMware, Horizon VDI, SCOM nadzor, Azure, OpenShift), proaktivno praćenje tehnologija i proizvoda, predlaganje novih rješenja i optimizacija postojećih rješenja, sudjelovanje na projektima",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne • Termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse • Mogućnost udaljenog obavljanja prakse • Ostali podaci po ponuđenoj praksi: o vrlo izazovno okruženje: dva data centra, centralno upravljanje s 20ak Vmware hostova, novouspostavljeom Horizon VDI okolinom, ADF ili F5 federacijom s drugim tvrtkama u grupaciji, povezanost on-prem i sustava u Azure cloudu o razni alati za nadzor (vOperations, SCOM) o tehnologije: Microsoft, Vmware, Horizon, F5, SCOM o projekt uspostavljanja OpenShift okoline za mikroservise o VSAN projekt"
      },
      {
        "position": "Razvoj i unapređenje aplikacija na Java/Oracle platformi (organizacijski dio Kanali i CRM)",
        "position_desc": "Poslovno područje su krediti u Retailu a sustav na kojem se radi je novi front-end sustav za podršku kreditnom procesu. Sustav osim vlastite aplikacije uključuje IBM BPM komercijali sustav za podršku poslovnim procesima i Exari komercijalni sustav za definiranje, kreiranje i ispis ugovorne dokumentacije. Tehnologije s kojima se radi su Java (programska podrška i aplikacije) , Oracle (baza podataka), servisno orijentirani pristup, višeslojne aplikacije. - Java Spring Frameworka, Spring Web MVC framework - HTML/HTML5, CSS/CSS3, Javascript, jQuery, Javascript design patterns - jQuery UI, Semantic UI - HTTP komunikacijski protokoli (SOAP, JSON i REST) - InteliJ Idea, IBM BPM porodica alata, Exari sustav za generiranje dokumentacije - Oracle SQL, PL/SQL Poslovi uključuju upoznavanje i rad u dinamičkom korporativnom okruženju, interakciju s drugim IT i poslovnim timovima, aktivno sudjelovanje u SDLC (Software Development Life Cycle ) procesu rada.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne - Termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse - Mogućnost udaljenog obavljanja prakse"
      },
      {
        "position": "Sistem inženjer za mrežnu sigurnost",
        "position_desc": "održavanje i instaliranje sustava za zaštitu mreža (vatrozid, IPS, web proxy, VPN access); održavanje i instaliranje sustava za praćenje i upravljanje mrežom (SIEM, syslog, netflow)",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne • Termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse • Mogućnost udaljenog obavljanja prakse • Ostali podaci o ponuđenoj praksi: o vrlo izazovno okruženje: dva data centra, 25+ clustera vatrozida, 250+ routera, 500+ switcheva, IPS sustav, web gateway o razni alati za nadzor (Splunk, PRTG, Tufin) o tehnologije: Cisco, Check Point, McAfee o Cisco ISE, Cisco WiFi sustav, Cisco Prime, NetBrain, Tufin o projekt seljenja data centra u nove prostore"
      },
      {
        "position": "Sistem inženjer za telekomunikacije",
        "position_desc": "održavanje i administracija Cisco mrežnih sustava (routeri, switchevi), te sustava za nadzor mreže, proaktivno praćenje tehnologija i proizvoda vezanih uz mrežne tehnologije, predlaganje novih rješenja i optimizacija postojećih rješenja",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ne • Termini obavljanja i trajanje prakse: prema dogovoru u definiranom vremenskom okviru za obavljanje prakse • Mogućnost udaljenog obavljanja prakse Ostali podaci o ponuđenoj praksi: o vrlo izazovno okruženje: dva data centra, 25+ clustera vatrozida, 250+ routera, 500+ switcheva, IPS sustav, web gateway o razni alati za nadzor (Splunk, PRTG) o tehnologije: Cisco o projekt seljenja data centra u nove prostore o SD-WAN projekt"
      }
    ]
  },
  "RASCO": {
    "page": "www.rasco.hr",
    "company_address": "Kolodvorska 120b, Kalinovac",
    "company_desc": "RASCO je privatna brzorastuća hrvatska kompanija koja se tijekom trideset godina postojanja svrstala među vodeće europske proizvođače opreme za održavanje prometne infrastrukture . Proizvode danas izvozimo u gotovo 40 zemalja svijeta , čime osiguravamo više od 80% našeg prihoda. Investicije u zaposlenike i tehnologiju te prilagodba tržišnim trendovima osiguravaju nam stabilnost i kontinuirana otvaranja novih radnih mjesta. Posao u RASCO-u znači odlične radne uvjete sa suvremenim programima i alatima , priliku za osobni razvoj u izazovnom međunarodnom okruženju, te dinamično i poticajno radno okruženje.",
    "jobs": [
      {
        "position": "Praksa u razvoju upravljačkih sustava",
        "position_desc": "razvoj elektroničkih sustava i programskih rješenja za uređaje i vozila provođenje ispitivanja i testiranja uređaja izrada konstrukcijske i tehnološke dokumentacije",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": ""
      }
    ]
  },
  "Recogno": {
    "page": "https://recogno.co",
    "company_address": "Avenija Dubrovnik 15/12 10020 Zagreb",
    "company_desc": "Recogno is building the future of grocery and convenience stores using machine learning / computer vision enhanced IoT devices. We are a small team of skilled professionals passionate about the next step of technology — bringing technological wonders to end-users, without a need for browsers, applications or, heaven forbid, installing something. We've won the 1st place out of more than 40 applied in the €100k Startup Factory Zagreb acceleration program in the fall of 2017, and we are gradually expanding our team into the full stack — software, electronics, computer vision, data analysis, and user interaction.",
    "jobs": [
      {
        "position": "Computer vision intern",
        "position_desc": "Recogno is building the future of grocery and convenience stores using IoT devices enhanced by machine learning, computer vision, and recommender systems. We are a micro team of skilled professionals passionate about the next step of technology — bringing technological wonders to end-users, without a need for them to use browsers, applications or, heaven forbid, install something. We've won the 1st place out of more than 40 applied in the €100k Startup Factory Zagreb 2017, won 1st place in LEAP Summit 2018, been awarded several research grants by HAMAG-BICRO and similar, and were invited to several European accelerators. We are gradually expanding our team into the full stack — software, electronics, computer vision, data analysis, recommender systems, and user interaction. We are looking for a talented and ambitious computer vision intern that has a track record of building stuff out of curiosity and getting things done. Our new team member will get a tremendous opportunity to grow, help us grow, and have fun along the way. We'll put you into a slingshot Your first professional steps should take you through the entire process, rather than being a bug-squashing cog while others are doing the meaningful stuff. Your internship at Recogno will include: Implementing new functionalities in our computer vision pipeline — utilizing pose estimations, RNNs, LSTMs and similar to achieve goals Active participation in all stages of product creation — working on features through ideation, research, planning, implementation, and testing Applying engineering principles like prioritizing, diverging, Pareto, prototyping and validating Researching and learning new technologies, having a vote in technical decisions Supporting our IoT, Machine Learning, Computer Vision and Recommender Systems efforts Here is a comment from one of our internees: Na praksi sam naučio puno više nego što sam očekivao. Mislim da je velika prednost zaposlenja u malom startupu, u odnosu na rad u velikoj firmi, ta što sam sudjelovao u cijelom procesu izrade novih elemenata . Pod ovim mislim da sam bio prisutan i sudjelovao od samog početka (smišljanje koncepta, komentiranje prednosti i nedostataka i sl.) do kraja (implementacija i testiranje). Na početku je bilo dosta teško dok se nisam snašao, ali za sve teškoće i probleme sam mogao pitati kolege koji su sve nejasnoće razriješili i pomogli (ako je bilo potrebno) oko implementacije. Dosta mi se svidio ovaj način rada i mislim da sam puno više naučio tako nego da sam otišao u neku veću firmu i samo se bavio popravljanjem bugova ili odradom poslova koje nitko ne želi raditi. Have a nice flight The team member we're looking for is choosing their next career step based on the technical challenge, rather than type of coffee, the number of beanbags, or big name of the employer. Regardless, we do want to help you have a nice flight with us: Working on a game-changing machine learning enhanced IoT product Mentorship from the team lead with 10+ years of professional experience in software development Flexible work hours A small, ambitious and young team Nice office in Zagreb Innovation Centre (ZICER), with kitchen, resting spaces and a variety of exercising options nearby (gym, padel, climbing, badminton)",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": ""
      }
    ]
  },
  "Rimac Automobili": {
    "page": "http://www.rimac-automobili.com/",
    "company_address": "Ljubljanska 7, 10431 Sveta Nedjelja",
    "company_desc": "Rimac is a technology powerhouse, manufacturing electric hypercars and providing full technology solutions to global automotive manufacturers. Founded in 2009 with headquarters in Croatia, Rimac started as a garage project and grew into a globally recognized technology leader, built upon the passion and vision of the company's Founder and CEO Mate Rimac. Strongly believing that electric propulsion systems can be used to power the new generation of sports cars and make them better, faster and more exciting, he has started the project with a handful of people as his team. The company’s flagship, the Concept_One, was entirely designed, developed and manufactured in-house. In 2018 Rimac introduced the next generation hypercar, the C_Two, a car alive with technology. Today, the company numbers over 600 people and has grown into a leader within a highly competitive industry with the ambition to become a full electrification partner for many OEMs. Rimac Automobili has challenged the status-quo with the vision to revolutionize and reinvent the sports car with its unique technology thus successfully tackling the electrification challenge set upon the automotive industry. Most of all, we are excited to offer customers the opportunity to use our technology and know-how to create new and exciting products.",
    "jobs": [
      {
        "position": "Backend/Frontend Engineer Intern (m/f)",
        "position_desc": "Our Battery Systems Department is in a need of a brand new software application that will enable them to have a simpler and more powerful way to see, analyze, compare, share and visualize battery test results. To make this happen the Software Department is looking for a Backend and Frontend Intern who will help us create and develop this application. If you are a creative team player who likes to work in a dynamic environment and who is not afraid of challenges, apply and become a part of our Rimac Automobili team! Main responsibilities: Cooperate on building an application that contains of: frontend part (React) supportive backend application (Node.JS) CI/CD pipeline/flow with AWS infrastructure Work with team on gathering relevant requirements Take responsibility and ownership for the platform *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 3,
        "n_prioritized": 3,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "BMS Embedded Hardware Engineer Intern (m/f)",
        "position_desc": "The Battery Management System (BMS) is one of the most important systems in an electric vehicle. It controls the whole battery pack and is responsible for the proper functioning of the battery pack. The BMS is responsible for voltage and temperature measurements of all battery cells, current, isolation and voltage measurements of the battery pack, as well as controlling the pre-charge circuit and all high-voltage relays and contactors. Considering that we at Rimac Automobili develop hardware and software completely in-house, a BMS Hardware Engineer can participate in all the above-mentioned areas that are a part of the BMS system in an electric vehicle. This means that you will have the opportunity to work on BMS Slave, BMS Master, Isolation monitoring device, HV measurement device, Pre-charge circuit and many others, from the initial idea to the final product. This includes research, simulation, schematics, PCB design, assembly and testing. You will join an enthusiastic team of experienced people that are working on state of the art technology in the automotive industry. Some of the projects on which BMS Team is working are the new hypercar from Rimac Automobili – C_Two, Aston Martin’s new hypercar – Valkyrie, Koenigsegg Regera and many other (secret) projects. *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "E/E System Engineer Intern (m/f)",
        "position_desc": "Creating technical requirements based od high level features Creating sub-systems electrical architecture based on technical requirements and mechanical sub-system design (powertrain, chassis, trims, ....) Close cooperation with other sub-system designers Creating component level requirements in electrical architecture domain Creating vehicle electrical architecture based on previous steps Documenting distributed systems architecture using appropriate tools *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "Embedded Software Engineer Intern (m/f)",
        "position_desc": "• Design, development, coding, testing and debugging system software on in-house developed hardware platforms • Developing new and integrating existing application solutions and algorithms • Reviewing code and design • Analyzing and enhancing efficiency, stability and scalability of system resources • Supporting software QA and optimizing performance • Both Real-Time Operating System (RTOS) and “bare metal” programming *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 5,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "Embedded Software Test Engineer Intern (m/f)",
        "position_desc": "As an embedded software test engineer intern you will work with embedded test team testing the software that drives ECUs (electronic control units) of high-performance cars where high hardware quality and reliability are required. You will join one of the most important teams in the development process, the team that is responsible to find all possible bugs and errors in the hardware and software. The embedded testing team plans and executes test cases that link requirements and functionalities (validation tests), performs hardware testing after HW design phase and static and dynamic code analysis on the final code (verification tests), plan and design end-of-line tests (both hardware and software in the loop) and define work instructions for the test execution. As an embedded software test engineer you will participate in: writing and executing validation test cases performing static code analysis writing and executing unit tests for dynamic code analysis writing test software in LabView for end-of-line tests *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "Infotainment Embedded Hardware Engineer Intern (m/f)",
        "position_desc": "Infotainment is a system that provides an interface between the passengers and the vehicle. It is a multiscreen system that allows the users to see different information on the vehicle, configure different parameters of the vehicle, enjoy the multimedia system, navigation, telemetry, and many more features that are part of the future cutting edge technology. Considering that we at Rimac Automobili develop hardware and software completely in-house, an Infotainment Hardware Engineer has the opportunity to participate in all of the above-mentioned areas that are a part of the Infotainment system in a vehicle. This means that you will work on mobile connectivity, Bluetooth and Wi-Fi, display interfacing, cameras, storage devices, high-end application processors and many others, from the initial idea to the final product. In addition, you will do research, simulation, schematics, PCB design, assembly and testing. You will join an enthusiastic team of experienced people who are working with state-of-the-art technology in the automotive industry. Some of the projects on which our Infotainment Team is working are the new hypercar from Rimac Automobili – C_Two, Aston Martin’s new hypercar – Valkyrie, and many other (secret) projects. *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "IVI Software Development Engineer Intern (m/f)",
        "position_desc": "Rimac infotainment software development team is responsible for developing all high-level software that lies between the driver and the car. One part of the team (OS) is responsible for developing our custom version of the Linux operating system, while another part of the team (Apps) develops applications that interact with the cloud, display navigation information, play multimedia, and show the status of the car on a multitude of screens. In any team, your tasks will include: - working on real, cutting edge challenges in automotive - working with other teams on integration with the rest of the vehicle - occasionally working on the vehicle In the OS, your tasks will include: - customization of our Linux distro - integration of various 3rd party libraries - testing and integrating new hardware - developing support for over-the-air update - working on build automation and automated installation of software into the vehicle In the Apps team, your tasks will include: - development of exciting graphical user interfaces for driver’s instrument cluster, central infotainment screen - development of applications for remote control of the vehicle - integration of infotainment applications with other car systems - integration of connected services *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      },
      {
        "position": "Power Electronics Engineer Intern (m/f)",
        "position_desc": "The inverter is a part of the most powerful electric powertrains developed by Rimac Automobili. Its task is to convert the DC voltage from the battery pack to the alternate current necessary to spin the most powerful electric motors. To be able to do that, it needs sophisticated electronics and algorithms that control power switches which must handle hundreds of amps and monitor different parameters. Considering that we at Rimac Automobili are developing hardware and software completely in-house, the Power Electronics Engineer has the opportunity to participate in all of the above-mentioned areas that are a part of the Inverter system in an electric vehicle. This means that you will work on IGBT modules, SIC modules, Gate drivers, current and voltage measurements, diagnostic circuits, processor boards and many others, from the initial idea to the final product. In addition, you will do research, simulation, schematics, PCB design, assembly and testing. You will join an enthusiastic team of experienced people who are working on state-of-the-art technology in the automotive industry. One of the projects on which the Inverter team is working on is the new hypercar from Rimac Automobili – C_Two, and many other (secret) projects. *note: Regarding the circumstances around us, it will be possible to work from home if not from the company. After a successful summer internship, we are interested in making this a real long-term job.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Starting hourly wage is 35 HRK (+ travel expenses), it increases depending on the performance and delivery"
      }
    ]
  },
  "RoMb Technologies": {
    "page": "https://www.linkedin.com/company/romb-technologies/",
    "company_address": "Zagrebački inovacijski centar",
    "company_desc": "RoMb Technologies bavi se razvojem i komercijalizacijom robotičkih tehnologija, s fokusom na industrijske primjene autonomne navigacije. Razvijamo softver koji industrijskim vozilima za prijenos tereta omogućava precizno, brzo i sigurno autonomno gibanje. Tvrtka je osnovana u studenome 2018. kao spin-off FERovog LARICS laboratorija. Smještena je u Zagrebačkom inovacijskom centru (ZICER) na Velesajmu.",
    "jobs": [
      {
        "position": "Hardverska prilagodba mobile robotske platforme",
        "position_desc": "Mobilne robotske platforme Pioneer dvadesetak su godina bile najrasprostranjenije platforme u istraživačkim institucijama diljem svijeta. I danas se razne generacije Pioneer robota mogu sresti na brojnim sveučilištima i istraživačkim institutima. S mehaničke strane, radi se o kvalitetnom i robusnom rješenju, ali ugrađenu računalnu opremu pregazilo je vrijeme. Cilj zadataka u okviru ove pozicije je udahnuti novi život Pioneer P3-DX platformi, kako bi pronašla primjenu u uredskim prostorima ZICERa . Prilagodba sustava napajanja i baterija Pioneer P3-DX kao izvor napajanja koristi tri olovna akumulatora i jednostavan upravljački sklop čija kombinacija uzrokuje sporo vrijeme punjenja i neadekvatnu izlaznu snagu za napajanje modernijih računalnih komponenti. Potrebno je odabrati pogodnu alternativu baterija i BMS-a koji bi osigurali brzo punjenje, upravljanje i nadzor baterijskih ćelija. Također, ovisno o odabiru ostalih komponenti robota, važno je odabrati napajanje koje će osigurati rad novougrađene opreme. Prilagodba pogonskog sustava Potrebno je zamijeniti upravljačke komponente pogonskih motora modernim rješenjem koje omogućuje lagano povezivanje i komunikaciju s ugrađenom računalnom opremom robota. Komunikacija s upravljačkim računalom treba biti temeljena na industrijskim standardima CANOpen ili EtherCAT . Primjer potencijalnih rješenja su sustavi koje nude Maxon i Roboteq . Unapređenje računalne opreme Pioneer P3-DX koristi odavno zastarjelu računalnu platformu koja ne omogućuje istovremeno pokretanje modernih programskih rješenja koja uključuju SLAM i računalni vid. Potrebno je odabrati računalo koje je moguće ugraditi u tijelo robota, uz ograničenje fizičkih dimenzija montaže i podrške od strane napajanja. Također, potrebno je voditi računa o podršci modularnog proširenja mogućnosti robotske platforme, u smislu nadogradnje robotskom rukom, stereo kamerom, LiDAR, ili radarskim rješenjem.",
        "n_available": 3,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, satnica prema dogovoru"
      },
      {
        "position": "Navigacija autonomnog mobilnog robota u uredskoj okolini",
        "position_desc": "Zagrebački inovacijski centar (ZICER) je skup uredskih prostora osnovan od Grada Zagreba u svrhu razvoja inovativnih visokotehnoloških proizvoda. Obzirom da je ZICER velik, ali jednostavno strukturiran prostor koji sadrži urede brojnih firmi (uključujući i RoMb), ideja je napraviti protitip Guidebota, robota koji će posjetitelje voditi do željenog odredišta. Kao robotska platforma za vođenje koristio bi se Pioneer robot. Pioneer je mali robot s diferencijalnim pogonom na dva kotača, idealan za upotrebu u zatvorenom prostoru. U sklopu ove pozicije radilo bi se na unapređenju Guidebot projekta, korištenjem stereo kamere za segmentaciju terena pogodnog za vožnju i GPU procesiranja za izgradnju karte prostora i lokalizaciju. Segmentacija pristupačnog terena korištenjem ZED2 stereo kamere Računalni vid je jedna od najnovijih metoda za percepciju okoline robota. Već sada senzori vida dostižu kvalitete lasera te se koriste za različite primjene u kojima ih gotovo zamjenjuju. Jedna ovakva primjena bila bi detekcija prepreka i segmentacija terena slobodnog za vožnju. Senzor koji bi se koristio u tu svrhu bila bi ZED2 stereo kamera . ZED2 je više senzorska platforma koja pomoću dvije kamere i triangulacije može pružiti trodimenzionalnu percepciju prostora. ZED2 SDK sadrži brojne mogućnosti koje se mogu primijeniti u svrhu navigacije robota. Glavne komponente SDK-a su upravljanje, snimanje i streamanje kamerom, korištenje senzora ugrađenih u kamere, očitanje dubine, praćenje pozicije kamere u 3D prostoru, 3D rekonstrukcija i detekcija objekata. Najvažnija bi komponenta u sklopu ovog rada bila 3D rekonstrukcija koja podržava detekciju ravnina i poda . Svrha bi rada bila integrirati ZED2 kameru na Pioneer robota te koristeći navedene funkcionalnosti, segmentirati teren slobodan za gibanje u uredskoj okolini. Izvođenje SLAM algoritama na CUDA platformi SLAM - simultana lokalizacija i izgradnja karte prostora zahtjevan je zadatak za CPU računala na kojem se pokreće, a posebno na hardveru ugradbenih računala. Potrebno je razmotriti rješenje koje je moguće akcelerirati GPU-om, konkretno na CUDA mogućnostima platforme Nvidia Jetson TX2/Xavier. Potrebno je implementirati neke od postojećih “state-of-the-art” SLAM algoritama u okruženju Robotskog operacijskog sustava na platformi Nvidia Jetson TX2/Xavier. Primjeri postojećih algoritama su Cartographer , ORB-SLAM2 , OpenVSLAM ili vizualna odometrija koja koristi ZED SDK .",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, satnica prema dogovoru"
      },
      {
        "position": "Simulacijska okruženja za razvoj autonomnih robota",
        "position_desc": "Simulacijska okruženja nezamjenjivi su alati pri razvoju robotičkih rješenja jer omogućuju brzo testiranje i debugiranje softvera, bez opasnosti po skupu opremu i okolinu. Zadaci u okviru ove pozicije predviđaju unapređenje i prilagodbu postojećih simulacijskih alata dostupnih u okviru Robotskog operacijskog sustava . Unapređenje 3D simulacijskog okruženja skladišta Postojeće simulacijsko okruženje za Gazebo simulator potrebno je proširiti i prilagoditi kako bi bilo sličnije stvarnim skladištima, uz dovoljno prostora za testiranje višerobotskih scenarija. Nadalje, dio objekata unutar skladišta potrebno je učiniti dinamičkim, kako bi se omogućila interakcija vozila s njima (primjerice podizanje palete). Modele vozila potrebno je unaprijediti podešavanjem fizikalnih parametara (inercije, koeficijenti trenja) te analizom performansi pojedinih rješavača fizike dostupnih unutar Gazeba ( ODE , Bullet , Simbody , Dart ). Naposljetku, izgled modela vozila potrebno je unaprijediti dodavanjem realističnih tekstura . Pri izradi zadatka poželjno je koristiti postojeće komponente javno dostupnih simulacijskih okruženja . 2D simulacijska okolina za ispitivanje koordinacijskih algoritama Prednost Gazeba i V-rep(CoppeliaSim) , kao vrlo popularnih simulatora za robotiku, je u tome što efikasno i vjerno simuliraju kompleksna okruženja i fiziku. S druge strane, takve simulacije vrlo su računski složene . U slučaju potrebe simuliranja više robotskih sustava računska složenost raste te simulacije zahtijevaju sve više vremena. U takvim situacijama korisni su simulatori kojima cilj nije vjernost simulacije, već mogućnost skaliranja kako bi se simulirale veće flote robota. Neki od primjera su ARGoS te Stage . U okviru zadatka, potrebno je istražiti mogućnost simulacije i upravljanja najmanje 10 vozila pomoću ROS sustava. 3D simulacija viličara u skladištu u Unity programskom okruženju Postojeće simulacijsko okruženje u Gazebo simulatoru ima određena ograničenja u simulaciji fizike i realističnom renderiranju. Potrebno je stvoriti simulaciju u Unity programskom okruženju koja sadrži visokoregalno skladište, viličara i njegove senzore, palete, teret, prepreke, ljude i slično. Ostvariti komunikaciju s Robotskim operacijskim sustavom : čitanje i pisanje poruka na ROS teme kojima će se omogućiti učitavanje modela viličara iz .urdf datoteke, čitanje povratne veze i upravljanje vozilom. Preporučuje se korištenje postojećih rješenja za ostvarivanje komunikacije: ROS# biblioteka ( Video ) ili pisanje C# aplikacije u ROS2 okruženju posebno ciljane za Unity ( Upute ).",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, satnica prema dogovoru."
      },
      {
        "position": "Vizualizacijski alati za upravljanje autonomnim robotima",
        "position_desc": "Razvoj, debugiranje i usavršavanje upravljačkih algoritama u robotici nezamislivi su bez alata za vizualiziranje u 3D prostoru ključnih veličina kao što su poze, putanje i senzorska mjerenja. Zadaci u okviru ove pozicije predviđaju razvoj vizualizacijskih alata za planiranje putanje autonomnih vozila. Vizualizacija polinomskih putanja u RViz alatu RViz alat u okviru Robotskog operacijskog sustava posjeduje napredne mogućnosti vizualizacije standardnih ROS poruka, primjerice senzorskih očitanja i navigacijskih veličina . Međutim, poruka nav_msgs/Path predstavlja putanju kao niz diskretnih točaka, što nije prikladno za precizno upravljanje duž glatkih putanja, kakve su potrebne za navigaciju vozila za prijenos tereta (viličara) koji imaju netrivijalnu kinematiku i neholonomska ograničenja. U okviru zadatka potrebno je implementirati vizualizacijski dodatak (“plugin”) za RViz, koji će omogućiti vizualizaciju agv_msgs /PathStamped poruka, koje putanju predstavljaju u polinomskom obliku, kao Beziérove krivulje . Implementaciju je potrebno napraviti u jeziku C++, koristeći Bézier biblioteku . Vizualizacijski alata za prikaz trajektorija kotača vozila složene kinematike Kinematika vozila s više upravljivih kotača omogućuje da se takva vozila kreću po zadanim putanjama s različitim modovima gibanja. Primjerice, kod klasičnog gibanja orijentacija vozila slijedi orijentaciju tangente na putanju, ali u industriji je moguće i gibanje s konstantnom orijentacijom vozila u prostoru te i drugi, kompleksniji, modovi gibanja kako bi se postigla željena manevrabilnost vozila. Unutar tvrtke RoMb Technologies razvili smo C++ biblioteku za planiranje trajektorija prema dobivenim putanjama te upravljanje vozilima. U okviru zadatka potrebno je razviti alat u Qt razvojnoj okolini za vizualizaciju isplanirane trajektorije vozila i pojedinih kotača vozila duž putanje u svrhu introspekcije planiranja upravljanja te ispravnosti samih putanja.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da, satnica prema dogovoru"
      }
    ]
  },
  "Sartura": {
    "page": "http://www.sartura.hr/",
    "company_address": "Savska cesta 32/11 10000 Zagreb Hrvatska",
    "company_desc": "Sartura surađuje s tvrtkama iz različitih sektora u razvoju aplikacija i komponenti za embedded Linux distribucije te iste integrira u finalne proizvode. Tvrtka je uključena u razne Open Source projekte i industriju kroz doprinos kodu, konzultacijske i edukacijske usluge te sudjelovanjem na svjetski poznatim konferencijama o embedded tehnologijama. Kroz međunarodne projekte surađujemo sa startup tvrtkama i svjetski poznatim brendovima.",
    "jobs": [
      {
        "position": "AI/ML C++ developer",
        "position_desc": "Rad na R&D projektu koji uključuje razvoj rješenja iz područja AI i ML u mrežnom okruženju za ugradbene sustave. U razvoju je predviđeno korištenje platformi/biblioteka poput TensorFlow, Caffe i Coral.ai, kao i sličnih alata namijenjenih integraciji AI i ML rješenja. Trajanje i točno vrijeme početak i završetka stručne prakse je fleksibilno.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "15.09.2020",
        "compensation": "Da"
      },
      {
        "position": "C developer",
        "position_desc": "Razvoj rješenja za udaljeno upravljanje uređajima i različitih userspace aplikacija u mrežnom okruženju za ugradbene sustave, kao i programa za automatsko konfiguriranje uređaja. Trajanje i točno vrijeme početak i završetka stručne prakse je fleksibilno.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "15.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Frontend developer",
        "position_desc": "Rad s web tehnologijama - Vue, webpack, Quassar, ES6. Rad na frontend aplikacijama za upravljanje ugrađenim sustavima i cloud komponentama. Trajanje i točno vrijeme početak i završetka stručne prakse je fleksibilno.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "15.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Go developer",
        "position_desc": "Rad na sustavu za udaljeno upravljanje uređajima. Rad na razvijanju programskih podrški za ugradbene uređaje. Nadogradnja i održavanje postojeće programske potpore pisane u Go jeziku. Trajanje i točno vrijeme početak i završetka stručne prakse je fleksibilno.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "15.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Linux system administrator",
        "position_desc": "Postavljanje mrežne infrastrukture za telekom. Testiranje telekom infrastrukture. Rad s virtualizacijskim tehnologijama u Linux okruženjima (kontejnerske tehnologije, virtualni switchevi, mrezni kontroleri). Postavljanje vatrozida (firewall), rad na software defined LAN i WAN (SD-LAN i SD-WAN) tehnologijama. Rad na sustavima za automatizaciju proizvodnih procesa. Trajanje i točno vrijeme početak i završetka stručne prakse je fleksibilno",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "15.09.2020",
        "compensation": "Da"
      }
    ]
  },
  "S.C.A.N.": {
    "page": "http://www.scan.hr/",
    "company_address": "Buzinski prilaz 38, 10010 Zagreb",
    "company_desc": "S.C.A.N. d.o.o. je sistem integrator na području instrumentacije i sustava upravljanja, specijaliziran za pružanje rješenja u području instrumentacije i procesnog upravljanja. Naše djelatnosti obuhvaćaju konzultantske usluge, projektiranje, integraciju sustava, proizvodnju upravljačkih panela i skid jedinica, puštanje u rad, održavanje instrumentacije i sustava upravljanja te tehničku podršku našim klijentima. Tvrtka je u privatnom vlasništvu, osnovana u Hrvatskoj 1992. god. koja danas broji 120 zaposlenika, s više od 60 inženjera.",
    "jobs": [
      {
        "position": "inženjer za sustave upravljanja u procesnoj industriji",
        "position_desc": "Inženjer za sustave upravljanja sudjeluje u izvođenju projekata sustava nadzora i upravljanja na poslovima: definiranja podloga s korisnikom, izrade projektne dokumentacije, specifikacije opreme, izrade aplikacijskog softvera, instalacije i ispitivanja sustava upravljanja te puštanja u rad Studentska praksa za predmetnu poziciju odvijala bi se u tri faze: projektiranje upravljačkih sustava u procesnoj industriji, odabir upravljačkih sustava prema namjeni i zahtjevima procesa upoznavanje sa sustavima upravljanja (SCADA, PLC te DCS sustavi), instalacija novih sustava, inicijalno podešavanje i parametriranje, programiranje nadzorno-upravljačkog dijela tvorničko ispitivanje Sve gore navedene aktivnosti odvijati će se isključivo u prostorijama naše firme. Napomena: Virtualno odrađivanje prakse nažalost nije moguće zbog prirode posla.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "24.07.2020",
        "compensation": "Praksa se honorira putem studentskoga ugovora sukladno odrađenim satima"
      }
    ]
  },
  "Sedam IT": {
    "page": "www.sedamit.hr",
    "company_address": "Koledovčina 2, 10 000 Zagreb",
    "company_desc": "Sedam IT je jedan od vodećih hrvatskih pružatelja informatičko-komunikacijskih rješenja i usluga. Optimizacijom poslovnih procesa i podrškom u odlučivanju i upravljanju omogućavamo korisnicima ostvarenje poslovnih ciljeva i povrat uloženih sredstava. Naš portfelj rješenja pokriva cjelokupne ICT potrebe poduzeća: od infrastrukture i optimizacije do rješenja za razvoj poslovanja. Posebno ističemo naša vlastita rješenja , razvijena za postizanje specifičnih ciljeva klijenata. Prema analizi nezavisne analitičke kuće IDC Adriatics, rješenje Sedam CRM vodeći je CRM sustav u Hrvatskoj sa tržišnim djelom većim 28 posto, dok smo jedna od dvije hrvatske tvrtke uvrštene u TOP 500 tehnološki najbrže rastućih tvrtki u EMEA regiji. Naše znanje i stručnost osiguravaju razvoj tvrtke. Odnos razvoja i ulaganja u Sedam IT je obostran. Održavamo izvrsnost, ulažemo u kreativne oblike stjecanja znanja i vještina i ostvarujemo inovativnost koja nas čini prepoznatljivima. Jedinstvenost naših pojedinaca osnažuje zajednicu Sedam IT. Vodeći se tendencijom kontinuiranog ulaganja u naše stručnjake, tržištu pružamo specijalizirana znanja koja pokreću gospodarstvo. Organizacijska kultura se obično definira kao složeni skup vrijednosti, uvjerenja, pretpostavki i simbola koji određuju način na koji se u kompaniji obavlja poslovanje. Stvaraju je zaposlenici sa svojim vrijednostima i uvjerenjima. To je primjer zajedničkih vrijednosti i uvjerenja koji pomaže pojedincima da razumiju funkcioniranje organizacije i na taj način im pruža norme ponašanja u organizaciji. Osjećaji svakog zaposlenika u organizaciji stvaraju organizacijsku kulturu organizacije. Za nas je organizacijska kultura živjeti, razvijati i širiti vrijednosti: odgovornosti, slobode, povjerenja, kvalitete, suradnje i inovativnosti.",
    "jobs": [
      {
        "position": "Baza znanja",
        "position_desc": "Istražiti opcije dostupnih rješenja baza znanja i njihove mogućnosti integracije s AI, odnosno neuronskom mrežom u svrhu prikupljanja i obrade podataka.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "DA"
      },
      {
        "position": "Centralizirani nadzor IoT (Internet of Things) mreža",
        "position_desc": "IoT (Internet of Things) mreže postaju sve prisutnije i kompleksnije. Paralelno s rastom broja IoT uređaja raste i količina sigurnosnih prijetnjih na mreži. IoT uređajima se većinom upravlja IoT platformom te tu vidim priliku da preko jedne centralne točke nadziremo stanje svih IoT uređaja te samim time unaprijedimo sigurnost mreže. U ovom zadatku od tebe očekujemo da proučiš i savladaš osnovne mogućnosti IoT platformi poput Amazon Web Services (AWS) i/ili Hass.io te u suradnji s mentorom istražiš relevatne podatke za nadzor te testiraš njihovo prikupljanje koristeći programski jezik Python.",
        "n_available": 4,
        "n_prioritized": 0,
        "start": "01.08.2020",
        "end": "30.09.2020",
        "compensation": "DA"
      },
      {
        "position": "Istraživanje i usporedba IIoT platformi obzirom na mogućnost zaprimanja, pohrane i obrade podataka",
        "position_desc": "Usporediti više IIoT platformi prema mogućnosti: * zaprimanja podataka, * modeliranja i spremanja podataka, * transformacije i čišćenja podataka, * analize podataka (algoritmi). Podaci su primarno vezani za mjerenje električnih veličina.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "DA"
      },
      {
        "position": "Marketing kampanje - editor za kreiranje newslettera",
        "position_desc": "Istražiti razne editore koji omogućuju kreiranje HTML sadržaja, usporediti njihove mogućnosti.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "DA"
      },
      {
        "position": "Mogućnosti integracije Mailchimp servisa sa CRM-om",
        "position_desc": "Istražiti Mailchimp API, vidjeti u kojim segmentima je moguća integracija, koji bi time procesi bili podržani u CRM-u i na koji način.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "DA"
      },
      {
        "position": "Poslovna analiza na temu unaprjeđenja procesa zapošljavanja u Sedam IT-u",
        "position_desc": "U sklopu studentske prakse ćeš na stvarnom primjeru iz prakse proći kroz proces poslovne analize do faze implementacije rješenja te raditi kao veza između korisnika i razvojnog tima. Cilj je unaprijediti i olakšati proces zapošljavanja u Sedam IT-u implementacijom sustava/alata koji bi omogućio prikupljanje, organizaciju, strukturirano prikazivanje i analizu svih relevantnih podataka o osobama koje se prijavljuju za posao u Sedam IT-u.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.08.2020",
        "compensation": "DA"
      },
      {
        "position": "Umjetna inteligencija u adaptivnom učenju",
        "position_desc": "U sklopu studentske prakse tražimo dva studenta/ice koji će raditi na izradi klasifikatora za mehanizam adaptivnog učenja na temelju obrade ulaznih podataka o točnosti i redoslijedu rješavanja određenih zadataka. Tijekom ove prakse student/ica će se moći upoznati sa svim dijelovima kreiranja klasifikatora, od prikupljanja uzoraka, pripreme podataka, korištenja algoritama strojnog učenja, do izrade i provjere modela, kao i s alatom TensorFlow. Ključne riječi: umjetna inteligencija, adaptivno učenje, duboke neuronske mreže",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "DA"
      }
    ]
  },
  "SEDMI ODJEL": {
    "page": "https://www.sedmiodjel.com/",
    "company_address": "Sjedište: ČREŠNJEVEC 68A 10 000 ZAGREB Adresa ureda: ŠTEFANOVEČKA CESTA 10/7 10 000 ZAGREB",
    "company_desc": "Informacije dostupne na https ://www.sedmiodjel.com/",
    "jobs": [
      {
        "position": "DevOps Stručnjak",
        "position_desc": "CICD (Continuous Integration/Continuous Delivery) Implementacija Razvoj procesa za automatizaciju instalacije i nadogradnje softwarea koristeći neki od AWS automatizacijskih alata Kandidat se uključuje u dnevno poslovanje tvrtke i tekuće projekte. Stječe znanje i uvid u projektnu organizaciju kao i u operativno poslovanje u djelu održavanja usluga prema vanjskim korisnicima kao i podršku internim poslovnim procesima.Udaljeni rad je moguć i poželjan. Postoji mogućnost stjecanja nekog od najprestižnijih AWS Cloud Certifikata",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "DA"
      },
      {
        "position": "Stručnjak za IT Infrastrukturu, operativne sustave i virtualizacijske tehnologije",
        "position_desc": "Virtualizacijske platforme - razvoj, implementacija i održavanje Razvoj procesa i alata za automatizaciju instalacije virtualnih poslužitelja, njihov nadzor, praćenje kvalitete i održavanje. Kandidat se uključuje u dnevno poslovanje tvrtke i tekuće projekte. Stječe znanje i uvid u projektnu organizaciju kao i u operativno poslovanje u djelu održavanja usluga prema vanjskim korisnicima kao i podršku internim poslovnim procesima. Udaljeni rad je moguć i poželjan. Postoji mogućnost stjecanja nekog od najprestižnijih AWS Cloud Certifikata",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "DA"
      }
    ]
  },
  "SevenofNine d.o.o. (Shape)": {
    "page": "https://www.404.agency/hr/shape/",
    "company_address": "Radnička cesta 37a,10000 Zagreb",
    "company_desc": "Shape 404 je tvrtka posvećena razvoju visoko kvalitetnih mobilnih i web aplikacija, te s digitalnom i PR agencijom 404 činimo Grupu 404 koja danas broji preko 120 zaposlenih. Proizvode stvaramo na temelju sjajnih ali izvedivih ideja, a naše timove vode neki od najboljih stručnjaka na tržištu. Razvijamo mobilne aplikacije za Hrvatsko i svjetsko tržište, a među našim klijentima su Erste banka, Hrvatski Telekom, Croatia osiguranje, Valamar i brojni drugi. “Ljudi su osnova svega” za nas nije samo fraza već način na koji funkcioniramo, što pokazujemo stalnim ulaganjem u naše zaposlenike kroz mentorske programe, interne i eksterne edukacije, te razne radionice i treninge. Također, iznimno cijenimo timski rad. Očekuje te opuštena radna atmosfera i pomoć kad god ti zatreba. Baci oko na našu najnoviju aplikaciju KEKS pay by Erste.",
    "jobs": [
      {
        "position": "Android developer",
        "position_desc": "Rad na razvoju nativne Android mobilne aplikacije. Praktikant će raditi kao dio tima, uz podršku mentora na razvoju dijela aplikacije. Zadatak će se sastojati od jedne funkcionalne cjeline aplikacije koju će trebati implementirati prema specifikaciji a u skladu s zadanim grafičkim dizajnom. Za razvoj će se koristiti Kotlin. Praktikant će dobiti na korištenje MacBook računalo.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Praksa se honorira po dovršetku projekta"
      },
      {
        "position": "Back-end developer",
        "position_desc": "Rad na implementaciji Back-end servisa. Praktikant će implementirati mikro servis u sklopu servera namjenjenog za Fintech usluge. Mikro servis će biti implementiran prema zadanoj funkcionalnoj specifikaciji u programskom jeziku Go. Praktikant će u radu imati podršku mentora. Praktikant će dobiti na korištenje laptop računalo.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Praksa će biti honorirana po završetku projekta"
      },
      {
        "position": "Front-end developer",
        "position_desc": "Kao naš praktikant, razvijati ćeš front-end internet aplikacije. Implementirati ćeš naš dizajn u funkcionalna, interaktivna web sučelja. Rad na razvoju client-side Web aplikacija za najveće hrvatske i međunarodne kompanije. Praktikant će raditi kao dio tima, uz podršku mentora na razvoju dijela aplikacije. Zadatak će biti pisanje testabilnog i skalabilnog koda koji će iz zadanog grafičkog dizajna, a spajajući se na naše back-end servise, proizvesti responzivna web sučelja. Za razvoj će se koristiti HTML5, SCSS, Webpack, JS-ES6, Nuxt i VueJS. Praktikant će dobiti na korištenje Macbook računalo.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Praksa će biti honorirana po završetku projekta"
      },
      {
        "position": "iOS Developer",
        "position_desc": "Rad na razvoju nativne iOS mobilne aplikacije. Praktikant će raditi kao dio tima, uz podršku mentora na razvoju dijela aplikacije. Zadatak će se sastojati od jedne funkcionalne cjeline aplikacije koju će trebati implementirati prema specifikaciji a u skladu sa zadanim grafičkim dizajnom. Za razvoj će se koristiti Swift. Praktikant će dobiti na korištenje Macbook računalo.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "31.07.2020",
        "compensation": "Praksa se honorira po dovršetku projekta"
      }
    ]
  },
  "Span": {
    "page": "span.hr",
    "company_address": "Koturaška 47, 10000 Zagreb",
    "company_desc": "S timom od preko 80 developera spadamo u vodeće hrvatske izvoznike softvera. Aplikacije koje razvijamo radimo za poznate Enterprise korisnike. Na hrvatskom tržištu prisutni smo od 1993. godine. Naši uspješno završeni i isporučeni projekti u Hrvatskoj, ali i u zemljama istočne i zapadne Europe, Azije i SAD - a, potvrđuju da smo tvrtka koja je svojom višegodišnjom praksom postigla tehnološku izvrsnost. Imamo vrhunske stručnjake osposobljene za sve potrebne ekspertize i potpuno posvećene razvoju softvera te servisnoj i sistemskoj integraciji. Naše aplikacije dnevno koristi preko 300.000 korisnika (ukupno preko 2 milijuna korisnika) na svim kontinentima. Dosta ti je rutinskog kodiranja? Fali ti izazova i želiš isprobati nove tehnologije? Misliš da možeš još više? Dođi i ostvari svoj puni potencijal kao Spanov developer!",
    "jobs": [
      {
        "position": "Junior Developer (m/f) – IDM Notifier",
        "position_desc": "Opis teme: Izrada alata za konfiguriranje i slanje notifikacija u sklopu rješenja za upravljanje digitalnim identitetima Korisničko sučelje za konfiguriranje i praćenje odrađenih zadataka Servis za slanje notifikacija prema predlošcima Upoznavanje pravih komercijalnih alata za upravljanje digitalnim identitetima (korisničkim računima) Microsoft Identity Manager Microsoft Active Directory Users and Computers Sudjelovanje na projektima sa svrhom korištenja u stvarnom, produkcijskom okruženju Planiranje, izrada i praćenje projekta kroz sve faze projektnog ciklusa (Azure DevOps) Sudjelovanje na razvoju u timu NAPOMENA : Termin prakse je određen okvirno, postoji mogućnost dogovora. Također, postoji mogućnost nastavka suradnje i nakon završene prakse.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "31.07.2020",
        "compensation": "Da, po dogovoru."
      },
      {
        "position": "Junior Developer (m/f) - Izrada i integracija web servisa",
        "position_desc": "Opis teme: Izrada i integracija web servisa specifikacija sustava izrada REST API-ja izrada SQL baze podataka end-to-end testiranje sustava dokumentacija Studenti će: dobiti početno iskustvo u developmentu za enterprise sustave proširiti vještine vezane uz backend development proći kroz kompletan Software Development Life-Cycle steći iskustvo rada u velikoj i priznatoj hrvatskoj IT kompaniji NAPOMENA: Termin prakse je određen okvirno, postoji mogućnost dogovora. Također, postoji mogućnost nastavka suradnje i nakon završene prakse.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "24.07.2020",
        "compensation": "Da, po dogovoru."
      },
      {
        "position": "Junior Developer (m/f) - Platforms Development",
        "position_desc": "razvoj poslovnih web aplikacija i proizvoda u Microsoft tehnologijama uključujući Microsoft Azure platformu Tim usko surađuje s dediciranim poslovnim analitičarima i QA inženjerima, a imamo uspostavljen i ALM proces s visokim stupnjem automatizacije u djelu builda, deploymenta i testiranja Sudjelovanje na projektima sa svrhom korištenja u stvarnom, produkcijskom okruženju Planiranje, izrada i praćenje projekta kroz sve faze projektnog ciklusa (Azure DevOps) Sudjelovanje na razvoju u timu Rad unutar uhodanog tima developera NAPOMENA : Termin prakse je određen okvirno, postoji mogućnost dogovora. Također, postoji mogućnost nastavka suradnje i nakon završene prakse.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "10.08.2020",
        "end": "11.09.2020",
        "compensation": "Da, po dogovoru."
      },
      {
        "position": "Junior Developer (m/f) - Product Development",
        "position_desc": "Backend development Design patterns u praksi i implementacija u C# i NET Core frameworku Facade pattern u praksi Inversion of control & Dependency injection u praksi koristeći Autofac Command Pattern u praksi Poznavanje C#, .NET Core frameworka (osnove), Visual Studio IDE Database development Data streaming, transformation & analytics Apache Kafka Osnove Kafka streaming platforme Osnove transformacije podataka u Kafki uz KSQL Implementacija custom transformation modules u Kafki Osnove SQL language, poznavanje Java (osnove), JetBrains IDE Frontend development Mikroservisna arhitektura u frontend developmentu Web komponente koristeći Angular & React Načini i pravila u developmentu nezavisnih web komponenti Integracija nezavisnih web komponenti Poznavanje Typescripta, Javascripta, HTML-a, osnove CSS-a, Visual Studio Code IDE NAPOMENA : Termin prakse je određen okvirno, postoji mogućnost dogovora. Također, postoji mogućnost nastavka suradnje i nakon završene prakse.",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "10.08.2020",
        "end": "11.09.2020",
        "compensation": "Po dogovoru"
      }
    ]
  },
  "STORM Computers": {
    "page": "https://www.storm.hr/",
    "company_address": "Savica I. 127, 10 000 Zagreb",
    "company_desc": "Tvrtka STORM Computers je jedna od vodećih hrvatskih tvrtki u području razvoja, implementacije te održavanja kompleksnih i cjelovitih poslovnih informacijsko-komunikacijskih sustava. Svojim korisnicima nudimo vrhunske usluge i tehnologije kroz partnerstva s vodećim svjetskim tvrtkama, kontinuirano pratimo najnovije trendove na IT tržištu te ih implementiramo u svoje poslovanje što dokazuje i činjenica da smo ponosni dobitnici prestižne nagrade European Business Awards u kategoriji inovativnosti. Smatramo da su za naš uspjeh najzaslužniji naši zaposlenici, stoga im osiguravamo ostvarenje punog profesionalnog potencijala kroz stalno obrazovanje i usavršavanje te mogućnost napredovanja. Tvrtka je članica STORM Grupe , koja je na hrvatskom i regionalnom tržištu, prepoznata kao vodeći sistem integrator. Nastupajući na tržištu, zajedno s ostalim članicama Grupe, nudimo zaokruženu i potpunu uslugu po principu „ključ u ruke“ prepoznajući inovativne potrebe i specifične zahtjeve poslovnih partnera i korisnika, te smo do sada uspješno odradili više od 1.500 projekata.",
    "jobs": [
      {
        "position": "Praktikant u mrežnom odjelu",
        "position_desc": "Praktikant u mrežnom odjelu imat će priliku raditi s našim stručnjacima koji će im omogućiti bolje upoznavanje s projektiranjem, izgradnjom i održavanjem računalno-komunikacijskih mreža . Uz savjete naših kolega stručnjaka, praktikanti će moći i aktivno sudjelovati u fazama gorenavedenih procesa.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": ""
      },
      {
        "position": "Praktikant u odjelu ICT podrške",
        "position_desc": "Praktikant u odjelu ICT podrške imat će priliku raditi s našim stručnjacima koji će im omogućiti bolje upoznavanje s hardware poslužiteljskom i perifernom opremom. Naši kolege praktikante će i detaljno upoznati s procesima instalacije i održavanjem nove i instalirane IT opreme.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": ""
      },
      {
        "position": "Praktikant u sigurnosnom odjelu",
        "position_desc": "Praktikant u sigurnosnom odjelu imat će priliku raditi s našim stručnjacima koji će im omogućiti bolje upoznavanje s projektiranjem, izgradnjom i održavanjem sigurnosnih rješenja u integratorskoj okolini. Uz savjete naših kolega stručnjaka, praktikanti će moći i aktivno sudjelovati u fazama gorenavedenih procesa.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": ""
      }
    ]
  },
  "Stype CS": {
    "page": "http://www.stype.tv/",
    "company_address": "Slavonska avenija 3b, 10000 Zagreb",
    "company_desc": "STYPE je trenutno vodeći proizvođač opreme i softvera za proširenu stvarnost za primjenu u TV kućama. Naši uređaji su na glasu kao najbolji na svijetu za područje kojemu su namijenjeni - tracking kamera u studiju. Osmišljavamo i razvijamo vlastite proizvode, koje potom i proizvodimo te tako kontroliramo svaki detalj proizvoda - elektroniku, matematička rješenja, software za računalni vid, mehaničke komponente, te korisničko sučelje. Za svoj rad osvojili smo Emmy award, a BBC, FOX, CNN, te filmski studiji u Hollywood-u samo su neki od klijenata će imati priliku koristiti uređaje koje razvijete s nama. U potrazi smo za: 1) Programerima koji će razvijati i usavršavati algoritme za praćenje položaja kamere korištenjem Structure from Motion (SfM) tehnika, u jeziku C++. 2) Vrsnim inženjerima elektronike ili onima za koje procjenimo da imaju potencijal da uz nas to postanu Nudimo vam fleksibilno radno vrijeme, opuštenu atmosferu, a najboljima nudimo priliku za stalno zaposlenje i razvoj karijere u STYPE-u.",
    "jobs": [
      {
        "position": "EMBEDDED PROGRAMER / RAZVOJNI INŽENJER ELEKTRONIKE",
        "position_desc": "Tražimo zaljubljenika u elektroniku za ljetnu praksu na sljedećim poslovima: razvoj firmware-a za mikrokontrolere ili FPGA, ovisno o preferenciji razvoj ugradbenih računalnih sustava (embedded systems) dizajn i razvoj analognih i digitalnih sklopova Što nudimo: najboljima nudimo i mogućnost stalnog zaposlenja",
        "n_available": 1,
        "n_prioritized": 3,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "50 kn/sat. Dodatno: jednokratna stipendija u iznosu od 10.000 kn po završetku ljetne prakse."
      }
    ]
  },
  "Styria Digital Development": {
    "page": "http://www.styria.com; http://www.publitzer.hr; http://www.24sata.hr; http://www.vecernji.hr; http://www.poslovni.hr ",
    "company_address": "Oreškovićeva 3D, 10010 Zagreb",
    "company_desc": "Styria Digital Development broji preko 30 zaposlenih koji rade na razvoju web portala i aplikacija i podijeljen je u multidisciplinarne timove sastavljene od voditelja projekata, back-end developera, front-end developera, mobile developera, UX/UI dizajnera, SEO/SEM specijalista i quality assurance specijalista. U našim timovima rade stručnjaci svih profila – od juniora koji su svoje prve korake u digitalnom segmentu napravili upravo u Styriji, do seniora koji su svojim bogatim iskustvom postavili neke od najposjećenijih portala, a danas svoje znanje prenose na mlađe kolege. Dio smo Styria Media Group koja je u Hrvatskoj vlasnik dnevnih novina 24sata, Večernji list i Poslovni dnevnik, a uz bok tiskanim izdanjima stoje Styrijini digitalni projekti - news portali 24sata.hr , vecernji.hr , i poslovni.hr , najposjećeniji hrvatski internetski oglasnik njuskalo .hr, specijalizirani portali ordinacija.hr , diva.hr, living.hr, miss7.hr , miss7mama .hr, miss7zdrava.hr, gastro.hr , goal .com, express.hr , autostart.hr , joomboos.hr i agrobiz.hr . Svaki od njih zauzima vodeću poziciju u svom segmentu, a Styrijini portali mjesečno dosegnu i do 2,15 milijuna čitatelja odnosno 81,2 posto korisnika interneta u Hrvatskoj (gemiusaudience). Radimo na najvećim portalima u regiji i šire . Potičemo napredak uz mentoriranje i razrađene razvojne planove u svrhu brušenja developerskih vještina i povećanja znanja. Razina znanja se procjenjuje kroz strukturirani proces evaluacije , na osnovi kojeg za svakog zaposlenika pripremamo individualni razvojni plan . Na osnovi ispunjenja razvojnih planova omogućena je promjena plaće kao i prelasci na sljedeću razinu znanja . Nekoliko stvari nam je posebno bitno. Jedna je da uz rad učimo i razvijamo se, a druga da smo na poslu zadovoljni! Da bismo učili i razvijali se, veliku pažnju posvećujemo mentoriranju , počevši od onboardinga novih članova tima, a nastavljamo kroz kontinuirani mentoring svakog zaposlenika ovisno o njegovim razvojnim potrebama. Uobičajen je odlazak na konferenciju izvan Hrvatske jednom godišnje, a za domaće nemamo neko ograničenje. Jako nam je bitno i da radimo na kvalitetnoj opremi, a laptop i mobitel su nam na raspolaganju i za privatno korištenje uz pokriće većine troškova. Zadovoljstvo na poslu prvenstveno potičemo otvorenom komunikacijom – međusobno se potičemo da dijelimo znanja, iskustva, probleme, rješenja. Budući da je zadovoljstvo na poslu povezano i sa zadovoljstvom u privatnom životu, trudimo se uspostaviti dobru ravnotežu . Radimo u open space -u, imamo nekoliko odvojenih soba za sastanke, game room za opuštanje i veliku zajedničku kuhinju. Naši uredi su pet friendly . Volimo team buildinge, proslave timskih uspjeha, rođendane, secret santu, dobru klopu i cugu i kada nemamo povoda:)",
    "jobs": [
      {
        "position": "Web developer (Python/Django/Javascript)",
        "position_desc": "Od studenta očekujemo da se, uz mentorstvo naših seniora, priključi našem development timu i pomaže radom na manjim zadacima. Od razine znanja nam je važnija želja za učenjem i pristup radu. Što možeš očekivati? - Brzo i učinkovito brušenje tvojih web vještina - Mentoring i razmjenu iskustava - Učenje novih tehnologija i principa rada - Rad na najvećim Django i JavaScript projektima u ovom dijelu Europe - Mogućnost duljeg angažmana nakon završene stručne prakse Opis poslova i zadataka na poziciji: - Uvođenje u rad - Django tutorial i rad na jednostavnim i izdvojenim funkcionalnostima - izrada micro web site-a, Python paketa, Django paketa - Vue.js tutorial i rad na jednostavnim i izdvojenim funkcionalnostima - micro JavaScript aplikacija, izrada npm paketa, unaprijeđenje funkcionalnosti postojećih projekata - Robot framework tutorial i rad na nadogradnji postojećih skripti za automatizirano testiranje",
        "n_available": 4,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "35 kn netto po satu (uz mogućnost povećanja satnice u slučaju duljeg rada)"
      }
    ]
  },
  "Suprabit": {
    "page": "www.suprabit.hr",
    "company_address": "Melengradska 3, 10000 Zagreb",
    "company_desc": "Suprabit je konzultantska i razvojna tvrtka koja pomaže klijentima iskoristiti najnovija tehnološka dostignuća kako bi transformirali svoje digitalne porizvode i usluge. Proces transformacije i suradnja omogućava klijentima da otvore nove poslovne prilike i ostanu kompetitivni na tržištu. Iduća generacija poslovnih aplikacija koristi cloud, blockchain, IoT, mobilne tehnologije i strojno učenje kako bi korisnicima ponudili sjajno korisničko iskustvo s performansama, sigurnošću i audit svojstvima korporacija budućnosti. Naše znanje počiva na 25 godina iskustva u savjetovanju i razvoju poslovnih aplikativnih rješenja, a Suprabit pri tom nudi konzultante i razvojne inženjere koji daje podršku klijentu tijekom cijelog životnog ciklusa aplikacije.",
    "jobs": [
      {
        "position": "Junior Fullstack Developer (m/ž)",
        "position_desc": "Suprabit je hrvatska IT tvrtka koja implementira rješenja bazirana na cloud, IoT i blockchain tehnologijama za domaće i strane klijente. Cilj nam je stvaranje blockchain huba, mjesta gdje bi klijenti iz cijelog svijeta mogli dobiti ekspertizu, razvojne i testne timove za razvoj blockchain baziranih financijskih, smart city, supply chain, mobility i drugih rješenja. U sklopu ljetne prakse, pridružit ćeš se timu koji radi na smart building i blockchain wallet rješenjima i imat ćeš priliku susresti se s mnoštvom novih tehnologija. Imat ćeš mentora i dobijat ćeš realne zadatke koji će biti prilagođeni tvome znanju.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Ljetnu praksu ćemo ti platiti prema odrađenim satima."
      }
    ]
  },
  "Tacta": {
    "page": "www.tacta.io",
    "company_address": "Petračićeva 4 (HUB385)",
    "company_desc": "Tacta je internacionalna tvrtka sa sjedištem u Zagrebu, Sarajevu i Bruxellesu. Naša primarna djelatnost je pomaganje klijentima u optimizaciji njihovih internih procesa pružajući im softverska rješenja na brz, pouzdan i elegantan način. Kontinuirano radimo na više velikih sustava koji su u različitim fazama razvoja. Najveći klijent kompanije je Belgijska vlada. Svi projekti se rade koristeći Agile metodologije, Test-driven development, Domain-driven design i Pair programminga. Korištenje navedenih principa omogućava dostizanje visoke kvalitete softverskih rješenja koje isporučujemo. Njegujemo i potičemo vrijednosti kao što su direktnost, otvorenost i razmjena znanja. Smatramo da su upravo ove vrijednosti temelj za izgradnju kulture feedbacka. Ovakva kultura ima za rezultat autentičan, aktivan i redovit feedback na svakom koraku u procesu razvoja softvera.",
    "jobs": [
      {
        "position": "Junior Java Developer",
        "position_desc": "Praktikanti će imati priliku raditi u timu sa 5 senior developera na razvoju novog proizvoda od početka. U toku prakse praktikanti će se upoznati sa tehnologijama Spring i Angular, osnovnim principima DDDa, TDDa, pair programminga i ostalim praksama Extreme Programminga.",
        "n_available": 2,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "14.09.2020",
        "compensation": "Po satu"
      }
    ]
  },
  "Tehnozavod-Marušić": {
    "page": "www.tehnozavod.hr",
    "company_address": "XIII Podbrežje 26, 10000 Zagreb",
    "company_desc": "Područje naših aktivnosti su sustavi tehničke sigurnosti, sustavi zaštite, audio-video sustavi, programska rješenja i integracije. Svojim aktivnostima obuhvaćamo sve bitne korake u procesu razvoja željenog sustava kako bi osigurali punu funkcionalnost, međusobnu kompatibilnost i uravnoteženost svih komponenti i optimizaciju troškova sukladno željenim karakteristikama sustava. S više od 50 godina iskustva, vodeća smo tvrtka u području tehničke sigurnosti i zaštite.",
    "jobs": [
      {
        "position": "Software Developer",
        "position_desc": "Tražimo software developera (m/ž) koji će sudjelovati u razvoju, održavanju i instalaciji modernih više-platformskih aplikacija. Razvijamo namjenske aplikacije za naše klijente koristeći ASP.NET, WPF, Microsoft SQL, itd. Tražimo komunikativnu, kreativnu i sistematičnu osobu koja će sudjelovati u razvoju s našim timom mladih stručnjaka, te koja će raditi na instalaciji i održavanju postojećih kao i novih aplikacija. U sklopu ljetne prakse, u ovisnosti o vašem znanju, možete očekivati: sudjelovanje u razvoju modula aplikacije beta testiranje i debugiranje podizanje i konfiguriranje instalacija kreiranje samostalnih pomoćnih programa za: komunikaciju sa uređajima, bržu konfiguraciju sustava, alata za napredno pretraživanje i izvještaje,... Naše su aplikacije temeljene na Microsoftu i C# no često se koriste i drugi programski jezici/alati, stoga poznavanje C# nije preduvjet za rad. Nakon stručne prakse i po dogovoru otvoreni smo za produženje suradnje bilo u obliku studentskog ugovora, bilo ugovora o radu, na početnoj ili drugoj studentu zanimljivijoj poziciji. Kompetencije Uvjeti: poznavanje rada s MS SQL bazama podataka poznavanje osnovnih pr timski rad snalažljivost i kreativnost motiviranost za rad u dinamičnom okruženju",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "20.07.2020",
        "end": "01.09.2020",
        "compensation": "prema dogovoru te dužini trajanja prakse."
      },
      {
        "position": "Suradnik na projektu",
        "position_desc": "Kao vodeća hrvatska tvrtka u području tehničke zaštite, studenticama i studentima praktikantima možemo ponuditi rad i sudjelovanje u izazovnim projektima te rad sa najnovijim tehnologijama iz svijeta sigurnosti. Studenti bi upoznavanjem sa naprednim sustavima i kompleksnim integriranim tehničkim rješenjima sudjelovali u procesu razrade i implementacije sigurnosnih sustava kod krajnjih korisnika. U ovome procesu bi se studenti upoznali sa nizom koraka poput inicijalne razrade idejnog rješenja, pripremom tehničke dokumentacije, odabirom adekvatnog rješenja te u konačnici procesom implementacije rješenja uz pripremu, testiranje i puštanje sustava u rad. Uz navedeno studenti bi se upoznali sa konceptom integrirane sigurnosti pri čemu se međusobnom interakcijom i centralnim povezivanjem velikog broja neovisnih sustava (videonadzori, protuprovale, kontrole pristupa, vatrodojave, sustavi ozvučenja itd.) stvara jedinstvena cjelina sustava sigurnosti. Kako bi se postigao funkcionalan hardverski i softverski integriran sustav sigurnosti koji je sposoban nadzirati veliki broj lokacija i podsustava potrebno je osigurati čitav niz tehničkih pretpostavki te bi se s toga studenti upoznali sa osnovama koncepta softverske integracije IoT uređaja, arhitekturom sustava kao i sa procesom naprednih integracija nužnih u svijetu sigurnosti. Sudjelovanje u izradi tehničke dokumentacije i pripremi projektne dokumentacije upoznavanje i rad sa najnovijom opreme i tehnologijama sustava sigurnosti Programiranje i priprema opreme za puštanje u rad Sudjelovanje u izradi tehničkih rješenja i ponuda Testiranje, izrada i razvoj programske podrške Podrška inženjerima voditeljima u uredu i na terenu Sudjelovanje u razvoju i implementaciji novih i inovativnih sustava i tehnologija",
        "n_available": 3,
        "n_prioritized": 0,
        "start": "13.07.2020",
        "end": "01.09.2020",
        "compensation": "topli obrok mogućnost pregovora"
      }
    ]
  },
  "Tellus d.o.o. za izradu softvera i savjetovanje": {
    "page": "https://tellus.hr/",
    "company_address": "Sjedište: Cernička 11, 10000 Zagreb Adresa ureda: Planinska 13a , 10000 Zagreb",
    "company_desc": "Informacije dostupne na https://tellus.hr/",
    "jobs": [
      {
        "position": "BIGDATA PROGRAMER",
        "position_desc": "Programiranje u jednom od sljedećih alata (Elasticsearch, Apache Kafka, Apache Spark ili Apache Cassandra)",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "DA"
      },
      {
        "position": "FRONTEND PROGRAMER",
        "position_desc": "PROGRAMIRANJE WEB APLIKACIJA KORISTEĆI FUNKCIONALNO PROGRAMIRANJE I REACTJS",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "01.09.2020",
        "compensation": "DA"
      }
    ]
  },
  "TEO-Belišće": {
    "page": "www.teo-belisce.hr",
    "company_address": "Radnička 3, 31551 Belišće",
    "company_desc": "TEO-Belišće d.o.o. Tvornica elektro opreme tvrtka je sa 30 godina tradicije u poslovima vezanim za projektiranje, proizvodnju i montažu elektrotehničke opreme u industriji i proizvodnji elektroničkih sustava za informiranje u javnom prijevozu: Industrija › Poljoprivredna industrija › Prehrambena industrija › Drvna industrija › Pitke i otpadne vode Obnovljivi izvori energije › Bioplinska postrojenja › Postrojenja na biomasu › Fotonaponska postrojenja › Off-grid fotonaponske aplikacije › Proizvodnja i upravljanje energijom Transport i informiranje › Upravljački ormari za mobilne sustave › Informacijski displeji za mobilne i stacionarne sustave u javnom prijevozu › Informacijski displeji posebnih namjena i izvedbi Ino-kooperacija › Elektromontaža i izvođenje prema dokumentaciji i zahtjevima kupca › Ispitivanje › Puštanje u rad › Održavanje",
    "jobs": [
      {
        "position": "Programer za puštanje strojeva u rad",
        "position_desc": "Trajanje prakse od 4 tjedna. Za vrijeme prakse kratko bi se prošle sve aktivnosti koje obavljaju naši zaposlenici na poziciji \"Programer za puštanje strojeva u rad\": Analiza i priprema projekta na osnovu tehnološke dokumentacije Programiranje Siemens PLC-a (TIA Portal) Izrada aplikacija za Siemens HMI (TIA Portal) Ispitivanje elektro-ormara i opreme Odlazak na teren i puštanje u rad Ostali povezani poslovi",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "06.07.2020",
        "end": "04.09.2020",
        "compensation": "Nema"
      }
    ]
  },
  "Tesla": {
    "page": "http://tesla.com.hr/",
    "company_address": "URED: ul. Đure Arnolda 8, 42240 Ivanec",
    "company_desc": "Tvrtka TESLA d.o.o. se orijentirala na pružanje intelektualnih usluga iz područja raznih tehničkih struka, a posebno elektrotehnike i energetike. Usluge koje pružamo su vezane uz projektiranje, nadzor, konzalting, inženjering i ispitivanje. Poseban naglasak kod realizacije svakog projekta dan je na energetsku efikasnost, obnovljive izvore energije i zaštitu okoliša. Dalji razvoj i punu afirmaciju tvrtke u budućnosti vidimo kroz pronalaženje aplikativnih rješenja na području energetike te promicanje energetske učinkovitosti na projektima vezanim uz sunčane elektrane, javnu rasvjetu i stambeno-poslovne zgrade. Tvrtka TESLA d.o.o. uspješno posluje od 2010. godine te okuplja u jednom timu mlade inženjere koji u partnerstvu sa iskusnim stručnjacima iz područja elektrotehnike. građevine i strojarstva doslovno svakodnevno postižu impozantne rezultate na ponos njih samih kao i tvrtke u cjelini.",
    "jobs": [
      {
        "position": "PROJEKTANT - suradnik",
        "position_desc": "TESLA d.o.o. posluje uspješno već 10 godina na području sjevero-zapadne Hrvatske gdje se profilirala u vodeću projektantsko-konzultantsku tvrtku na području sunčanih elektrana, javne rasvjete i energetske obnove zgrada te je u mogućnosti ponuditi budućim mladim inženjerima elektrotehnike održavanje prakse i stjecanje konkretnih primjenjenih znanja sa područja djelovanja kako slijedi: - sudjelovanje u izradi elektrotehničkih projekata (javna rasvjeta, priključnice, unutarnja rasvjeta, strukturno kabliranje, vatrodojava, plinodojava, kotlovnice, klimatizacija, nadzor nad izvođenjem radova) - sudjelovanje u projektiranju sunčanih elektrana u rasponu od 0,03 MW do 40 MW uključivo i autonomni baterijski sustavi - sudjelovanje u nadzoru nad izvođenjem svih elektortehničkih radova - sudjelovanje kod puštanja sunčanih elektrana u rad - sudjelovanje u izradi energetskih pregleda i energetskom certificiranju zgrada - sudjelovanje u termovizijskim ispitivanjima - sudjelovanje u ispitivanju elektrotehničkih instalacija - sudjelovanje u energetskim pregledima - sudjelovanje u izradi ponuda, popunjavanju troškovnika - sudjelovanje na poslovima poslovnog savjetovanja u korištenju sredstava HR i EU fondova - upoznavanju sa važećim zakonima, drugim propisima i stručnom literaturom - stjecanje praktičnog znanja iz realnog sektora - praćenje propisa u području graditeljstva i elektrotehnike",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "15.05.2020",
        "end": "15.09.2020",
        "compensation": "Honoriranje prakse preko student servisa. Za poseban iskazan doprinos predviđeno je bonus honoriranje. U slučaju obostrane želje moguće je razviti dulju poslovnu suradnju ili trajno zaposlenje."
      }
    ]
  },
  "Triple-Inovacije": {
    "page": "http://www.triple-innovations.com/",
    "company_address": "Budmanijeva 5, 10 000 Zagreb",
    "company_desc": "Tvrtka Triple-Inovacije d.o.o. (skraćeno Triple-I) osnovana je početkom 2012. Bavimo se razvojem i izvozom inovativnih poslovnih aplikacija najviše za telekomunikacijsku industriju. Cilj nam je zaposliti, educirati i rasti zajedno s mladim IT stručnjacima iz Hrvatske i cijelog svijeta. Naglasak dajemo na znanje (stjecanje i ponudu istog) i agilnost, a izrasli smo na dugogodišnjem iskustvu na zahtjevnim poslovnim projektima. U tvrtki radi mali tim (11) inženjera a rad i atmosferu bi najlakše mogli opisati kao drugarsku (međusobno pomaganje, učenje, druženje). Ured je smješten u poslovnom dijelu grada (kod Green Golda), gdje uz dobru glazbu, učenje i zajedničko rješavanje projektnih zadataka padaju najbolje ideje koje zovemo „Trice s centra“. Poslovna aplikacija ne mora biti dosadna, puna nevažnih podataka ili vrlo skupa, ona može i treba odgovarati potrebama klijenata i mi to znamo! Ako želite: upoznati jedan kompleksan (realan) poslovni sustav sa dobrim SW development procesom raditi sa kolegama iz Europe (Njemačka, Austrija, Slovenija, Makedonija, Srbija …) učiti o razvoju koristeći moderne web i database tehnologije (Oracle 12g, HTML5, jQuery, .NET, MVC.NET,React) ili o razvoju na još modernijim PaaS platformama (konretno Salesforce) vidjeti što je i kako u praksi izgleda agilni razvoj naučiti nešto o principima dobrog UX-a / UI-a doživjeti kako izgleda rad na kompleksnim projektima iz prve ruke jednom riječju, postati The Inženjer koji se brzo može dobro prodati na tržištu rada ... onda je ovo prava firma za vas.",
    "jobs": [
      {
        "position": "Software Developer",
        "position_desc": "Software development u nimalo dosadnoj radnoj okolini s izvrsnom ekipom i radnom atmosferom. Raditi ćete na velikim razvojnim okolinama na kojima možete steći puno konkretnih znanja i kompetencija. Kod nas praktikanti ne kuhaju kavu nego rade posao koji su došli raditi. Ne razvijamo samo softver već i ljude. Prošlogodišnji i pretprošlogodišnji praktikanti danas rade u našoj firmi i, prema njihovim riječima, veoma su zadovoljni poslom koji rade i uvjetima rada. Zašto? Dođite i uvjerite se sami! Više o nama na web-u: https://triple-innovations.com/",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "15.07.2020",
        "end": "31.08.2020",
        "compensation": "DA"
      }
    ]
  },
  "Uprise": {
    "page": "https://uprise.hr",
    "company_address": "Trg Petra Svačića 8, 10000, Zagreb",
    "company_desc": "Uprise d.o.o. je hrvatska IT tvrtka osnovana 2017. godine koja je orijentirana na razvoj inovativnih i kreativnih proizvoda i usluga s ciljem pružanja cjelovitih i primjenjivih rješenja za naše klijente. Dosadašnji razvoj obuhvaća širok spektar isporučenih proizvoda, od web aplikacija do business-to-client i business-to-business aplikacija, te cloud rješenja, pri čemu je cjelokupan razvoj uvijek temeljen na najmodernijim dostupnim tehnologijama kako bi se osigurala skalabilnost te dugovječnost isporučenih rješenja.",
    "jobs": [
      {
        "position": "Data science / AI engineer",
        "position_desc": "You will be working on client projects and supporting internal initiatives. We work on applications of large scale in the energy business, fintech, civil engineering and entertainment industry. You will be responsible for collecting, cleaning, and extracting data from a variety of systems. Developing scripts and tools to provide artificial intelligence to data of different types.",
        "n_available": 1,
        "n_prioritized": 1,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Full stack software engineer",
        "position_desc": "You will be working on client projects and supporting internal initiatives. We work on applications of large scale in the energy business, fintech, civil engineering and entertainment industry. Your responsibilities: - Development of modern backend applications based on .NET Core - Development of modern frontend applications based on React - Development of APIs based on REST API - Writing and maintaining our automated test suites - Participation in continuous improvement processes",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da"
      },
      {
        "position": "Unity 3D / Virtual Reality Immersive Developer",
        "position_desc": "You will be working on client projects and supporting internal initiatives. We work on applications of large scale in the energy business, fintech, civil engineering and entertainment industry. As a Unity Developer at UpRise, you will collaborate with developers and designers to build beautiful, functional applications in the realm of Virtual and Augmented realities and 3D Games using a variety of cutting-edge technologies.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "Da"
      }
    ]
  },
  "Vertiv Croatia": {
    "page": "https://www.vertiv.com",
    "company_address": "Oreškovićeva 6N/2",
    "company_desc": "VERTIV je svjetski lider u području telekomunikacijske i IT infrastrukture. Imamo dugogodišnje iskustvo u području razvoja i proizvodnje integriranih modularnih rješenja, energetskih sustava, klimatizacijskih sustava i cjelovitih rješenja za naftnu, telekomunikacijsku i IT industriju. Ponosni smo da smo postali ekspertni centar za inženjering modularnih data centara na globalnom nivou.",
    "jobs": [
      {
        "position": "Projektiranje električnih instalacija u data centrima",
        "position_desc": "Studentska praksa u Design odjelu u trajanju od 1 mjesec (točan termin početka i završetka po dogovoru) Projektiranje električnih instalacija u data centrima: Izrada jednopolnih shema i shema ožičenja, Kabel lista, Dimenzioniranje kabela, Proračun rasvjete, Load kalkulacija, Dimenzioniranje distribucija i odabir sklopne opreme. Besprekidni sustavi napajanja i baterije: Proračun autonomije Dimenzioniranje UPS-a Footprint i odabir baterijskih rackova Izrada dokumentacije i proračuna u sljedećim softverskim alatima: Autodesk Revit Autocad ePlan Dialux, ElumTools Kunstmann, Nirvana",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "DA"
      },
      {
        "position": "Projektiranje sustava nadzora u data centrima",
        "position_desc": "Studentska praksa u Design odjelu u trajanju od 1 mjesec (točan termin početka i završetka po dogovoru) Izrada mrežnog dijagrama Izrada popisa točaka koje će sustav nadzirati Osnove sustava za prikaz parametara (SCADA)",
        "n_available": 2,
        "n_prioritized": 0,
        "start": "01.07.2020",
        "end": "30.09.2020",
        "compensation": "DA"
      }
    ]
  },
  "Xylon": {
    "page": "www.logicbricks.com",
    "company_address": "Fallerovo šetalište 22 HR-10000, Zagreb",
    "company_desc": "",
    "jobs": [
      {
        "position": "3D rekonstrukcija korištenjem strukturiranog svjetla",
        "position_desc": "U MATLAB-u je potrebno implementirati algoritam za nalaženje 3D rekonstrukcije korištenjem strukturiranog svjetla. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Automatsko određivanje parametara leće (centar, krivulja zakrivljenosti) korištenjem optičkog toka",
        "position_desc": "Potrebno je pronaći i u MATLAB-u implementirati algoritam za nalaženje parametara leće (centar, krivulja zakrivljenosti) korištenjem optičkog toka. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Crtanje grafova u C++",
        "position_desc": "Potrebno je kreirati vlastiti SW za crtanje primitiva poput tocke, linije, alfanumerickih znakova, trokuta, ..itd. Pomocu primitiva napisati rutine za crtanje slozenijih elemenata poput 2D/3D linijskog grafa, stupcastog grafa, tabela, ...itd. SW se prvo modelira u Matlabu , a potom finalna verzija u C++. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Integracija algoritma za izjednačavanje boja nad skupom slika u postojeći programski sustav za računalni vid",
        "position_desc": "Potrebno je integrirati algoritam za izjednačavanje boja nad skupom slika u već postojeći programski sustav za računalni vid. U prvoj fazi prakse student se upoznaje s postojećim algoritmom i programskim sustavom, a u drugoj fazi slijedi integracija algoritma u Matlab-u i C-u. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Istraživanje i implementacija “XCP over CAN“ protokola na embedded sustav",
        "position_desc": "Istražiti XCP protokol i predložiti način implementacije na postojeći Embedded Linux OS koji upravlja sa radom Xylonovog video i data loggera (logiRECORDER). Ovisno u dostupnom vremenu moguća i implementacija. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Istraživanje i implementacija “XCP over Ethernet“ protokola na embedded sustav",
        "position_desc": "Istražiti XCP protokol i predložiti način implementacije na postojeći Embedded Linux OS koji upravlja sa radom Xylonovog video i data loggera (logiRECORDER).. Ovisno u dostupnom vremenu moguća i implementacija. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Istraživanje SOME/IP protokola i implementacija na embedded sustav",
        "position_desc": "Istražiti SOME/IP protokol i predložiti način implementacije na postojeći Embedded Linux OS koji upravlja sa radom Xylonovog video i data loggera (logiRECORDER).. Ovisno u dostupnom vremenu moguća i implementacija. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Izrada behavioral modela za JPEG dekoder",
        "position_desc": "Dizajn i test RTL simulacijskog modela JPEG decodera u ModelSim test okruženju. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Izrada behavioral modela za JPEG enkoder",
        "position_desc": "Dizajn i test RTL simulacijskog modela JPEG enkodera u ModelSim test okruženju. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      },
      {
        "position": "Određivanje optimalnih preklopnih podrucja prilikom generiranja panoramskih slika",
        "position_desc": "U MATLAB-u je potrebno implementirati algoritam za pronalazenje preklopnih podrucja prilikom spajanja vise slika u panoramski pogled. Optimalna preklopna podrucja maksimiziraju kvalitetu panorarmske slike. Planirano trajanje prakse je 3 do 4 tjedna. Termin u skladu s dogovorom. Mogućnost rada na daljinu. Moguć nastavak suradnje nakon završetka prakse kroz honorirani studentski rad.",
        "n_available": 1,
        "n_prioritized": 0,
        "start": "",
        "end": "",
        "compensation": "Plaćen topli obrok"
      }
    ]
  }
}